{
    "characters": [
        {
            "key": "Albedo",
            "name": "Albedo",
            "description": "A genius known as the Kreideprinz, he is the Chief Alchemist and Captain of the Investigation Team of the Knights of Favonius.",
            "skills": [
                {
                    "key": "s1",
                    "title": "Favonius Bladework - Weiss",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Perform up to 5 rapid strikes.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Consumes a certain amount of Stamina to unleash 2 rapid sword strikes.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": "Plunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Abiogenesis: Solar Isotoma",
                    "description": null,
                    "abilities": [
                        {
                            "name": "Solar Isotoma",
                            "description": "Albedo creates a Solar Isotoma using alchemy, which deals AoE Geo DMG on appearance.",
                            "descriptions": [
                                "When enemies within the Solar Isotoma zone are hit, the Solar Isotoma will generate Transient Blossoms which deal AoE Geo DMG. DMG dealt scales off Albedo's DEF.",
                                "Transient Blossoms can only be generated once every 2s.",
                                "When a character is located at the locus of the Solar Isotoma, the Solar Isotoma will accumulate Geo power to form a crystallized platform that lifts the character up to a certain height. Only one crystallized platform can exist at a time.",
                                "Solar Isotoma is considered a Geo construct."
                            ]
                        },
                        {
                            "key": "a2",
                            "description": "Hold to designate the location of the skill.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s3",
                    "title": "Rite of Progeniture: Tectonic Tide",
                    "description": "Under Albedo's command, Geo crystals surge and burst forth, dealing AoE Geo DMG in front of him.\nIf a Solar Isotoma created by Albedo himself is on the field, 7 Fatal Blossoms will be generated in the Solar Isotoma field, bursting violently into bloom and dealing AoE Geo DMG.\nTecotonic Tide DMG and Fatal Blossom DMG will not generate Transient Blossoms.",
                    "abilities": []
                }
            ],
            "passives": [
                {
                    "key": "p1",
                    "title": "Flash of Genius",
                    "description": "When Albedo crafts Weapon Ascension Materials, he has a 10% chance to receive double the product.",
                    "descriptions": []
                },
                {
                    "key": "p2",
                    "title": "Calcite Might",
                    "description": "Transient Blossoms generated by Abiogenesis: Solar Isotoma deal 25% more DMG to enemies whose HP is below 50%.",
                    "descriptions": []
                },
                {
                    "key": "p3",
                    "title": "Homuncular Nature",
                    "description": "Using Rite of Progeniture: Tectonic Tide increases the Elemental Mastery of nearby party members by 125 for 10s.",
                    "descriptions": []
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "Flower of Eden",
                    "description": "Transient Blossoms generated by Albedo's Abiogenesis: Solar Isotoma regenerate 1.2 Energy for Albedo.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c2",
                    "title": "Opening of Phanerozoic",
                    "description": "Transient Blossoms generated by Abiogenesis: Solar Isotoma grant Albedo Fatal Reckoning for 30s:",
                    "secondDescription": "Unleashing Rite of Progeniture: Tectonic Tide consumes all stacks of Fatal Reckoning, increasing the DMG dealt by the Tectonic Tide and Fatal Blossoms based on the number of stacks consumed.",
                    "descriptions": [
                        "Each stack of Fatal Reckoning increases DMG by of Albedo's DEF.",
                        "The effect stacks up to 4 times."
                    ]
                },
                {
                    "key": "c3",
                    "title": "Grace of Helios",
                    "description": "Increases the level of Abiogenesis: Solar Isotoma by 3. Maximum upgrade level is 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "Descent of Divinity",
                    "description": "Solar Isotoma increases Plunging Attack DMG by 30% for active party members within the AoE.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "Tide of Hadaen",
                    "description": "Increases the level of Rite of Progeniture: Tectonic Tide by 3. Maximum upgrade level is 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "Dust of Purification",
                    "description": "If active party members within the AoE are protected by a shield created by Crystallize, Solar Isotoma increases their DMG by 17%.",
                    "secondDescription": null,
                    "descriptions": []
                }
            ]
        },
        {
            "key": "Amber",
            "name": "Amber",
            "description": "Always energetic and full of life, Amber’s the best - albeit only - Outrider of the Knights of Favonius.",
            "skills": [
                {
                    "key": "s1",
                    "title": "Sharpshooter",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Performs up to 5 consecutive shots with a bow.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Perform a more precise Aimed Shot with increased DMG. While aiming, flames accumulates on the arrowhead. A fully charged flaming arrow will deal Pyro DMG.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": "Fires off a shower of arrows in mid-air before falling and striking the ground, dealing AoE DMG upon impact.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Baron Bunny",
                    "description": null,
                    "abilities": [
                        {
                            "name": "Baron Bunny",
                            "description": null,
                            "descriptions": [
                                "Continuously taunts the enemy, drawing their fire.",
                                "Baron Bunny’s HP scales with Amber’s Max HP.",
                                "When destroyed or when its timer expires, Baron Bunny explodes, dealing AoE Pyro DMG."
                            ]
                        },
                        {
                            "key": "a2",
                            "description": "Adjusts the throwing direction of Baron Bunny.The longer the button is held, the further the throw.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s3",
                    "title": "Fiery Rain",
                    "description": "Fires of a shower of arrows, dealing continuous AoE Pyro DMG.",
                    "abilities": []
                }
            ],
            "passives": [
                {
                    "key": "p1",
                    "title": "Gliding Champion",
                    "description": "Decreases all party members’ gliding Stamina Consumption by 20%. The greatest effect out of all Talents of the same type prevails.",
                    "descriptions": []
                },
                {
                    "key": "p2",
                    "title": "Every Arrow Finds Its Target",
                    "description": "Increases the CRIT Rate of Fiery Rain by 10% and widens its AoE by 30%.",
                    "descriptions": []
                },
                {
                    "key": "p3",
                    "title": "Precise Shot",
                    "description": "Aimed Shot hits on weak spots increase Base ATK by 15% for 10s.",
                    "descriptions": []
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "One Arrow to Rule Them All",
                    "description": "Fires 2 arrows per Aimed Shot. The second arrow deals 20% of the first arrow’s DMG.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c2",
                    "title": "Bunny Triggered",
                    "description": "Baron Bunny, new and improved! Hitting Baron Bunny’s foot with a fully-charged Aimed Shot manually detonates it. Explosion via manual detonation deals 200% additional DMG.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c3",
                    "title": "It Burns!",
                    "description": "Increases the Level of Fiery Rain by 3. Maximum upgrade level is 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "It’s Not Just Any Doll...",
                    "description": "Decreases Explosive Puppet’s CD by 20%. Adds 1 additional charge.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "It’s Baron Bunny!",
                    "description": "Increase the Level of Explosive Puppet by 3.Maximum upgrade level is 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "Wildfire",
                    "description": "Fiery Rain increases Amber’s Movement SPD by 15% and Base ATK by 15% for 10s.",
                    "secondDescription": null,
                    "descriptions": []
                }
            ]
        },
        {
            "key": "Ayaka",
            "pending": true,
            "name": "Ayaka",
            "description": "The secretary at Yuehai Pavilion. The blood of the qilin, an illuminated beast, flows within her veins.",
            "skills": [],
            "passives": [],
            "constellations": []
        },
        {
            "key": "Barbara",
            "name": "Barbara",
            "description": "Every denizen of Mondstadt adores Barbara. However, she learned the word \"idol\" from a magazine.",
            "skills": [
                {
                    "key": "s1",
                    "title": "Whisper of Water",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Perform up to 4 water splashes attacks that deal Hydro DMG.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Consumes a certain amount of Stamina to deal AoE Hydro DMG after a short casting time.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": "Gathering the might of Hydro, Barbara plunges towards the ground from mid-air, damaging all enemies in her path. Deals AoE Hydro DMG upon impact with the ground.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Let the Show Begin",
                    "description": "Summons water droplets resembling musical notes that form a Melody Loop, dealing Hydro DMG to surrounding enemies and afflicting them with the Wet status.",
                    "abilities": [
                        {
                            "name": "Melody Loop",
                            "description": null,
                            "descriptions": [
                                "Barbara's Normal Attacks heal all party members and nearby allied characters for a certain amount of HP, which scales with Barbara's Max HP.",
                                "Her Charged Attack generates 4 times the amount of healing.",
                                "Regenerates a certain amount of the current character’s HP at regular intervals.",
                                "Applies the Wet status to the character and enemies who come in contact with them."
                            ]
                        }
                    ]
                },
                {
                    "key": "s3",
                    "title": "Shining Miracle",
                    "description": "Heals friendly forces and all parties for a large amount of HP that scales with Barbara’s Max HP.",
                    "abilities": []
                }
            ],
            "passives": [
                {
                    "key": "p1",
                    "title": "With My Whole Heart",
                    "description": "When a Perfect Cooking is achieved on a dish with restorative effects, there is a 12% chance to obtain double the product.",
                    "descriptions": []
                },
                {
                    "key": "p2",
                    "title": "Glorious Season",
                    "description": "The Stamina Consumption of characters within Let the Show Begin's Melody Loop is reduced by 12%.",
                    "descriptions": []
                },
                {
                    "key": "p3",
                    "title": "Encore",
                    "description": "When a character gains an Elemental Orb/Particle, the duration of Let the Show Begin’s Melody Loop is extended by 1s. The maximum extension is 5s.",
                    "descriptions": []
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "Gleeful Songs",
                    "description": "Barbara regenerates 1 Energy every 10s.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c2",
                    "title": "Vitality Burst",
                    "description": "Decreases the CD of Let the Show Begin by 15%. During the ability’s duration, the current character gains 15% Hydro DMG Bonus.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c3",
                    "title": "Star of Tomorrow",
                    "description": "Increases the Level of Shining Miracle by 3. Maximum upgrade level is 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "Attentiveness be My Power",
                    "description": "Every enemy hit by Barbara’s Charged Attack regenerates 1 Energy for her. A maximum of 5 energy can be regenerated in this manner with any one Charged Attack.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "The Purest Companionship",
                    "description": "Increases the Level of Let the Show Begin by 3.\nMaximum upgrade level is 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c1",
                    "title": "Dedicating Everything to You",
                    "description": "When Barbara is not on the field, and the character in play falls:",
                    "secondDescription": "This effect can only occur once every 15 mins.",
                    "descriptions": [
                        "Automatically revives this character.",
                        "Fully regenerates this character's HP by 100%."
                    ]
                }
            ]
        },
        {
            "key": "Beidou",
            "name": "Beidou",
            "description": "Beidou is the leader of the Crux — an armed fleet based in Liyue Harbor. An armed fleet means exactly what it sounds like: a fleet of ships armed to the teeth.",
            "skills": [
                {
                    "key": "s1",
                    "title": "Oceanborne",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Performs up to 5 successive strikes.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Drains Stamina over time to perform continuous slashes. At end of the sequence, perform a more powerful slash.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": "Plunges from mid-air to strike the ground, damaging enemies along the path and dealing AoE DMG upon impact.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Tidecaller",
                    "description": "Nothing to worry about. Should anyone raise a hand against her or her men, she will avenge it ten-fold with sword and thunder.",
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Accumulating the power of lightning, Beidou swings her blade forward fiercely, dealing Electro DMG.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Lifts her weapon up as a shield. Max DMG absorbed scales off Beidou’s Max HP. Attacks using the energy stored within the greatsword upon release or once this ability’s duration expires, dealing Electro DMG. DMG dealt scales with the number of times Beidou is attacked in the skill’s duration. The greatest DMG Bonus will be attained once this effect is triggered twice. The shield possesses the following properties:",
                            "descriptions": [
                                "Has 250% Electro DMG Absorption Efficiency.",
                                "Applies the Electro element to Beidou upon activation."
                            ]
                        }
                    ]
                },
                {
                    "key": "s3",
                    "title": "Stormbreaker",
                    "description": "Recalling her slaying of the great beast Haishan. Beidou calls upon that monstrous strength and the lightning to create a Thunderbeast’s Targe around herself, dealing Electro DMG to nearby opponents.",
                    "abilities": [
                        {
                            "name": "Thunderbeast’s Targe",
                            "description": null,
                            "descriptions": [
                                "When Normal and Charged Attacks hit, they create a lightning discharge that can jump between enemies, dealing Electro DMG.",
                                "Increases the character’s resistance to interruption, and decreases DMG taken.",
                                "A maximum of 1 lightning discharge can be triggered per second."
                            ]
                        }
                    ]
                }
            ],
            "passives": [
                {
                    "key": "p1",
                    "title": "Conqueror of Tides",
                    "description": "Decreases all party member’s swimming Stamina consumption by 20%.",
                    "descriptions": []
                },
                {
                    "key": "p2",
                    "title": "Retribution",
                    "description": "Counterattacking with Tidecaller at the precise moment when the character is hit grants the maximum DMG Bonus.",
                    "descriptions": []
                },
                {
                    "key": "p3",
                    "title": "Leviathan’s Protection",
                    "description": "Gain the following effects for 10s after unleashing Tidecaller with its maximum DMG Bonus:",
                    "descriptions": [
                        "DMG dealt by Normal and Charged Attacks is increased by 15%. ATK SPD of Normal and Charged Attacks is increased by 15%.",
                        "Greatly reduced delay before unleashing Charged Attacks."
                    ]
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "Sea Beast’s Scourge",
                    "description": "When Stormbreaker is used:",
                    "secondDescription": null,
                    "descriptions": [
                        "Creates a shield that absorbs up to 16% of Beidou’s Max HP for 15s.",
                        "This shield absorbs Electro DMG 250% more effectively."
                    ]
                },
                {
                    "key": "c2",
                    "title": "Upon the Turbulent Sea, the Thunder Arises",
                    "description": "Stormbreaker’s arc lightning can jump 2 additional targets.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c3",
                    "title": "Summoner of Storm",
                    "description": "Increases the Level of Tidecaller by 3. Maximum upgrade level is 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "Stunning Revenge",
                    "description": "Within 10s of taking DMG, Beidou’s Normal Attacks gain 20% additional Electro DMG.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "Crimson Tidewalker",
                    "description": "Increase the Level of Stormbreaker by 3. Maximum upgrade level is 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "Bane of Evil",
                    "description": "During the duration of Stormbreaker, the Electro RES of surrounding enemies is decreased by 15%.",
                    "secondDescription": null,
                    "descriptions": []
                }
            ]
        },
        {
            "key": "Bennett",
            "name": "Bennett",
            "description": "A righteous and good-natured adventurer from Mondstadt who’s unfortunately extremely unlucky.",
            "skills": [
                {
                    "key": "s1",
                    "title": "Strike of Fortune",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Perform up to 5 rapid strikes.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Consumes a certain amount of Stamina to unleash 2 rapid sword swings.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": "Plunges from mid-air to strike the ground below, damaging enemies along the path and dealing AoE DMG upon impact.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Passion Overload",
                    "description": "Bennett puts all his fire and passion for adventuring into his sword. Results may vary based on how fired up he is.",
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "A single, swift flame strike that deals Pyro DMG.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Charges up, resulting in different effects when unleashed based on the Charge Level.",
                            "secondDescription": "Bennett takes no damage from being launched.",
                            "descriptions": [
                                "Level 1: Strikes twice, dealing Pyro DMG and launching enemies.",
                                "Level 2: Unleashes 3 consecutive attacks that deal impressive Pyro DMG, but the last attack triggers an explosion that launches both Bennet and the enemy."
                            ]
                        }
                    ]
                },
                {
                    "key": "s3",
                    "title": "Fantastic Voyage",
                    "description": "Bennett leaps towards the enemy and performs a plunging attack, dealing Pyro DMG, creating an Inspiration Field.",
                    "abilities": [
                        {
                            "name": "Inspiration Field",
                            "description": null,
                            "descriptions": [
                                "If the health of a character in the circle is equal to or falls below 70%, their health will continuously regenerate. Regeneration scales based on Bennett’s Max HP.",
                                "If the health of a character in the circle is higher than 70%, they gain an ATK Bonus that is based on Bennett’s Base ATK.",
                                "Applies the Pyro element to characters within the Field."
                            ]
                        }
                    ]
                }
            ],
            "passives": [
                {
                    "key": "p1",
                    "title": "It Should Be Safe...",
                    "description": "When dispatched on an expedition in Mondstadt, time consumed is reduced by 25%.",
                    "descriptions": []
                },
                {
                    "key": "p2",
                    "title": "Rekindle",
                    "description": "Decreases Passion Overload’s CD by 20%.",
                    "descriptions": []
                },
                {
                    "key": "p3",
                    "title": "Fearnaught",
                    "description": "When inside the area created by Fantastic Voyage, Passion Overload takes on the following effects:",
                    "descriptions": [
                        "CD is reduced by 50%.",
                        "Bennett will not be launched by the effects of Charge Level 2."
                    ]
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "Grand Expectation",
                    "description": "Fantastic Voyage’s ATK increases no longer has an HP restriction, and gains an additional 20% Base ATK.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c2",
                    "title": "Impasse Conqueror",
                    "description": "When Bennett’s HP falls below 70%, his Energy Recharge is increased by 30%.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c3",
                    "title": "Unstoppable Fervor",
                    "description": "Increases the Level of Passion Overload by 3. Maximum upgrade level is 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "Unexpected Odyssey",
                    "description": "Using a Normal Attack when executing the second attack of Passion Overload’s Charge Level 1 allows an additional attack to be performed. This additional attack does 135% of the second attack’s DMG.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "True Explorer",
                    "description": "Increase the Level of Fantastic Voyage by 3. Maximum upgrade level is 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "Fire Ventures with Me",
                    "description": "Sword, Claymore, or Polearm-wielding characters inside Fantastic Voyage’s radius gain a 15% Pyro DMG Bonus. Normal and Charged Attacks now do Pyro DMG.",
                    "secondDescription": null,
                    "descriptions": []
                }
            ]
        },
        {
            "key": "Chongyun",
            "name": "Chongyun",
            "description": "A young exortcist from a family of exorcists. He does everything he can to suppress his pure positive energy.",
            "skills": [
                {
                    "key": "s1",
                    "title": "Demonbane",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Performs up to 4 consecutive strikes.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Drains Stamina over time to perform continuous swirling attacks against all nearby enemies. At end of the sequence, perform a more powerful slash.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": "Plunges from mid-air to strike the ground below, damaging enemies along the path and dealing AoE DMG upon impact.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Spirit Blade - Chonghua’s Layered Frost",
                    "description": "Chongyun strikes the ground with his greatsword, causing a Cryo explosion in a circular AoE in front of him that deals Cryo DMG. After a short delay, the cold air created by the Cryo explosion will coalesce into a Chonghua Frost Field, within which all DMG done through Normal and Charged Attacks by Sword, Greatsword and Polearm-wielding characters will be converted to Cryo DMG.",
                    "abilities": []
                },
                {
                    "key": "s3",
                    "title": "Spirit Blade - Cloud-parting Star",
                    "description": "Performing the secret hand seals, Chongyun summons 3 giant spirit blades in mid-air that fall to the earth one by one after a short delay, exploding as they hit the ground. When the spirit blades explode, they will deal AoE Cryo DMG and launch enemies.",
                    "abilities": []
                }
            ],
            "passives": [
                {
                    "key": "p1",
                    "title": "Gallant Journey",
                    "description": "When dispatched on an expedition in Liyue, time consumed is reduced by 25%.",
                    "descriptions": []
                },
                {
                    "key": "p2",
                    "title": "Steady Breathing",
                    "description": "Sword, Claymore, or Polearm-wielding characters within the field created by Spirit Blade - Chonghua’s Layered Frost have their Normal Attack SPD increased by 8%.",
                    "descriptions": []
                },
                {
                    "key": "p3",
                    "title": "Rimechaser Blade",
                    "description": "When the field created by Spirit Blade - Chonghua’s Layered Frost disappears, another spirit will be summoned to strike nearby enemies, dealing 100% of Chonghua’s Layered Frost’s Skill DMG as AoE Cryo DMG. Enemies hit by this blade will have their Cryo RES decreased by 10% for 8s.",
                    "descriptions": []
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "Ice Unleashed",
                    "description": "The last attack of Chongyun’s Normal Attack combo releases 3 ice blades. Each blade deals 50% of Chongyun’s ATK as Cryo DMG to all enemies in its path.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c2",
                    "title": "Atmospheric Revolution",
                    "description": "Elemental Skills and Elemental Bursts cast within the Frost Field created by Spirit Blade - Chongyun’s Layered Frost have their CD time decreased by 15%.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c3",
                    "title": "Cloudburst",
                    "description": "Increases the Level of Spirit Blade - Cloud-parting Star by 3. Maximum upgrade level is 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "Frozen Skies",
                    "description": "Chongyun regenerates 1 Energy every time he hits an enemy affected by Cold or Frozen status effects. This effect can only occur once every 2s.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "The True Path",
                    "description": "Increases the level of Spirit Blade - Chongyun’s Layered Frost by 3. Maximum upgrade level is 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "Rally of Four Blades",
                    "description": "Spirit Blade - Cloud-parting Star deals 15% more DMG to enemies with a lower percentage of their Max HP remaining than Chongyun. This skill will also summon 1 additional spirt blade.",
                    "secondDescription": null,
                    "descriptions": []
                }
            ]
        },
        {
            "key": "Diluc",
            "name": "Diluc",
            "description": "The tycoon of a winery empire in Mondstadt, unmatched in every possible way.",
            "skills": [
                {
                    "key": "s1",
                    "title": "Tempered Sword",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Performs up to 4 consecutive strikes.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Drains Stamina over time to perform continuous slashes. At the end of the sequence, perform a more powerful slash.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": "Plunges from mid-air to strike the ground, damaging enemies along the path and dealing AoE DMG upon impact.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Searing Onslaught",
                    "description": "Performs a forward slash that deals Pyro DMG. This skill can be used 3 times consecutively. Enters CD if not cast again within a short period.",
                    "abilities": []
                },
                {
                    "key": "s3",
                    "title": "Dawn",
                    "description": "Releases intense flames to knock nearby enemies back, dealing Pyro DMG. The flames then converge into the weapon, summoning a Phoenix that flies forward and deals massive Pyro DMG to all enemies in its path. The Phoenix explodes upon reaching its destination, causing a large amount of AoE Pyro DMG. The searing flames that run down his blade cause Diluc’s Normal and Charged Attacks to deal Pyro DMG for a time.",
                    "abilities": []
                }
            ],
            "passives": [
                {
                    "key": "p1",
                    "title": "Tradition of the Dawn Knight",
                    "description": "Refunds 15% of the ores used when crafting Claymore-type weapons.",
                    "descriptions": []
                },
                {
                    "key": "p2",
                    "title": "Relentless",
                    "description": "Diluc’s Charged Attack Stamina Cost is decreased by 50%, and its duration is increased by 3s.",
                    "descriptions": []
                },
                {
                    "key": "p3",
                    "title": "Blessing of Phoenix",
                    "description": "The Pyro Enchantment provided by Dawn lasts for 4s longer. Additionally, Diluc gains 20% Pyro DMG Bonus during the duration of this effect.",
                    "descriptions": []
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "Conviction",
                    "description": "Diluc deals 15% more DMG to enemies whose HP is above 50%.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c2",
                    "title": "Searing Ember",
                    "description": "When Diluc takes DMG, his Base ATK increases by 10% and his ATK SPD increases by 5%. Lasts for 10s. This effect can stack up to 3 times and can only occur once every 1.5s.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c3",
                    "title": "Steel and Fire",
                    "description": "Increases the Level of Searing Onslaught by 3. Maximum upgrade level is 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "Flowing Flame",
                    "description": "Casting Searing Onslaught in sequence greatly increases damage dealt. Within 2s of using Searing Onslaught, casting the next Searing Onslaught in the combo deals 40% additional DMG. This effect lasts for the next 2s.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "Phoenix, Harbinger of Dawn",
                    "description": "Increases the level of Dawn by 3. Maximum upgrade level is 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "Flaming Sword, Nemesis of Dark",
                    "description": "After casting Searing Onslaught, the next 2 Normal Attacks within the next 6s will have their DMG and ATK SPD increased by 30%. Additionally, Searing Onslaught will not interrupt the Normal Attack combo.",
                    "secondDescription": null,
                    "descriptions": []
                }
            ]
        },
        {
            "key": "Diona",
            "name": "Diona",
            "description": "A young lady who has inherited trace amounts of non-human blood. She is the incredible popular bartender of the Cat’s Tail tavern.",
            "skills": [
                {
                    "key": "s1",
                    "title": "Katzlein Style",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Performs up to 5 consecutive shots with a bow.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Perform a more precise Aimed Shot with increased DMG. While aiming, biting frost accumulates on the arrowhead. A fully charged frost arrow will deal Cryo DMG.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": "Fires off a shower of arrows in mid-air before falling and striking the ground, dealing AoE DMG upon impact.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Icy Paws",
                    "description": "Fires an Icy Paw that deals Cryo DMG to opponents and forms a shield on hit. The shield’s DMG Absorption scales based on Diona’s Max HP, and its duration scales off the number of Icy Paws that hit their target.",
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Rapidly fires off 2 Icy Paws.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Dashes back quickly before firing five Icy Paws. The shield created by a Hold attack will gain a 75% DMG Absorption Bonus. The shield has a 250% Cryo DMG Absorption Bonus, and will cause your active character to become affected by Cryo at the point of formation for a short duration.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s3",
                    "title": "Signature Mix",
                    "description": "Tosses out a special cold brew that deals AoE Cryo DMG and creates a Drunken Mist in an AoE.",
                    "abilities": [
                        {
                            "name": "Drunken Mist",
                            "description": null,
                            "descriptions": [
                                "Deals continuous Cryo DMG to opponents within the AoE.",
                                "Continuously regenerates the HP of characters within the AoE."
                            ]
                        }
                    ]
                }
            ],
            "passives": [
                {
                    "key": "p1",
                    "title": "Complimentary Bar Food",
                    "description": "When a Perfect Cooking is achieved on a dish with restorative effects, there is a 12% chance to obtain double the product.",
                    "descriptions": []
                },
                {
                    "key": "p2",
                    "title": "Cat’s Tail Secret Menu",
                    "description": "Characters shielded by Icy Paws have their Movement SPD increased by 10% and their Stamina Consumption decreased by 10%.",
                    "descriptions": []
                },
                {
                    "key": "p3",
                    "title": "Drunkard’s Farce",
                    "description": "Opponents who enter the AoE of Signature Mix have 10% decreased ATK for 15s.",
                    "descriptions": []
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "A Lingering Flavor",
                    "description": "Regenerates 15 Energy for Diona after the effects of Signature Mix end.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c2",
                    "title": "Shaken, Not Purred",
                    "description": "Increases Icy Paws’ DMG by 15%, and increases its shield’s DMG Absorption by 15%. Additionally, when paws hit their targets, creates a shield for other nearby characters on the field with 50% of the Icy Paws shield’s DMG Absorption for 5s.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c3",
                    "title": "A-Another Round?",
                    "description": "Increases the Level of Signature Mix by 3. Maximum upgrade level is 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "Wine Industry Slayer",
                    "description": "Within the radius of Signature Mix, Diona’s charge time for aimed shots is reduced by 60%.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "Double Shot, On The Rocks",
                    "description": "Increases the level of Icy Paws by 3. Maximum upgrade level is 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "Cat’s Tail Closing Time",
                    "description": "Characters within Signature Mix’s radius will gain the following effects based on their HP amounts:",
                    "secondDescription": null,
                    "descriptions": [
                        "Increasing Incoming Healing Bonus by 30% when HP falls below or is equal to 50%.",
                        "Elemental Mastery is increased by 200 when HP is above 50%."
                    ]
                }
            ]
        },
        {
            "key": "Fischl",
            "name": "Fischl",
            "description": "A mysterious girl who calls herself \"Prinzessia der Verurteilung\" and travels with a night raven named Oz.",
            "skills": [
                {
                    "key": "s1",
                    "title": "Bolts of Downfall",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Performs up to 5 consecutive shots with a bow.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Perform a more precise Aimed Shot with increased DMG. While aiming, the dark lightning spirits of Immernachtreich shall heed the call of their Prinzessin and indwell the enchanted arrowhead. When fully indwelt, the Rachsuchtig Blitz shall deal immense Electro DMG.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": "Fires off a shower of arrows in mid-air before falling and striking the ground, dealing AoE DMG upon impact.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Nightrider",
                    "description": "Summons Oz, the night raven forged of darkness and lightning descends upon the land, dealing Electro DMG in a small AoE. For the ability’s duration, Oz will continuously attack nearby enemies with Freikugel. Hold to adjust the location Oz will be summoned to. Press again any time during the ability’s duration to once again summon him to Fischl’s side.",
                    "abilities": []
                },
                {
                    "key": "s3",
                    "title": "Midnight Phantasmagoria",
                    "description": "Summons Oz to spread his twin swings of twilight and defend Fischl. Has the following properties during the ability’s duration:",
                    "abilities": [
                        {
                            "name": "",
                            "description": null,
                            "descriptions": [
                                "Fischl takes on Oz’s form, greatly increasing her Movement Speed.",
                                "Strikes nearby enemies with lightning, dealing Electro DMG to enemies she comes into contact with. Each enemy can only be struck once.",
                                "Once this ability’s effects end, Oz will remain on the battlefield and attack his Prinzessin’s foes. If Oz is already on the field, then this will reset the duration of his presence."
                            ]
                        }
                    ]
                }
            ],
            "passives": [
                {
                    "key": "p1",
                    "title": "Mein Hausgarten",
                    "description": "When dispatched on an expedition in Mondstadt, time consumed is reduced by 25%.",
                    "descriptions": []
                },
                {
                    "key": "p2",
                    "title": "Stellar Predator",
                    "description": "When Fischl hits Oz with a fully-charged Aimed Shot, Oz brings down Thundering Retribution, dealing AoE Electro DMG equal to 152.7% of the arrow’s DMG.",
                    "descriptions": []
                },
                {
                    "key": "p3",
                    "title": "Undone Be Thy Sinful Hex",
                    "description": "If a character triggers an Electro-related Elemental Reaction when Oz is on the field, the enemy shall be stricken with Thundering Retribution, dealing Electro DMG equal to 80% of Fischl’s ATK.",
                    "descriptions": []
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "Gaze of the Deep",
                    "description": "Even when Oz is not present in combat, he can still watch over Fischl through his raven eyes. When Fischl attacks an enemy, Oz fires a joint attack, dealing 22% of ATK DMG.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c2",
                    "title": "Devourer of All-Sins",
                    "description": "When Nightrider is used, it deals an additional 200% ATK as DMG, and its AoE is increased by 50%.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c3",
                    "title": "Wings of Nightmare",
                    "description": "Increases the Level of Nightrider by 3. Maximum upgrade level is 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "Her Pilgrimage of Bleak",
                    "description": "When Midnight Phatasmagoria is used, it deals 222% of ATK as Electro DMG to surrounding enemies. When the skill duration ends, Fischl regenerates 20% of her HP.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "Against the Fleeing Light",
                    "description": "Increase the Level of Midnight Phantasmagoria by 3. Maximum upgrade level is 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "Evernight Raven",
                    "description": "Increases the duration of Oz’s summoning by 2s. Additionally, Oz attacks with the current character when present, dealing 30% of Fischl’s ATK as Electro DMG.",
                    "secondDescription": null,
                    "descriptions": []
                }
            ]
        },
        {
            "key": "Ganyu",
            "pending": true,
            "name": "Ganyu",
            "description": "The secretary at Yuehai Pavilion. The blood of the qilin, an illuminated beast, flows within her veins.",
            "skills": [],
            "passives": [],
            "constellations": []
        },
        {
            "key": "Jean",
            "name": "Jean",
            "description": "The righteous and rigorous Dandelion Knight, and Acting Grand Master of the Knights of Favonius in Mondstadt.",
            "skills": [
                {
                    "key": "s1",
                    "title": "Favonius Bladework",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Performs up to 5 consecutive strikes.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Consumes a certain amount of Stamina to launch an enemy using the power of wind. Launched enemies will slowly fall to the ground.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": "Plunges from mid-air to strike the ground below, damaging enemies along the path and dealing AoE DMG upon impact.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Gale Blade",
                    "description": "Focusing the might of the formless wind around her blade, Jean releases a miniature storm, launching enemies in the direction she aims at, dealing massive Anemo DMG.",
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "At the cost of continued Stamina consumption, Jean can command the whirlwind to pull surrounding enemies towards her front. Direction can be adjusted. Character is immobile during skill duration.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s3",
                    "title": "Dandelion Breeze",
                    "description": "Calling upon the wind’s protection, Jean creates a swirling Dandelion Field, launching surrounding enemies and causing Anemo DMG. At the same time, she instantly regenerates a large amount of HP for nearby allied units and all party members. HP restored scale off Jean’s ATK.",
                    "abilities": [
                        {
                            "name": "Dandelion Field",
                            "description": null,
                            "descriptions": [
                                "Continuously regenerates HP of characters within the AoE and continuously imbues them with Anemo.",
                                "Deals Anemo DMG to enemies entering or exiting the field."
                            ]
                        }
                    ]
                }
            ],
            "passives": [
                {
                    "key": "p1",
                    "title": "Guiding Breeze",
                    "description": "When a Perfect Cooking is achieved on a dish with restorative effects, there is a 12% chance to obtain double the product.",
                    "descriptions": []
                },
                {
                    "key": "p2",
                    "title": "Wind Companion",
                    "description": "Hits by Normal Attacks have a 50% chance to regenerate HP equal to 15% of Jean’s ATK for all party members.",
                    "descriptions": []
                },
                {
                    "key": "p3",
                    "title": "Let the Wind Lead",
                    "description": "Using Dandelion Breeze will regenerate 20% of its Energy.",
                    "descriptions": []
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "Spiraling Tempest",
                    "description": "Increases the pulling speed of Gale Blade after holding for more than 1s, and increases the DMG dealt by 40%.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c2",
                    "title": "People’s Aegis",
                    "description": "When Jean picks up an Elemental Orb/Particle, all party members have their Movement SPD and ATK SPD increased by 15% for 15s.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c3",
                    "title": "When the West Wind Arises",
                    "description": "Increases the Level of Dandelion Breeze by 3. Maximum upgrade level is 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "Lands of Dandelion",
                    "description": "Within the Field created by Dandelion Breeze, all enemies have their Anemo RES decreased by 40%.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "Outbursting Gust",
                    "description": "Increase the Level of Gale Blade by 3. Maximum upgrade level is 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "Lion’s Fang, Fair Protector of Mondstadt",
                    "description": "Incoming DMG is decreased by 35% within the Field created by Dandelion Breeze. Upon leaving the Dandelion Field, this effect lasts for 3 attacks or 10s.",
                    "secondDescription": null,
                    "descriptions": []
                }
            ]
        },
        {
            "key": "Kaeya",
            "name": "Kaeya",
            "description": "A thinker in the Knights of Favonius with a somewhat exotic appearance.",
            "skills": [
                {
                    "key": "s1",
                    "title": "Ceremonial Bladework",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Performs up to 5 consecutive strikes.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Consumes a certain amount of Stamina to unleash 2 rapid sword strikes.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": "Plunges from mid-air to strike the ground below, damaging enemeies along the path and dealing AoE DMG upon impact.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Frostgnaw",
                    "description": "Unleashes a frigit blast, dealing Cryo DMG to enemies in front of Kaeya.",
                    "abilities": []
                },
                {
                    "key": "s3",
                    "title": "Glacial Waltz",
                    "description": "Coalescing the frost in the air, Kaeya summons 3 icicles that revolve around him. These icicles will follow the character around and deal Cryo DMG to enemies in their path for so long as they persist.",
                    "abilities": []
                }
            ],
            "passives": [
                {
                    "key": "p1",
                    "title": "Hidden Strength",
                    "description": "Decreases all party member’s sprinting Stamina consumption by 20%.",
                    "descriptions": []
                },
                {
                    "key": "p2",
                    "title": "Cold-Blooded Strike",
                    "description": "Every hit with Frostgnaw regenerates HP for Kaeya equal to 15% of ATK.",
                    "descriptions": []
                },
                {
                    "key": "p3",
                    "title": "Heart of the Abyss",
                    "description": "Enemies Frozen by Frostgnaw will drop additional Elemental Particles. Frostgnaw may only produce a maximum of 2 additional Elemental Particles per use.",
                    "descriptions": []
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "Excellent Blood",
                    "description": "The CRIT Rate of Normal Attack and Charged Attack DMG against enemies affected by the Cold or Frozen status effects is increased by 15%.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c2",
                    "title": "Never-Ending Performance",
                    "description": "Every time Glacial Waltz defeats an enemy, its duration is increased by 2.5s, up to a maximum of 15s.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c3",
                    "title": "Dance of Frost",
                    "description": "Increases the Level of Frostgnaw by 3. Maximum upgrade level is 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "Frozen Kiss",
                    "description": "Triggers automatically when Kaeya’s HP falls below 20%:",
                    "secondDescription": null,
                    "descriptions": [
                        "Creates a shield that absorbs damage equal to 30% of Kaeya’s Max HP. Lasts for 20s.",
                        "This shield absorbs Cryo DMG with 250% efficiency. Can only occur once every 60s."
                    ]
                },
                {
                    "key": "c5",
                    "title": "Frostbiting Embrace",
                    "description": "Increase the Level of Glacial Waltz by 3. Maximum upgrade level is 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "Glacial Whirlwind",
                    "description": "Glacial Waltz will generate 1 additional icicle, and will regenerate 15 Energy when cast.",
                    "secondDescription": null,
                    "descriptions": []
                }
            ]
        },
        {
            "key": "Keqing",
            "name": "Keqing",
            "description": "The Yuheng of the Liyue Qixing. Has much to say about Rex Lapis’ unilateral approach to policymaking in Liyue - but in truth, gods admire skeptics such as her quite a lot.",
            "skills": [
                {
                    "key": "s1",
                    "title": "Yunlai Swordsmanship",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Performs up to 5 rapid strikes.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Consumes a certain amount of Stamina to unleash 2 rapid sword strikes.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": "Plunges from mid-air to strike the ground below, damaging enemeies along the path and dealing AoE DMG upon impact.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Stellar Restoration",
                    "description": "Hurls a Lightning Stiletto that annihilates her enemies like the swift thunder. When the Stiletto hits its target, it deals Electro DMG to enemies in a small AoE, and places a Stiletto Mark on the spot hit.",
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Hold to adjust the direction in which the Stiletto shall be thrown. Stilettos thrown by the Hold attack mode can be suspended in mid-air, allowing Keqing to jump to them when using Stellar Restoration a second time.",
                            "descriptions": []
                        },
                        {
                            "name": "Lightning Stiletto",
                            "description": "If Keqing uses Stellar Restoration again or uses a Charged Attack while its duration lasts, it will clear the Stiletto Mark and produce different effects:",
                            "descriptions": [
                                "If she uses Stellar Restoration again, she will blink to the location of the Mark and unleashed one slashing attack that deals AoE Electro DMG. When blinking to a Stiletto that was thrown from a Holding attack, Keqing can leap across obstructing terrain.",
                                "If Keqing uses a Charged Attack, she will ignite a series of thundering cuts at the Mark’s location, dealing AoE Electro DMG."
                            ]
                        }
                    ]
                },
                {
                    "key": "s3",
                    "title": "Starward Sword",
                    "description": "Keqing unleashes the power of lightning, dealing Electro DMG in an AoE. She then blends into the shadow of her blade, striking a series of thunderclap-blows to nearby enemies simultaneous that deal multiple instance of Electro DMG. The final attack deals massive AoE Electro DMG.",
                    "abilities": []
                }
            ],
            "passives": [
                {
                    "key": "p1",
                    "title": "Land’s Overseer",
                    "description": "When dispatched on an expedition in Liyue, time consumed is reduced by 25%.",
                    "descriptions": []
                },
                {
                    "key": "p2",
                    "title": "Thundering Penance",
                    "description": "Within 5s of recasting Stellar Restoration while a Lightning Stiletto is present, Keqing’s Normal and Charged Attacks are converted to Electro DMG.",
                    "descriptions": []
                },
                {
                    "key": "p3",
                    "title": "Aristocratic Dignity",
                    "description": "When casting Starward Sword, Keqing’s CRIT Rate is increased by 15%, and her Energy Recharge is increased by 15%. This effect lasts for 8s.",
                    "descriptions": []
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "Thundering Might",
                    "description": "Recasting Stellar Restoration while a Lightning Stiletto is present causes Keqing to deal 50% of her ATK as AoE Electro DMG at the start point and terminus of her Blink.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c2",
                    "title": "Keen Extraction",
                    "description": "When Keqing’s Normal and Charged Attack’s hit enemies affected by Electro, they have a 50% chance of producing an Elemental Particle. This effect can only occur once every 5s.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c3",
                    "title": "Forseen Reformation",
                    "description": "Increases the Level of Starward Sword by 3. Maximum upgrade level is 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "Attunement",
                    "description": "For 10s after Keqing triggers an Electro-related Elemental Reaction, her ATK is increased by 25%.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "Beckoning Stars",
                    "description": "Increase the Level of Stellar Restoration by 3. Maximum upgrade level is 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "Tenacious Star",
                    "description": "When initiating a Normal Attack, Charged Attack, Elemental Skill or Elemental Burst, Keqing gains a 6% Electro DMG Bonus for 8s. Effects triggered by Normal Attacks, Charged Attacks, Elemental Skills and Elemental Bursts are considered independent entities.",
                    "secondDescription": null,
                    "descriptions": []
                }
            ]
        },
        {
            "key": "Klee",
            "name": "Klee",
            "description": "An explosives expert and a regular at the Knights of Favonius’ confinement room. Also known as Fleeing Sunlight.",
            "skills": [
                {
                    "key": "s1",
                    "title": "Kaboom!",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Throws things that go boom when they hit things! Perform up to 3 explosive attacks, dealing AoE Pyro DMG.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Consumes a certain amount of Stamina and deals Pyro DMG to enemies after a short casting time.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": "Gathering the power of Pyro, Klee plunges towards the ground from mid-air, damaging all enemies in her path. Deals AoE Pyro DMG upon impact with the ground.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Jumpy Dumpty",
                    "description": "Jumpy Dumpty is tons of boom-bang-fun! When thrown, Jumpy Dumpty bounces thrice, igniting and dealing AoE Pyro DMG with every bounce. On the third bounce, the bomb splits into many mines. The mines will explode upon contact with enemies, or after a short period of time, dealing AoE Pyro DMG. Starts with 2 charges.",
                    "abilities": []
                },
                {
                    "key": "s3",
                    "title": "Sparks ’n’ Splash",
                    "description": "Klee’s Blazing Delight! For the duration of this ability, continuously summons Sparks ’n’ Splash to attack nearby enemies, dealing AoE Pyro DMG.",
                    "abilities": []
                }
            ],
            "passives": [
                {
                    "key": "p1",
                    "title": "All Of My Treasures!",
                    "description": "Displays the location of nearby resources unique to Mondstadt on the mini-map.",
                    "descriptions": []
                },
                {
                    "key": "p2",
                    "title": "Pounding Surprise",
                    "description": "When Jumpy Dumpty and Normal Attacks deal DMG, Klee has a 50% chance to obtain an Explosive Spark. This Explosive Spark is consumed by the next Charged Attack, which costs no Stamina and deals 50% increased DMG.",
                    "descriptions": []
                },
                {
                    "key": "p3",
                    "title": "Sparkling Burst",
                    "description": "When a Charged Attack results in a CRIT, all party members gain 2 Elemental Energy.",
                    "descriptions": []
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "Chained Reaction",
                    "description": "Attacks and Skills have a certain chance to summon a spark that bombards enemies, dealing DMG equal to 120% of Sparks ’n’ Splash’s DMG.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c2",
                    "title": "Explosive Frags",
                    "description": "Being hit by Jumpy Dumpty’s mines decreases enemy DEF by 23% for 10s.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c3",
                    "title": "Exquisite Compound",
                    "description": "Increases the Level of Jumpy Dumpty by 3. Maximum upgrade level is 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "Sparkly Explosion",
                    "description": "If Klee leaves the field during the duration of Sparks ’n’ Splash, her departure triggers an explosion that deals 555% of her ATK as AoE Pyro DMG.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "Nova Burst",
                    "description": "Increase the Level of Sparks ’n’ Splash by 3. Maximum upgrade level is 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "Blazing Delight",
                    "description": "While under the effects of Sparks ’n’ Splash, other members of the party will continuously regenerate Energy. When Sparks ’n’ Splash is used, all party members will gain 10% Pyro DMG Bonus for 25s.",
                    "secondDescription": null,
                    "descriptions": []
                }
            ]
        },
        {
            "key": "Lisa",
            "name": "Lisa",
            "description": "The languid but knowledgeable Librarian of the Knights of Favonius who was deemed by Sumeru Academia to be their most distinguised graduate in the past two centuries.",
            "skills": [
                {
                    "key": "s1",
                    "title": "Lightning Touch",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Perform up to 4 lightning attacks that deal Electro DMG.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Consumes a certain amount of Stamina to deal AoE Electro DMG after a short casting time.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": "Gathering the might of Electro, Lisa plunges towards the ground from mid-air, damaging all enemies in her path. Deals AoE Electro DMG upon impact with the ground.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Violet Arc",
                    "description": "Channels the power of lightning to sweep bothersome matters away.",
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Releases a homing Lightning Orb. On hit, it deals Electro DMG, and applies a stack of Conductive status (Max 3 stacks) to enemies in a small AoE.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "After an extended casting time, calls down lightning from the heavens, dealing massive Electro DMG to all nearby enemies. Deals great amounts of extra damage to enemies based on the number of Conductive stacks applied to them, and clears their Conductive status.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s3",
                    "title": "Lightning Rose",
                    "description": "Summons a Lightning Rose that unleashes powerful lightning bolts, launching surrounding enemies and dealing Electro DMG. The Lightning Rose will continuously emit lightning to knock back enemies and deal Electro DMG for so long as it persists.",
                    "abilities": []
                }
            ],
            "passives": [
                {
                    "key": "p1",
                    "title": "General Pharmaceutics",
                    "description": "When Lisa crafts a potion, she has a 20% chance to refund a portion of the crafting materials used.",
                    "descriptions": []
                },
                {
                    "key": "p2",
                    "title": "Induced Aftershock",
                    "description": "Hits by charged Attacks apply Violet Arc’s Conductive status to enemies.",
                    "descriptions": []
                },
                {
                    "key": "p3",
                    "title": "Static Electricity Field",
                    "description": "Enemies hit by Lightning Rose have their DEF decreased by 15% for 10s.",
                    "descriptions": []
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "Infinite Circuit",
                    "description": "Lisa recovers 2 Energy for every opponent hit while holding Violet Arc. A maximum of 10 Energy can be regenerated in this manner at any one time.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c2",
                    "title": "Electromagnetic Field",
                    "description": "Holding Violet Arc has the following effects:",
                    "secondDescription": null,
                    "descriptions": [
                        "Increases DEF by 25%.",
                        "Increases Lisa’s resistance to interruption."
                    ]
                },
                {
                    "key": "c3",
                    "title": "Resonant Thunder",
                    "description": "Increases the Level of Lightning Rose by 3. Maximum upgrade level is 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "Plasma Eruption",
                    "description": "Increases the number of lightning bolts released by Lightning Rose by 1-3.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "Electrocute",
                    "description": "Increase the Level of Violet Arc by 3. Maximum upgrade level is 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "Pulsating Witch",
                    "description": "When Lisa takes the field, she applies 3 stacks of Violet Arc’s Conductive status onto nearby enemies. This effect can only occur once every 5s.",
                    "secondDescription": null,
                    "descriptions": []
                }
            ]
        },
        {
            "key": "Mona",
            "name": "Mona",
            "description": "A mysterious young astrologer who proclaims herself to be \"Astrologist Mona Megistus,\" and who possesses abilities to match the title.",
            "skills": [
                {
                    "key": "s1",
                    "title": "Ripple of Fate",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Performs up to 4 water splash attacks that deal Hydro DMG.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Consumes a certain amount of Stamina and deals AoE Hydro DMG after a short casting time.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": "Gathering the might of Hydro, Mona plunges towards the ground from mid-air, damaging all enemies in her path. Deals AoE Hydro DMG upon impact with the ground.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Mirror Reflection of Doom",
                    "description": "Creates an illusory Phantom of fate from coalesced waterspouts.",
                    "abilities": [
                        {
                            "name": "",
                            "description": "The Phantom has the following special properties:",
                            "descriptions": [
                                "Continuously taunts nearby enemies, attracting their fire.",
                                "Continuously deals Hydro DMG to nearby enemies.",
                                "When its duration expires, the Phantom explodes, dealing AoE Hydro DMG."
                            ]
                        },
                        {
                            "key": "a2",
                            "description": "Utilizes water currents to move backwards swiftly before conjuring a Phantom. Only one Phantom created by Mirror Reflection of Doom can exist at any time.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s3",
                    "title": "Stellaris Phantasm",
                    "description": "Mona summons the sparkling waves and creates a reflection of the starry sky, applying the Illusory Bubble status to opponents in a large AoE.",
                    "abilities": [
                        {
                            "name": "Illusory Bubble",
                            "description": "Traps opponents inside a pocket of destiny and also makes them Wet. Renders weaker opponents immobile. When an opponent affected by Illusory Bubble sustains DMG, the following effects are produced:",
                            "descriptions": [
                                "Applies an Omen to the opponent, which gives a DMG Bonus, also increasing the DMG of the attack that causes it.",
                                "Removes the Illusory Bubble, dealing Hydro Elemental DMG in the process. The DMG Bonus does not apply to the Hydro Elemental DMG dealt in this instance."
                            ]
                        },
                        {
                            "name": "Omen",
                            "description": "During its duration, increases DMG taken by enemies.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s4",
                    "title": "Illusory Torrent",
                    "description": null,
                    "abilities": [
                        {
                            "name": "Alternate Spirit",
                            "description": "Mona cloaks herself within the water’s flow, consuming Stamina to move rapidly. When under the effect of Illusory Torrent, Mona can move at high speed on water. Applies the Wet status to nearby enemies when she reappears.",
                            "descriptions": []
                        }
                    ]
                }
            ],
            "passives": [
                {
                    "key": "p1",
                    "title": "Principium of Astrology",
                    "description": "When Mona crafts Weapon Ascension Materials, she has a 25% chance to refund a portion of the crafting materials used.",
                    "descriptions": []
                },
                {
                    "key": "p2",
                    "title": "Come ’n’ Get Me, Hag!",
                    "description": "After she has used Illusory Torrent for 2s, if there are any enemies nearby, Mona will automatically create a Phantom. A Phantom created in this manner lasts for 2s, and its explosion DMG is equal to 50% of Mirror Reflection of Doom.",
                    "descriptions": []
                },
                {
                    "key": "p3",
                    "title": "Waterborne Destiny",
                    "description": "Increases Mona’s Hydro DMG Bonus by a degree equivalent to 20% of her Energy Recharge rate.",
                    "descriptions": []
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "Prophecy of Submersion",
                    "description": "The effects of Hydro-related Elemental Reactions are enhanced for 8s after a character hits an enemy affected by an Omen:",
                    "secondDescription": null,
                    "descriptions": [
                        "Electro-Charged DMG is increased by 15%.",
                        "Vaporize DMG is increased by 15%.",
                        "Hydro Swirl DMG is increased by 15%.",
                        "The duration for which enemies are Frozen is increased by 15%."
                    ]
                },
                {
                    "key": "c2",
                    "title": "Lunar Chain",
                    "description": "When a Normal Attack hits, there is a 20% chance that it will be automatically followed by a Charged Attack. This effect can only occur once every 5s.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c3",
                    "title": "Restless Revolution",
                    "description": "Increases the Level of Stellaris Phantasm by 3. Maximum upgrade level is 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "Prophecy of Oblivion",
                    "description": "When a character attacks an enemy affected by the Omen status effect, their CRIT Rate is increased by 15%.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "Mockery of Fortuna",
                    "description": "Increase the Level of Mirror Reflection of Doom by 3. Maximum upgrade level is 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "Rhetorics of Calamitas",
                    "description": "Upon entering Illusory Torrent, Mona gain a 60% increase to the DMG her next Charged Attack per second of movement. A maximum DMG Bonus of 180% can be achieved in this manner. The effect lasts for no more than 8s.",
                    "secondDescription": null,
                    "descriptions": []
                }
            ]
        },
        {
            "key": "Ningguang",
            "name": "Ningguang",
            "description": "The Tianquan of Liyue Qixing. Her wealth is unsurpassed in all of Teyvat.",
            "skills": [
                {
                    "key": "s1",
                    "title": "Sparkling Scatter",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Shoots gems that deal Geo DMG. Upon hit, this grants Ningguang 1 Star Jade.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Consumes a certain amount of Stamina to fire off a giant gem that deals Geo DMG. If Ningguang has any Star Jades, unleashing a Charged Attack will cause the Star Jades to be fired at the enemy as well, dealing additional DMG.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": "Gathering the might of Geo, Ningguang plunges towards the ground from mid-air, damaging all enemies in her path. Deals AoE Geo DMG upon impact with the ground.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Jade Screen",
                    "description": "Ningguang creates a Jade Screen out of gold, obsidian and her great opulence, dealing AoE Geo DMG.",
                    "abilities": [
                        {
                            "name": "Jade Screen",
                            "description": "Jade Screen is considered a Geo Construct and can be used to block certain attacks, but cannot be climbed. Only one Jade Screen may exist at any one time.",
                            "descriptions": [
                                "Blocks enemy projectiles.",
                                "Endurance scales based on Ningguang’s Max HP."
                            ]
                        }
                    ]
                },
                {
                    "key": "s3",
                    "title": "Starshatter",
                    "description": "Gathering a great number of gems, Ningguang scatters them all at once, sending homing projectiles at her enemies that deal massive Geo DMG. If Starshatter is cast when a Jade Screen is nearby, the Jade Screen will fire additional gem projectiles at the same time.",
                    "abilities": []
                }
            ],
            "passives": [
                {
                    "key": "p1",
                    "title": "Trove of Marvelous Treasure",
                    "description": "Displays the location of nearby ore veins (Iron Ore, White Iron Ore, Crystal Ore, and Magical Crystal Ore) on the mini-map.",
                    "descriptions": []
                },
                {
                    "key": "p2",
                    "title": "Backup Plan",
                    "description": "When Ningguang is in possession of Star Jades, her Charged Attack does not consume Stamina.",
                    "descriptions": []
                },
                {
                    "key": "p3",
                    "title": "Strategic Reserve",
                    "description": "A character that passes through the Jade Screen will gain a 12% Geo DMG Bonus for 10s.",
                    "descriptions": []
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "Piercing Fragments",
                    "description": "When a Normal Attack hits, it deals AoE DMG.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c2",
                    "title": "Shock Effect",
                    "description": "When Jade Screen is shattered, its CD will reset. Can occur once every 6s.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c3",
                    "title": "Majesty be the Array of Stars",
                    "description": "Increases the Level of Starshatter by 3. Maximum upgrade level is 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "Exquisite be the Jade, Outshining All the Beneath",
                    "description": "Jade Screen increases nearby characters’ Elemental RES by 10%.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "Invincible be the Jade Screen",
                    "description": "Increase the Level of Jade Screen by 3. Maximum upgrade level is 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "Grandeur be the Seven Stars",
                    "description": "When Starshatter is used, Ningguang gains 7 Star Jades.",
                    "secondDescription": null,
                    "descriptions": []
                }
            ]
        },
        {
            "key": "Noelle",
            "name": "Noelle",
            "description": "A maid in the service of the Knights of Favonius that dreams of joining their ranks someday.",
            "skills": [
                {
                    "key": "s1",
                    "title": "Favonius Bladework - Maid",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Performs up to 4 consecutive strikes.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Drains Stamina over time to perform continuous swirling attacks against all nearby enemies. At end of the sequence, perform a more powerful slash.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": "Plunges from mid-air to strike the ground below, damaging enemies along the path and dealing AoE DMG upon impact.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Breastplate",
                    "description": "Summons a protective stone armor, dealing Geo DMG to surrounding enemies and creating a shield. The shield’s DMG Absorption scaled based on Noelle’s DEF.",
                    "abilities": [
                        {
                            "name": "",
                            "description": "The shield has the following properties:",
                            "descriptions": [
                                "When Noelle’s Normal and Charged Attacks hit a target, they have a certain chance to regenerate HP for all characters, both on and off the field. The amount of HP healed when regeneration is triggered scales based on Noelle’s DEF.",
                                "Applies the Geo element to the character.",
                                "Possesses 250% Absorption Efficiency against Geo DMG."
                            ]
                        }
                    ]
                },
                {
                    "key": "s3",
                    "title": "Sweeping Time",
                    "description": "Gathering the strength of stone around her weapon, Noelle strikes the enemies surrounding her within a large AoE, dealing Geo DMG.",
                    "abilities": [
                        {
                            "name": "",
                            "description": "Afterwards, Noelle gains the following effects:",
                            "descriptions": [
                                "Larger attack AoE.",
                                "Converts attack DMG to Geo DMG.",
                                "Increased ATK that scales based on her DEF."
                            ]
                        }
                    ]
                }
            ],
            "passives": [
                {
                    "key": "p1",
                    "title": "Maid’s Knighthood",
                    "description": "When a Perfect Cooking is achieved on a DEF-boosting dish, Noelle has a 12% chance to obtain double the product.",
                    "descriptions": []
                },
                {
                    "key": "p2",
                    "title": "Devotion",
                    "description": "When Noelle is in the party but not on the field, this ability triggers automatically when the active character’s HP falls below 30%: Creates a shield that lasts for 20s and absorbs DMG equal to 400% of Noelle’s DEF. This effect can only occur once every 60s.",
                    "descriptions": []
                },
                {
                    "key": "p3",
                    "title": "Nice and Clean",
                    "description": "Every 4 Normal or Charged Attack hits will decrease the CD of Breastplate by 1s. Hitting multiple enemies with a single attack is only counted as 1 hit.",
                    "descriptions": []
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "I Got Your Back",
                    "description": "While Sweeping Time and Breastplate are both in effect, the chance of Breastplate’s healing effects activating is increased to 100%.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c2",
                    "title": "Combat Maid",
                    "description": "Decreases the Stamina Consumption of Noelle’s Charged Attacks by 20% and increases her Charged Attack DMG by 15%.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c3",
                    "title": "Invulnerable Maid",
                    "description": "Increases the Level of Breastplate by 3. Maximum upgrade level is 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "To Be Cleaned",
                    "description": "When Breastplate’s duration expires or it is destroyed by DMG, it will deal 400% ATK of Geo DMG to surrounding enemies.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "Favonius Sweeper Master",
                    "description": "Increase the Level of Sweeping Time by 3. Maximum upgrade level is 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "Must Be Spotless",
                    "description": "Sweeping Time increases Noelle’s ATK by an additional 50% of her DEF. Additionally, every enemy defeated during the skill’s duration adds 1s to the duration, up to 10s.",
                    "secondDescription": null,
                    "descriptions": []
                }
            ]
        },
        {
            "key": "Qiqi",
            "name": "Qiqi",
            "description": "An apprentice and herb-picker Bubu Pharmacy. An undead with a bone-white complexion, she seldom has much in the way of words or emotion.",
            "skills": [
                {
                    "key": "s1",
                    "title": "Ancient Sword Art",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Performs up to 5 rapid strikes.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Consumes a certain amount of Stamina to unleash 2 rapid sword strikes.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": "Plunges from mid-air to strike the ground below, damaging enemies along the path and dealing AoE DMG upon impact.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Adeptus Art: Herald of Frost",
                    "description": "Using the Icevein Talisman, Qiqi brings forth the Herald of Frost, dealing Cryo DMG to nearby enemies.",
                    "abilities": [
                        {
                            "name": "Herald of Frost",
                            "description": "",
                            "descriptions": [
                                "When Qiqi hits a target with her Normal or Charged Attacks, she regenerates HP for all party members and all nearby allied characters. Healing scales based on Qiqi’s ATK.",
                                "Regenerates HP for current character at regular intervals.",
                                "Follows the character around, dealing Cryo DMG to enemies in its path."
                            ]
                        }
                    ]
                },
                {
                    "key": "s3",
                    "title": "Adeptus Art: Preserver of Fortune",
                    "description": "Qiqi releases the adeptus power sealed within her body, marking nearby enemies with a Fortune-Preserving Talisman that deals Cryo DMG.",
                    "abilities": [
                        {
                            "name": "Fortune-Preserving Talisman",
                            "description": "When enemies affected by this Talisman take DMG, the character that dealt this DMG regenerates HP.",
                            "descriptions": []
                        }
                    ]
                }
            ],
            "passives": [
                {
                    "key": "p1",
                    "title": "Former Life Memories",
                    "description": "Displays the location of nearby resources unique to Liyue on the mini-map.",
                    "descriptions": []
                },
                {
                    "key": "p2",
                    "title": "Life-Prolonging Methods",
                    "description": "When a character under the effects of Adeptus Art: Herald of Frost triggers an Elemental Reaction, their Incoming Healing Bonus is increased by 20% for 8s.",
                    "descriptions": []
                },
                {
                    "key": "p3",
                    "title": "A Glimpse into Arcanum",
                    "description": "When Qiqi hits enemies with her Normal and Charged Attacks, she has a 50% chance to apply a Fortune-Preserving Talisman to them for 6s. This effect can only occur once every 30s.",
                    "descriptions": []
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "Ascetics of Frost",
                    "description": "When the Herald of Frost hits an enemy marked by a Fortune-Preserving Talisman, Qiqi regenerates 2 Energy.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c2",
                    "title": "Frozen to the Bone",
                    "description": "Qiqi’s Normal and Charge Attack DMG against enemies affected by Cryo is increased by 15%.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c3",
                    "title": "Ascendant Praise",
                    "description": "Increases the Level of Adeptus Art: Preserver of Fortune by 3. Maximum upgrade level is 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "Divine Suppression",
                    "description": "Targets marked by the Fortune-Preserving Talisman have their ATK decreased by 20%.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "Crimson Lotus Bloom",
                    "description": "Increase the Level of Adeptus Art: Herald of Frost by 3. Maximum upgrade level is 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "Rite of Resurrection",
                    "description": "Using Adeptus Art: Preserve of Fortune revives all nearby fallen characters and regenerates 50% of their HP. This effect can only occur once every 15 mins.",
                    "secondDescription": null,
                    "descriptions": []
                }
            ]
        },
        {
            "key": "Razor",
            "name": "Razor",
            "description": "A boy who lives among the wolves in Wolvendom of Mondstadt, away from human civilization. As agile as lightning.",
            "skills": [
                {
                    "key": "s1",
                    "title": "Steel Fang",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Performs up to 4 consecutive strikes.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Drains Stamina over time to perform continuous swirling attacks against all nearby enemies. At end of the sequence, perform a more powerful slash.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": "Plunges from mid-air to strike the ground below, damaging enemies along the path and dealing AoE DMG upon impact.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Claw and Thunder",
                    "description": "Hunts his prey using the techniques taught to him by his master and his Lupical.",
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Swings the Thunder Wolf Claw, dealing Electro DMG to enemies in front of Razor. Upon striking an enemy, Razor will gain an Electro Sigil, which increases his Energy Recharge rate. Razor can have up to 3 Electro Sigils simultaneously, and gaining a new Electro Sigil refreshes their duration.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Gathers Electro energy to unleash a lightning storm over a small AoE, causing massive Electro DMG, and clears all of Razor’s Electro Sigils. Each Electro Sigil cleared in this manner will be converted into Energy for Razor.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s3",
                    "title": "Lightning Fang",
                    "description": "Summons the Wolf Within which deals Electro DMG to all nearby opponents. This clears all of Razor’s Electro Sigils, which will be converted into elemental energy for him. The Wolf Within will fight alongside Razor for the skill’s duration.",
                    "abilities": [
                        {
                            "name": "The Wolf Within",
                            "description": "These effects end when Razor leaves the battlefield. When Razor leaves the field, a maximum of 10 Energy will be returned to him based off the duration remaining on this skill.",
                            "descriptions": [
                                "Strikes alongside Razor’s normal attacks, dealing Electro DMG.",
                                "Raises Razor’s ATK SPD and Electro RES.",
                                "Causes Razor to be immune to DMG inflicted by the Electro-Charged status.",
                                "Disables Razor’s Charged Attacks.",
                                "Increases Razor's resistance to interruption."
                            ]
                        }
                    ]
                }
            ],
            "passives": [
                {
                    "key": "p1",
                    "title": "Wolvensprint",
                    "description": "Decreases all party member’s sprinting Stamina Consumption by 20%.",
                    "descriptions": []
                },
                {
                    "key": "p2",
                    "title": "Awakening",
                    "description": "Decreases Claw and Thunder’s CD by 18%. Using Lightning Fang resets the CD of Claw and Thunder.",
                    "descriptions": []
                },
                {
                    "key": "p3",
                    "title": "Hunger",
                    "description": "When Razor’s Energy is below 50%, increases Energy Recharge by 30%.",
                    "descriptions": []
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "Wolf’s Instinct",
                    "description": "Picking up an Elemental Orb or Particle increases Razor’s DMG by 10% for 8s.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c2",
                    "title": "Suppression",
                    "description": "Increases CRIT Rate against enemies with less than 30% HP by 10%.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c3",
                    "title": "Soul Companion",
                    "description": "Increases the Level of Lightning Fang by 3. Maximum upgrade level is 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "Bite",
                    "description": "When casting Claw and Thunder (Press), enemies hit will have their DEF decreased by 15% for 7s.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "Sharpened Claws",
                    "description": "Increase the Level of Claw and Thunder by 3. Maximum upgrade level is 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "Lupus Fulguris",
                    "description": "Every 10s, Razor’s sword charges up, causing the next Normal Attack to release lightning that deals 100% of Razor’s ATK as Electro DMG. When Razor is not using Lightning Fang, a lightning strike on an enemy will grant Razor an Electro Sigil for Claw and Thunder.",
                    "secondDescription": null,
                    "descriptions": []
                }
            ]
        },
        {
            "key": "Sucrose",
            "name": "Sucrose",
            "description": "An alchemist filled with curiosity about all things. She researches bio-alchemy.",
            "skills": [
                {
                    "key": "s1",
                    "title": "Wind Spirit Creation",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Performs up to 4 attacks using Wind Spirits, dealing Anemo DMG.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Consumes a certain amount of Stamina and deals AoE Anemo DMG after a short casting time.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": "Calling upon the power of her Wind Spirits, Sucrose plunges towards the ground from mid-air, damaging all enemies in her path. Deals AoE Anemo DMG upon impact with the ground.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Astable Anemohypostasis Creation - 6308",
                    "description": "Creates a small Wind Spirit that deals Anemo DMG to enemies in an AoE, pulling them towards the location of the Wind Spirit before launching them.",
                    "abilities": []
                },
                {
                    "key": "s3",
                    "title": "Forbidden Creation - Isomer 75 / Type II",
                    "description": "Sucrose hurls an unstable concoction that creates a Large Wind Spirit. While it persists, the Large Wind Spirit will continuously pull and launch nearby enemies, dealing AoE Anemo DMG.",
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "If the Wind Spirit comes into contact with Hydro / Pyro / Cryo / Electro elements, it will deal additional DMG of that type. Elemental Absorption may only occur once per use.",
                            "descriptions": []
                        }
                    ]
                }
            ],
            "passives": [
                {
                    "key": "p1",
                    "title": "Astable Invention",
                    "description": "When Sucrose crafts Character and Weapon Enhancement Materials, she has a 10% to obtain double the product.",
                    "descriptions": []
                },
                {
                    "key": "p2",
                    "title": "Catalyst Conversion",
                    "description": "When Sucrose triggers a Swirl effect, characters in the party with the matching element have their Elemental Mastery increased by 50 for 8s.",
                    "descriptions": []
                },
                {
                    "key": "p3",
                    "title": "Mollis Favonius",
                    "description": "When Astable Anemohypostatis Creation - 6308 or Forbidden Creation - Isomer 75 / Type II hit an enemy, increases other party member’s Elemental Mastery based on 20% of Sucrose’s Elemental Mastery for 8s.",
                    "descriptions": []
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "Clustered Vacuum Field",
                    "description": "Astable Anemohypostasis Creation - 6308 gains 1 additional charge.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c2",
                    "title": "Beth - Unbound Form",
                    "description": "The duration of Forbidden Creation - Isomer 75 / Type II is increased by 2s.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c3",
                    "title": "Flawless Alchemistress",
                    "description": "Increases the Level of Astable Anemohypostasis Creation - 6308 by 3. Maximum upgrade level is 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "Alchemania",
                    "description": "Every 7 Normal and Charged Attacks, Sucrose will reduce the CD of Astable Anemohypostasis Creation - 6308 by 1-7s.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "Caution: Standard Flask",
                    "description": "Increase the Level of Forbidden Creation - Isomer 75 / Type II by 3. Maximum upgrade level is 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "Chaotic Entropy",
                    "description": "If Forbidden Creation - Isomer 75 / Type II triggers an Elemental Absorption, all party members gain a 20% Elemental DMG Bonus for the corresponding absorbed element during its duration.",
                    "secondDescription": null,
                    "descriptions": []
                }
            ]
        },
        {
            "key": "Tartaglia",
            "name": "Tartaglia",
            "description": "No. 11 of The Harbingers, also known as \"Childe\". His name is highly feared on the battlefield.",
            "skills": [
                {
                    "key": "s1",
                    "title": "Cutting Torrent",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Performs up to 6 consecutive shots with a bow.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Perform a more precise Aimed Shot with increased DMG. While aiming, the power of Hydro will accumulate on the arrowhead. An arrow fully charged with the torrent will deal Hydro DMG and apply Riptide status..",
                            "descriptions": []
                        },
                        {
                            "name": "Riptide",
                            "description": "Opponents affected by Riptide will suffer from AoE Hydro DMG effects when attacked by Tartaglia in various ways. DMG dealt in this way is considered Normal Attack DMG.",
                            "descriptions": [
                                "Riptide Flash: A fully-charged Aimed Shot that hits an opponent affected by Riptide deals consecutive bouts of AoE DMG. Can occur once every 0.7s.",
                                "Riptide Burst: Defeating an opponent affected by Riptide created a Hydro burst that inflicts the Riptide status on nearby opponents hit."
                            ]
                        },
                        {
                            "key": "a4",
                            "description": "Fires off a shower of arrows in mid-air before falling and striking the ground, dealing AoE DMG upon impact. When Tartaglia is in Foul Legacy: Raging Tide’s Melee Stance, he cannot perform a plunging attack.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Foul Legacy: Raging Tide",
                    "description": "Unleashes a set of weaponry made of pure water, dealing Hydro DMG to surrounding opponents and entering a Melee Stance. In this Stance, Tartaglia’s Normal and Charged Attacks change as follows:",
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Performs up to 6 consecutive Hydro strikes.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Consumes a certain amount of Stamina to unleash a cross slash, dealing Hydro DMG.",
                            "descriptions": []
                        },
                        {
                            "name": "Riptide Slash",
                            "description": "Hitting an opponent affected by Riptide with a melee attack unleashes a Riptide Slash that deals AoE Hydro DMG. DMG dealt in this way is considered Elemental Skill DMG, and can only occur once every 1.5s. After 30s, or when the ability is unleashed again, this skill will end. Tartaglia will return to his Ranged Stance and this ability will enter CD. The longer Tartaglia stays in his Melee Stance, the longer the CD. If the return to a ranged stance occurs automatically after 30s, the CD is even longer.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s3",
                    "title": "Havor: Obliteration",
                    "description": "Performs different attacks based on what stance Tartaglia is in when casting.",
                    "abilities": [
                        {
                            "name": "Ranged Stance: Flash of Havoc",
                            "description": "Swiftly fires a Hydro-imbued magic arrow, dealing AoE Hydro DMG and applying the Riptide status. Returns a portion of its Energy Cost after use.",
                            "descriptions": []
                        },
                        {
                            "name": "Melee Stance: Light Obliteration",
                            "description": "Performs a slash with a large AoE, dealing massive Hydro DMG to all surrounding opponents, which triggers Riptide Blast.",
                            "descriptions": []
                        },
                        {
                            "name": "Riptide Blast",
                            "description": "When the obliterating waters hit an opponent affected by Riptide, it clears their Riptide status and triggers a Hydro Explosion that deals AoE Hydro DMG. DMG dealt in this way is considered Elemental Burst DMG.",
                            "descriptions": []
                        }
                    ]
                }
            ],
            "passives": [
                {
                    "key": "p1",
                    "title": "Master of Weaponry",
                    "description": "Increases your own party member’s Normal Attack Level by 1.",
                    "descriptions": []
                },
                {
                    "key": "p2",
                    "title": "Never Ending",
                    "description": "Extends Riptide duration by 8s.",
                    "descriptions": []
                },
                {
                    "key": "p3",
                    "title": "Sword of Torrents",
                    "description": "When Tartaglia is in Foul Legacy: Raging Tide’s Melee Stance, or if his Normal and Charged Attacks do CRIT DMG, they will apply the Riptide status effect on the hit enemy.",
                    "descriptions": []
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "Foul Legacy: Tide Withholder",
                    "description": "Decreases the CD of Foul Legacy: Raging Tide by 20%.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c2",
                    "title": "Foul Legacy: Understream",
                    "description": "When opponents affected by Riptide are defeated, Tartaglia regenerates 4 Elemental Energy.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c3",
                    "title": "Abyssal Mayhem: Vortex of Turmoil",
                    "description": "Increases the Level of Foul Legacy: Raging Tide by 3. Maximum upgrade level is 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "Abyssal Mayhem: Hydrospout",
                    "description": "If Tartaglia is in Foul Legacy: Raging Tide’s Melee Stance, triggers Riptide Slash against opponents on the field affected by Riptide every 4s, otherwise, triggers Riptide Flash. Riptide Slashes and Riptide Flashes triggered by this Constellation effect are not subject to the time intervals that would typically apply to these two Riptide effects, nor do they have any effect on those time intervals.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "Havoc: Formless Blade",
                    "description": "Increase the Level of Havoc: Obliteration by 3. Maximum upgrade level is 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "Havoc: Annihilation",
                    "description": "When Havoc: Obliteration is cast in Melee Stance, the CD of Foul Legacy: Raging Tide is reset. This effect will only take place once Tartaglia returns to his Ranged Stance.",
                    "secondDescription": null,
                    "descriptions": []
                }
            ]
        },
        {
            "key": "Traveler (Anemo)",
            "name": "Traveler (Anemo)",
            "description": "A traveler from another world who had their only kin taken away, forcing them to embark on a journey to find The Seven.",
            "skills": [
                {
                    "key": "s1",
                    "title": "Foreign Ironwind",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Performs up to 5 consecutive strikes.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Consumes a certain amount of Stamina to unleash 2 rapid sword strikes.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": "Plunges from mid-air to strike the ground below, damaging enemies along the path and dealing AoE DMG upon impact.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Palm Vortex",
                    "description": "Grasping the wind’s might, you form a vortex of vacuum in your palm, causing continuous Anemo DMG to enemies in front of you. The vacuum vortex explodes when the skill duration ends, causing a greater amount of Anemo DMG over a larger area.",
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "DMG and AoE will gradually increase",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "If the vortex comes in contact with Hydro/Pyro/Cryo/Electro elements, it will deal additional elemental DMG of that type. Elemental Absorption may only occur once per use.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s3",
                    "title": "Gust Surge",
                    "description": "Guiding the path of the wind currents, you summon a forward-moving tornado that pulls objects and opponents towards itself, dealing continuous Anemo DMG.",
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "If the tornado comes in contact with Hydro/Pyro/Cryo/Electro elements, it will deal additional elemental DMG of that type. Elemental Absorption may only occur once per use.",
                            "descriptions": []
                        }
                    ]
                }
            ],
            "passives": [
                {
                    "key": "p2",
                    "title": "Slitting Wind",
                    "description": "The last hit of a Normal Attack combo unleashes a wind blade, dealing 60% of ATK as Anemo DMG to all opponents in its path.",
                    "descriptions": []
                },
                {
                    "key": "p3",
                    "title": "Second Wind",
                    "description": "Palm Vortex kills renegerate 2% HP for 5s. This effect can only occur once every 5s.",
                    "descriptions": []
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "Raging Vortex",
                    "description": "Palm Vortex pulls in enemies within a 5m radius.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c2",
                    "title": "Uprising Whirlwind",
                    "description": "Increases Energy Recharge by 16%.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c3",
                    "title": "Sweeping Gust",
                    "description": "Increases the Level of Gust Surge by 3. Maximum upgrade level is 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "Cherishing Breezes",
                    "description": "Reduces DMG taken while casting Palm Vortex by 10%.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "Vortex Stellaris",
                    "description": "Increase the Level of Palm Vortex by 3. Maximum upgrade level is 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "Intertwined Winds",
                    "description": "Targets who take DMG from Gust Surge have their Anemo RES decreased by 20%. If an Elemental Absorption occurred, then their RES towards the corresponding Element is also decreased by 20%.",
                    "secondDescription": null,
                    "descriptions": []
                }
            ]
        },
        {
            "key": "Traveler (Geo)",
            "name": "Traveler (Geo)",
            "description": "A traveler from another world who had their only kin taken away, forcing them to embark on a journey to find The Seven.",
            "skills": [
                {
                    "key": "s1",
                    "title": "Foreign Rockblade",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Performs up to 5 consecutive strikes.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Consumes a certain amount of Stamina to unleash 2 rapid sword strikes.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": "Plunges from mid-air to strike the ground below, damaging enemies along the path and dealing AoE DMG upon impact.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Starfell Sword",
                    "description": "You disgorge a meteorite from the depths of the earth, dealing AoE Geo DMG. The meteorite is considered a Geo Construct, and can be climbed or used to block attacks.",
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "The skill’s positioning may be adjusted.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s3",
                    "title": "Wake of Earth",
                    "description": "Energizing the Geo elements deep underground, you set off expanding shockwaves. Launches surrounding enemies back and deals AoE Geo DMG. A stone wall is erected at the edges of the shockwave. The stone wall is considered a Geo Construct, and may be used to block attacks.",
                    "abilities": []
                }
            ],
            "passives": [
                {
                    "key": "p2",
                    "title": "Shattered Darkrock",
                    "description": "Reduces Starfell Sword’s CD by 2s.",
                    "descriptions": []
                },
                {
                    "key": "p3",
                    "title": "Frenzied Rockslide",
                    "description": "The final hit of a Normal Attack combo triggers a collapse, dealing 60% of ATK as AoE Geo DMG.",
                    "descriptions": []
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "Invincible Stonewall",
                    "description": "Allies within the radius of Wake of Earth have their CRIT Rate increased by 10% and have increased resistance against interruption.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c2",
                    "title": "Rockcore Meltdown",
                    "description": "When the meteorite created by Starfell Sword is destroyed, it will also explode, dealing additional AoE Geo DMG equal to the amount of damage dealt by Starfell Sword.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c3",
                    "title": "Will of the Rock",
                    "description": "Increases the Level of Wake of Earth by 3. Maximum upgrade level is 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "Reaction Force",
                    "description": "The shockwave triggered by Wake of Earth regenerates 5 Energy for every enemy hit. A maximum of 25 Energy can be recovered in this manner at any one time.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "Meteorite Impact",
                    "description": "Increase the Level of Starfell Sword by 3. Maximum upgrade level is 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "Everlasting Boulder",
                    "description": "The barrier created by Wake of Earth lasts 5s longer. The meteorite created by Starfell Sword lasts 10s longer.",
                    "secondDescription": null,
                    "descriptions": []
                }
            ]
        },
        {
            "key": "Venti",
            "name": "Venti",
            "description": "One of the many bards of Mondstadt, who freely wanders the city’s streets and alleys.",
            "skills": [
                {
                    "key": "s1",
                    "title": "Divine Marksmanship",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Performs up to 6 consecutive shots with a bow.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Perform a more precise Aimed Shot with increased DMG. While aiming, favorable winds will accumulate on the arrowhead. A fully charged arrow will deal Anemo DMG.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": "Fires off a shower of arrows in mid-air before falling and striking the ground, dealing AoE DMG upon impact.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Skyward Sonnet",
                    "description": "O wind upon which all hymns and songs fly, bear these earth-walkers up into the sky!",
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Summons a Wind Domain at the enemy’s location, dealing AoE Anemo DMG and launching enemies into the air.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Summons an even larger Wind Domain with Venti as the epicenter, dealing AoE Anemo DMG and launching affected enemies into the air. After unleashing the Hold version of this ability, Venti rides the wind into the air. Enemies hit by Skyward Sonnet will fall to the ground slowly.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s3",
                    "title": "Wind’s Grand Ode",
                    "description": "Fires off an arrow made of countless coalesced winds, creating a huge Stormeye that sucks in objects and enemies along its path, dealing continuous Anemo DMG.",
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "If the Stormeye comes into contact with Hydro/Pyro/Cryo/Electro elements, it will deal additional elemental DMG of that type. Elemental Absorption may only occur once per use.",
                            "descriptions": []
                        }
                    ]
                }
            ],
            "passives": [
                {
                    "key": "p1",
                    "title": "Windrider",
                    "description": "Decreases all party member’s gliding Stamina Consumption by 20%.",
                    "descriptions": []
                },
                {
                    "key": "p2",
                    "title": "Embrace of Winds",
                    "description": "Holding Skyward Sonnet creates an upcurrent that lasts for 20s.",
                    "descriptions": []
                },
                {
                    "key": "p3",
                    "title": "Stormeye",
                    "description": "Regenerates 15 Energy for Venti after the effects of Wind’s Grand Ode end. If an Elemental Absorption occurred, this also restores 15 Energy to all characters of that corresponding element.",
                    "descriptions": []
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "Splitting Gale",
                    "description": "Fires 2 additional arrows per Aimed Shot, each dealing 33% of the original arrow’s DMG.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c2",
                    "title": "Breeze of Reminiscence",
                    "description": "Skyward Sonnet decreases enemy Anemo RES by 12% for 10s. Enemies launched by Skyward Sonnet suffer an additional 12% Anemo RES and Physical RES decrease while airborne.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c3",
                    "title": "Ode to Thousand Winds",
                    "description": "Increases the Level of Wind’s Grand Ode by 3. Maximum upgrade level is 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "Hurricane of Freedom",
                    "description": "When Venti picks up an Elemental Orb or Particle, he receives a 25% Anemo DMG Bonus for 10s.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "Concierto dal Cielo",
                    "description": "Increase the Level of Skyward Sonnet by 3. Maximum upgrade level is 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "Storm of Defiance",
                    "description": "Targets who take DMG from Wind’s Grand Ode have their Anemo RES decreased by 20%. If an Elemental Absorption occurred, then their RES towards the corresponding Element is also decreased by 20%.",
                    "secondDescription": null,
                    "descriptions": []
                }
            ]
        },
        {
            "key": "Xiangling",
            "name": "Xiangling",
            "description": "A renowned chef from Liyue. She’s extremely passionate about cooking and excels at making her signature hot and spicy dishes.",
            "skills": [
                {
                    "key": "s1",
                    "title": "Dough-Fu",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Performs up to 5 consecutive spear strikes.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Consumes a certain amount of Stamina to lunge forward, dealing damage to enemies along the way.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": "Plunges from mid-air to strike the ground below, damaging enemies along the path and dealing AoE DMG upon impact.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Guoba Attack",
                    "description": "Summons Guoba the Panda. Guoba continuously breathes fire, dealing AoE Pyro DMG.",
                    "abilities": []
                },
                {
                    "key": "s3",
                    "title": "Pyronado",
                    "description": "Displaying her mastery over both fire and polearms, Xiangling sends a Pyronado whirling around her. The Pyronado will move with your character for so long as the ability persists, dealing Pyro DMG to all enemies in its path.",
                    "abilities": []
                }
            ],
            "passives": [
                {
                    "key": "p1",
                    "title": "Chef de Cuisine",
                    "description": "When Xiangling cooks an ATK-boosting dish perfectly, she has a 12% chance to receive double the product.",
                    "descriptions": []
                },
                {
                    "key": "p2",
                    "title": "Crossfire",
                    "description": "Increases the flame range of Guoba by 20%.",
                    "descriptions": []
                },
                {
                    "key": "p3",
                    "title": "Beware, It’s Super Hot!",
                    "description": "When Guoba Attack’s effect ends, Guoba leaves a chili pepper on the spot where it disappeared. Picking up a chili pepper increases ATK by 10% for 10s.",
                    "descriptions": []
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "Crispy Outside, Tender Inside",
                    "description": "Enemies hit by Guoba’s attacks have their Pyro RES reduced by 15% for 6s.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c2",
                    "title": "Oil Meets Fire",
                    "description": "The last attack in a Normal Attack sequence applies the Implode status onto the enemy for 2s. An explosion will occur once this duration ends, dealing 75% of Xiangling’s ATK as AoE Pyro DMG.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c3",
                    "title": "Deepfry",
                    "description": "Increases the Level of Pyronado by 3. Maximum upgrade level is 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "Slowbake",
                    "description": "Pyronado’s duration is increased by 40%.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "Guoba Mad",
                    "description": "Increase the Level of Guoba Attack by 3. Maximum upgrade level is 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "Condensed Pyronado",
                    "description": "For the duration of Pyronado, all party members receive a 15% Pyro DMG Bonus.",
                    "secondDescription": null,
                    "descriptions": []
                }
            ]
        },
        {
            "key": "Xiao",
            "name": "Xiao",
            "description": "A yaksha adeptus that defends Liyue. Also heralded as the \"Conqueror of Demons\" or \"Vigilant Yaksha.\"",
            "skills": [
                {
                    "key": "s1",
                    "title": "Whirlwind Thrust",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Perform up to 6 rapid strikes.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Consumes a certain amount of Stamina to perform an upward thrust.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": " Plunges from mid-air to strike the ground below, damaging enemies along the path and dealing AoE DMG upon impact.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Lemniscatic Wind Cycling",
                    "description": "He lunges forward, dealing Anemo DMG to enemies along the path. Can be used in mid-air. Has 2 charges to begin with.",
                    "abilities": []
                },
                {
                    "key": "s3",
                    "title": "Bane of All Evil",
                    "description": "Takes on the form of the yaksha that terrified both demons and archons alike millennia ago. For its duration, increases Xiao’s attack range and DMG, while converting damage type to Anemo and enhancing Xiao’s jumping ability. Maintaining this form continuously drains Xiao’s HP.",
                    "abilities": []
                }
            ],
            "passives": [
                {
                    "key": "p1",
                    "title": "Transcension - Gravity Defier",
                    "description": "Decreases all party member’s falling DMG by 30%. The greatest effect out of all Talents of the same type prevails.",
                    "descriptions": []
                },
                {
                    "key": "p2",
                    "title": "Evil Conqueror - Tamer of Demons",
                    "description": "Starting Bane of All Evil increases Xiao’s DMG by 5%. After this, Xiao’s DMG continues to increase by 5% every 3s until the skill ends. Max 25% increase.",
                    "descriptions": []
                },
                {
                    "key": "p3",
                    "title": "Dissolution Eon - Heaven Fall",
                    "description": "When Lemniscatic Wind Cycling is used, increases all subsequent Lemniscatic Wind Cycling’s DMG by 10% for 6s. Max 3 stacks. Duration refreshes with new stacks.",
                    "descriptions": []
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "Dissolution Eon - Destroyer of Worlds",
                    "description": "Increases Lemniscatic Wind Cycling’s charges by 1.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c2",
                    "title": "Annihilation Eon - Blossom of Kaleidos",
                    "description": "When in party but not the currently active character, Xiao’s Energy Recharge is increased by 25%.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c3",
                    "title": "Evil Conqueror - Wrath Deity",
                    "description": "Increases the Level of Lemniscatic Wind Cycling by 3. Maximum upgrade level is 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "Transcension - Extinction of Suffering",
                    "description": "When Xiao’s HP falls below 50%, gains a 100% DEF Bonus.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "Evolution Eon - Origin of Ignorance",
                    "description": "Increase the Level of Bane of All Evil by 3. Maximum upgrade level is 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "Evil Conqueror - Vigilant Yaksha",
                    "description": "During Bane of All Evil, hitting 2 or more enemies with a Charged Attack grants Lemniscatic Wind Cycling 1 additional charge and reduces Lemniscatic Wind Cycling’s CD by 1s.",
                    "secondDescription": null,
                    "descriptions": []
                }
            ]
        },
        {
            "key": "Xingqiu",
            "name": "Xingqiu",
            "description": "A young man carrying a longsword who is frequently seen at book booths. He has a chivalrous heart and yearns for justice and fairness for all.",
            "skills": [
                {
                    "key": "s1",
                    "title": "Guhua Style",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Performs up to 5 consecutive spear strikes.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Consumes a certain amount of Stamina to unleash 2 rapid sword strikes.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": "Plunges from mid-aur to strike the ground below, damaging enemies along the path and dealing AoE DMG upon impact.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Guhua Sword - Fatal Rainscreen",
                    "description": "Xingqiu performs twin strikes with his sword, dealing Hydro DMG. At the same time, this ability creates the maximum number of Rain Swords, which will orbit the character. 20% of Xingqiu’s Hydro DMG Bonus will be converted to additional DMG Reduction for the Rain Swords. The maximum amount of additional DMG Reduction that can be gained this way is 24%. The initial maximum number of Rain Swords is 3. Using this ability applies the Wet status onto the character.",
                    "abilities": [
                        {
                            "name": "",
                            "description": "The Rain Swords have the following properties:",
                            "descriptions": [
                                "When a character takes DMG, the Rain Sword will shatter, reducing the amount of DMG taken.",
                                "Increases the character’s resistance to interruption."
                            ]
                        }
                    ]
                },
                {
                    "key": "s3",
                    "title": "Guhua Sword - Raincutter",
                    "description": "Initiate Rainbow Bladework and fight using an illusory sword rain, while creating the maximum number of Rain Swords.",
                    "abilities": [
                        {
                            "name": "Rainbow Bladework",
                            "description": "These effects carry over to other characters.",
                            "descriptions": [
                                "Normal Attacks will trigger consecutive sword rain attacks, dealing Hydro DMG.",
                                "Rain Swords will remain at the maximum number throughout the ability’s duration."
                            ]
                        }
                    ]
                }
            ],
            "passives": [
                {
                    "key": "p1",
                    "title": "Flash of Genius",
                    "description": "When Xingqiu crafts Character Talent Materials, he has a 25% chance to refund a portion of the crafting materials used.",
                    "descriptions": []
                },
                {
                    "key": "p2",
                    "title": "Hydropathic",
                    "description": "When a Rain Sword is shattered or when its duration expires, it regenerates the current character’s HP based on 6% of Xingqiu’s Max HP.",
                    "descriptions": []
                },
                {
                    "key": "p3",
                    "title": "Blades Amidst Raindrops",
                    "description": "Xingqiu gains a 20% Hydro DMG Bonus.",
                    "descriptions": []
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "The Scent Remained",
                    "description": "Increases the maximum number of Rain Swords by 1.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c2",
                    "title": "Rainbow Upon the Azure Sky",
                    "description": "Extends the duration of Guhua Sword - Raincutter by 3s. Decreases the Hydro RES of enemies hit by sword rain attacks by 15% for 4s.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c3",
                    "title": "Weaver of Verses",
                    "description": "Increases the Level of Guhua Sword - Raincutter by 3. Maximum upgrade level is 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "Evilsoother",
                    "description": "Throughout the duration of Guhua Sword: Raincutter, the DMG dealt by Guhua Sword: Fatal Rainscreen is increased by 50%.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "Embrace of Rain",
                    "description": "Increase the Level of Guhua Sword - Fatal Rainscreen by 3. Maximum upgrade level is 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "Hence, Call Them My Own Verses",
                    "description": "Activating 2 of Guhua Sword - Raincutter’s sword rain attacks greatly increases the DMG of the third. Xingqiu regenerates 3 Energy when sword rain attacks hit enemies.",
                    "secondDescription": null,
                    "descriptions": []
                }
            ]
        },
        {
            "key": "Xinyan",
            "name": "Xinyan",
            "description": "Liyue’s sole rock ’n’ roll musician. She rebels against ossified prejudices using her music and passionate singing.",
            "skills": [
                {
                    "key": "s1",
                    "title": "Dance on Fire",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Performs up to 4 consecutive strikes.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Drains Stamina over time to perform continuous spinning attacks against all nearby enemies. At the end of the sequence, perform a more powerful slash.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": "Plunges from mid-air to strike the ground, damaging enemies along the path and dealing AoE DMG upon impact.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Sweeping Fervor",
                    "description": "Xinyan brandishes her instrument, dealing Pyro DMG on nearby enemies, forming a shield made out of her audience’s passion.",
                    "abilities": [
                        {
                            "name": "",
                            "description": "The shield’s DMG Absorption scales based on Xinyan’s DEF and on the number of enemies hit:",
                            "descriptions": [
                                "Hitting 0-1 enemies grants Shield Level 1: Ad Lib.",
                                "Hitting 2 enemies grants Shield Level 2: Lead-In.",
                                "Hitting 3 or more enemies grants Shield Level 3: Rave, which will also deal intermittent Pyro DMG to nearby enemies."
                            ]
                        },
                        {
                            "name": "",
                            "description": "The shield has the following special properties:",
                            "descriptions": [
                                "When unleashed, it infuses Xinyan with Pyro.",
                                "It has 250% DMG Absorption effectiveness against Pyro DMG."
                            ]
                        }
                    ]
                },
                {
                    "key": "s3",
                    "title": "Riff Revolution",
                    "description": "Strumming rapidly, Xinyan launches nearby enemies and deals Physical DMG to them, hyping up the crowd. The sheer intensity of the atmosphere will cause explosions that deal Pyro DMG to nearby enemies.",
                    "abilities": []
                }
            ],
            "passives": [
                {
                    "key": "p1",
                    "title": "A Rad Recipe",
                    "description": "When a Perfect Cooking is achieved on an DEF-boosting dish, Xinyan has a 12% chance to obtain double the product.",
                    "descriptions": []
                },
                {
                    "key": "p2",
                    "title": "\"The Show Goes On, Even Without an Audience...\"",
                    "description": "Decreases the number of enemies Sweeping Fervor must hit to trigger each level of shielding.",
                    "descriptions": [
                        "Shield Level 2: Lead-In requirement reduced to 1 enemy hit.",
                        "Shield Level 3: Rave requirement reduced to 2 enemies hit or more."
                    ]
                },
                {
                    "key": "p3",
                    "title": "\"...Now That’s Rock ’N’ Roll!\"",
                    "description": "Characters shielded by Sweeping Fervor deal 15% increased Physical DMG.",
                    "descriptions": []
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "Fatal Acceleration",
                    "description": "Upon scoring a CRIT hit, increases ATK SPD of Xinyan’s Normal and Charged Attacks by 12% for 5s. Can only occur once every 5s.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c2",
                    "title": "Impromptu Opening",
                    "description": "Riff Revolution Physical DMG has its Crit rate increased by 100%, and will form a shield at Shield Level 3: Rave when cast.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c3",
                    "title": "Double Stop",
                    "description": "Increases the Level of Sweeping Fervor by 3. Maximum upgrade level is 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "Wildfire Rhythm",
                    "description": "Sweeping Fervor’s swing DMG decrease opponents Physical RES by 15% for 12s.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "Screamin’ for an Encore",
                    "description": "Increases the Level of Riff Revolution by 3. Maximum upgrade level is 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "Rockin’ in a Flaming World",
                    "description": "Decrease the stamina consumption of Xinyan Charged Attacks by 30%. Additionally, Xinyan Charged Attack gain an ATK bonus equal to 50% of her DEF.",
                    "secondDescription": null,
                    "descriptions": []
                }
            ]
        },
        {
            "key": "Zhongli",
            "name": "Zhongli",
            "description": "A mysterious guest invited by the Wangsheng Funeral Parlor. Extremely knowledgeable in all things.",
            "skills": [
                {
                    "key": "s1",
                    "title": "Rain of Stone",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Performs up to 6 consecutive spear strikes.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Consumes a certain amount of Stamina to lunge forward, causing stone spears to fall along his path.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": "Plunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Dominus Lapidis",
                    "description": "Every mountain, rock and inch of land is filled with the power of Geo, but those who can wield such powers freely are few and far between.",
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Commands the omnipresent power of earth to solidify into a Stone Stele, dealing AoE Geo DMG. Additionally, the Stone Stele will resonate with other Geo Constructs in the vicinity, dealing Geo DMG to surrounding enemies. The Stone Stele is considered a Geo Construct, and can both be climbed and used to block attacks. Only one may exist at any one time.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Causes nearby Geo energy to explode, causing the following effects:",
                            "descriptions": [
                                "Creates a shield of jade. The shield’s DMG Absorption scales based on Zhongli’s Max HP, and absorbs Geo DMG 250% more effectively.",
                                "Causes AoE Geo DMG.",
                                "If there are nearby targets with the Geo element, it will drain a large amount of Geo element from a maximum of 2 such targets. This effect does not cause DMG."
                            ]
                        }
                    ]
                },
                {
                    "key": "s3",
                    "title": "Planet Befall",
                    "description": "Brings a falling meteor down to earth, dealing massive Geo DMG to opponents caught in its AoE and applying the Petrification status to them.",
                    "abilities": [
                        {
                            "name": "Petrification",
                            "description": "Opponents affected by the Petrification status cannot move.",
                            "descriptions": []
                        }
                    ]
                }
            ],
            "passives": [
                {
                    "key": "p1",
                    "title": "Arcanum of Crystal",
                    "description": "Refunds 15% of the ores used when crafting Polearm-type weapons.",
                    "descriptions": []
                },
                {
                    "key": "p2",
                    "title": "Resonant Waves",
                    "description": "When the Jade Shield takes DMG, it will Fortify:",
                    "descriptions": [
                        "Fortified characters have 5% increased Shield Strength.",
                        "Can stack up to 5 times, and lasts until the Jade Shield dissapears."
                    ]
                },
                {
                    "key": "p3",
                    "title": "Dominance of Earth",
                    "description": "Planet Befall deals additional DMG equal to 33% of Zhongli’s Max HP.",
                    "descriptions": []
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "Rock, the Backbone of Earth",
                    "description": "Increases the maximum number of Stone Steles created by Dominus Lapidis that may exist simultaneously by 2.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c2",
                    "title": "Stone, the Cradle of Jade",
                    "description": "Planet Befall grants nearby characters on the field a Jade Shield when it descends.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c3",
                    "title": "Jade, Shimmering through Darkness",
                    "description": "Increases the Level of Dominus Lapidis by 3. Maximum upgrade level is 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "Topaz, Unbreakable and Fearless",
                    "description": "Increases Planet Befall’s AoE by 20% and increases the duration of Planet Befall’s Petrification effect by 2s.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "Lazuli, Herald of the Order",
                    "description": "Increase the Level of Planet Befall by 3. Maximum upgrade level is 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "Chrysos, Bounty of Dominator",
                    "description": "When the Jade Shield takes DMG, 40% of that incoming DMG is converted to HP for the current character. A single instance of regeneration cannot exceed 8% of that character’s Max HP.",
                    "secondDescription": null,
                    "descriptions": []
                }
            ]
        }
    ],
    "weapons": [
        {
            "key": "Hunter’s Bow",
            "name": "Hunter’s Bow",
            "description": "A hunter’s music consists of but two sounds: the twang of the bowstring and the whoosh of soaring arrows.",
            "refinement": null
        },
        {
            "key": "Seasoned Hunter’s Bow",
            "name": "Seasoned Hunter’s Bow",
            "description": "A bow that has been well-polished by time and meticulously cared for by its owner. It feels almost like an extension of the archer’s arm.",
            "refinement": null
        },
        {
            "key": "Ebony Bow",
            "name": "Ebony Bow",
            "description": "A longbow made of ebony wood with stiffer limbs than ordinary bows. It is also a far more powerful weapon.",
            "refinement": "Increases DMG against mechanoid Ruin enemies by {{0}}%"
        },
        {
            "key": "Messenger",
            "name": "Messenger",
            "description": "A basic wooden bow. It is said to have once been used as a tool for long-distance communication.",
            "refinement": "Charged Attack hits on weak points deal an additional {{0}}% ATK DMG as CRIT DMG. Can only occur once every 10s."
        },
        {
            "key": "Raven Bow",
            "name": "Raven Bow",
            "description": "Ravens are known to be the ferrymen of the dead. This bow’s limb is decorated with raven feathers, which forebode the imminent death of its target.",
            "refinement": "Increases DMG against enemies affected by Hydro or Pyro by {{0}}%"
        },
        {
            "key": "Recurve Bow",
            "name": "Recurve Bow",
            "description": "It is said that this bow can shoot down eagles in flight, but ultimately how true that is depends on the skill of the archer.",
            "refinement": "Defeating an opponent restores {{0}}% HP"
        },
        {
            "key": "Sharpshooter’s Oath",
            "name": "Sharpshooter’s Oath",
            "description": "This superior bow once belonged to a master archer. However, it gives off a strong scent, thus making it unsuitable for hunting.",
            "refinement": "Increases DMG against weak spots by {{0}}%"
        },
        {
            "key": "Slingshot",
            "name": "Slingshot",
            "description": "A bow, despite the name. After countless experiments and improvements to the design, the creator of the ultimate slingshot found himself to have made what was actually a bow.",
            "refinement": "If a Normal or Charged Attack hits a target within 0.3s of being fired, increases DMG by {{0}}%. Otherwise, decreases DMG by 10%."
        },
        {
            "key": "The Stringless",
            "name": "The Stringless",
            "description": "A bow that once served as an extraordinary instrument. It is no longer capable of getting people up and dancing.",
            "refinement": "Increases Elemental Skill and Elemental Burst DMG by {{0}}%."
        },
        {
            "key": "Alley Hunter",
            "name": "Alley Hunter",
            "description": "An intricate, opulent longbow. It once belonged to a gentleman thief who was never caught.",
            "refinement": "Every 4s a character is on the field, their ATK increases by {{0}}% and their CRIT DMG increases by {{1}}%. This effect has a maximum of 5 stacks and will not be reset if the character leaves the field, but will be cleared when the character takes DMG."
        },
        {
            "key": "Blackcliff Warbow",
            "name": "Blackcliff Warbow",
            "description": "A bow made of blackcliff that features extremely sturdy bow limbs. It requires an archer with a strong bow arm to use.",
            "refinement": "After defeating an enemy, ATK is increased by {{0}}% for 30s. This effect has a maximum of 3 stacks, and the duration of each stack is independent of the others."
        },
        {
            "key": "Compound Bow",
            "name": "Compound Bow",
            "description": "An exotic metallic bow from a distant land. Though extremely difficult to maintain, it is easy to nock and fires with tremendous force.",
            "refinement": "Normal Attack and Charged Attack hits increase ATK by {{0}}% and Normal ATK SPD by {{1}}% for 6s. Max 4 stacks. Can only occur once every 0.3s."
        },
        {
            "key": "Favonius Warbow",
            "name": "Favonius Warbow",
            "description": "A standard-issue recurve bow of the Knights of Favonius. Only the best archers can unleash its full potential.",
            "refinement": "CRIT Hits have a {{0}}% chance to generate a small amount of Elemental Particles, which will regenerate 6 Energy for the character. Can only occur once every {{1}}s."
        },
        {
            "key": "Prototype Crescent",
            "name": "Prototype Crescent",
            "description": "A prototype longbow discovered in the Blackcliff Forge. The arrow fired from this bow glimmers like a ray of moonlight.",
            "refinement": "Charged Attack hits on weak points increase Movement SPD by 10% and ATK by {{0}}% for 10s."
        },
        {
            "key": "Royal Bow",
            "name": "Royal Bow",
            "description": "An old royal longbow that belonged to the erstwhile rulers of Mondstadt. Countless generations later, the bowstring is still tight and can still fire arrows with great force.",
            "refinement": "Upon damaging an opponent, increases CRIT Rate by {{0}}%. Max 5 stacks. A CRIT hit removes all stacks."
        },
        {
            "key": "Rust",
            "name": "Rust",
            "description": "A completely rusted iron greatbow. The average person would lack the strength to even lift it, let alone fire it.",
            "refinement": "Increases Normal Attack DMG by {{0}}% but decreases Charged Attack DMG by 10%."
        },
        {
            "key": "Sacrificial Bow",
            "name": "Sacrificial Bow",
            "description": "A ceremonial hunting bow that has become petrified over time. The trinkets on it are still visible. It grants the wielder the power to withstand the winds of time.",
            "refinement": "After damaging an opponent with an Elemental Skill, the skill has a {{0}}% chance to end its own CD. Can only occur once every {{1}}s"
        },
        {
            "key": "The Viridescent Hunt",
            "name": "The Viridescent Hunt",
            "description": "A pure green hunting bow. This once belonged to a certain hunter whose home was the forest.",
            "refinement": "Upon hit, Normal and Aimed Shot Attacks have a 50% chance to generate a Cyclone, which will continuously attract surrounding enemies, dealing {{0}}% of ATK as DMG to these enemies every 0.5s for 4s. This effect can only occur once every {{1}}s"
        },
        {
            "key": "Skyward Harp",
            "name": "Skyward Harp",
            "description": "A greatbow that symbolizes Dvalin’s affiliation with the Anemo Archon. The sound of the bow firing is music to the Anemo Archon’s ears. It contains the power of the sky and wind within.",
            "refinement": "Increases CRIT DMG by {{0}}%. Hits have a {{1}}% chance to inflict a small AoE attack, dealing 125% Physical ATK DMG. Can only occur once every {{2}}s."
        },
        {
            "key": "Amos’ Bow",
            "name": "Amos’ Bow",
            "description": "An extremely ancient bow that has retained its power despite its original master being long gone. It draws power from everyone and everything in the world, and the further away you are from that which your heart desires, the more powerful it is.",
            "refinement": "Increases Normal and Charged Attack DMG by {{0}}%. Normal and Charged Attack DMG increases by {{1}}% every 0.1s for up to 5 times."
        },
        {
            "key": "Dreams of Dragonfell",
            "name": "Dreams of Dragonfell",
            "description": "A great bow that once shot clean through a giant dragon. Once released, the impetus of its bowstring resembles a peal of thunder.",
            "refinement": "Increases Shield Strength by {{0}}%. Scoring hits on opponents increases ATK by {{1}}% for 8s. Max 5 stacks. Can only occur once every 0.3s. While protected by a shield, this ATK increase effect is increased by 100%."
        },
        {
            "key": "Dull Blade",
            "name": "Dull Blade",
            "description": "Youthful dreams and the thrill of adventure. If this isn’t enough, then make it up with valiance.",
            "refinement": null
        },
        {
            "key": "Silver Sword",
            "name": "Silver Sword",
            "description": "A sword for exorcising demons. Everyone knows it’s made of a silver alloy, not pure silver.",
            "refinement": null
        },
        {
            "key": "Cool Steel",
            "name": "Cool Steel",
            "description": "A reliable steel-forged weapon that serves as a testament to the great adventures of its old master.",
            "refinement": "Increases DMG against enemies affected by Hydro or Cryo by {{0}}%"
        },
        {
            "key": "Dark Iron Sword",
            "name": "Dark Iron Sword",
            "description": "A perfectly ordinary iron sword, just slightly darker than most.",
            "refinement": "Upon causing an Overloaded, Superconduct, Electro-Charged, or an Electro-infused Swirl reaction, ATK is increased by {{0}}% for 12s."
        },
        {
            "key": "Fillet Blade",
            "name": "Fillet Blade",
            "description": "A sharp filleting knife. The blade is long, thin, and incredibly sharp.",
            "refinement": "On hit, has a 50% chance to deal {{0}}% ATK DMG to a single enemy. Can only occur once every {{1}}s."
        },
        {
            "key": "Harbinger of Dawn",
            "name": "Harbinger of Dawn",
            "description": "A sword that once shone like the sun. The wielder of this sword will be blessed with a \"feel-good\" buff. The reflective material on the blade has long worn off.",
            "refinement": "When HP is above 90%, increases CRIT Rate by {{0}}%."
        },
        {
            "key": "Skyrider Sword",
            "name": "Skyrider Sword",
            "description": "A reliable steel sword. The legendary Skyrider once tried to ride it as a flying sword...",
            "refinement": "Using an Elemental Burst grants a {{0}}% increase in ATK and Movement SPD for 15s."
        },
        {
            "key": "Traveler’s Handy Sword",
            "name": "Traveler’s Handy Sword",
            "description": "A handy steel sword which contains scissors, a magnifying glass, tinder, and other useful items in its sheath.",
            "refinement": "Each Elemental Orb or Particle collected restores {{0}}% HP."
        },
        {
            "key": "Blackcliff Longsword",
            "name": "Blackcliff Longsword",
            "description": "A sword made of a material known as \"blackcliff.\" It has a dark crimson glow on its black blade.",
            "refinement": "After defeating an enemy, ATK is increased by {{0}}% for 30s. This effect has a maximum of 3 stacks, and the duration of each stack is independent of the others."
        },
        {
            "key": "Favonius Sword",
            "name": "Favonius Sword",
            "description": "A standard-issue longsword of the Knights of Favonius. When you’re armed with this agile and sharp weapon, channeling the power of the elements has never been so easy!",
            "refinement": "CRIT Hits have a {{0}}% chance to generate a small amount of Elemental Particles, which will regenerate 6 Energy for the character. Can only occur once every {{1}}s."
        },
        {
            "key": "Iron Sting",
            "name": "Iron Sting",
            "description": "An exotic long-bladed rapier that somehow found its way into Liyue via foreign traders. It is light, agile, and sharp.",
            "refinement": "Dealing Elemental DMG increases all DMG by {{0}}% for 6s. Max 2 stacks. Can occur once every 1s."
        },
        {
            "key": "Lion’s Roar",
            "name": "Lion’s Roar",
            "description": "A sharp blade with extravagant carvings that somehow does not compromise on durability and sharpness. It roars like a lion as it cuts through the air.",
            "refinement": "Increases DMG against enemies affected by Pyro or Electro by {{0}}%"
        },
        {
            "key": "Prototype Rancour",
            "name": "Prototype Rancour",
            "description": "An ancient longsword discovered in the Blackcliff Forge that cuts through rocks like a hot knife through butter.",
            "refinement": "On hit, Normal or Charged Attacks increase ATK and DEF by {{0}}% for 6s. Max 4 stacks. This effect can only occur once every 0.3s."
        },
        {
            "key": "Royal Longsword",
            "name": "Royal Longsword",
            "description": "An old longsword that belonged to the erstwhile rulers of Mondstadt. Exquisitely crafted, the carvings and embellishments testify to the stature of its owner.",
            "refinement": "Upon damaging an opponent, increases CRIT Rate by {{0}}%. Max 5 stacks. A CRIT hit removes all stacks."
        },
        {
            "key": "Sacrificial Sword",
            "name": "Sacrificial Sword",
            "description": "A ceremonial sword that has become petrified over time. The trinkets on it are still visible. It grants the wielder the power to withstand the winds of time.",
            "refinement": "After damaging an opponent with an Elemental Skill, the skill has a {{0}}% chance to end its own CD. Can only occur once every {{1}}s"
        },
        {
            "key": "The Alley Flash",
            "name": "The Alley Flash",
            "description": "A straight sword as black as the night. It once belonged to a thief who roamed the benighted streets.",
            "refinement": "Continuosly sprinting for at least 1s increases ATK by {{0}}% for 6s. This effect cannot stack."
        },
        {
            "key": "The Black Sword",
            "name": "The Black Sword",
            "description": "A pitch-black longsword that thirsts for violence and conflict. It is said that this weapon can cause its user to become drunk on the red wine of slaughter.",
            "refinement": "Increases DMG dealt by Normal and Charged Attacks by {{0}}%. Additionally, regenerates {{1}}% of ATK as HP when Normal and Charged Attacks score a CRIT Hit. This effect can occur once every 5s."
        },
        {
            "key": "The Flute",
            "name": "The Flute",
            "description": "Beneath its rusty exterior is a lavishly decorated thin blade. It swings as swiftly as the wind.",
            "refinement": "Normal or Charged Attacks grant a Harmonic on hits. Gaining 5 Harmonics triggers the power of music and deals {{0}}% ATK DMG to surrounding enemies. Harmonics last up to 30s, and a maximum of 1 can be gained every 0.5s."
        },
        {
            "key": "Sword of Descension",
            "name": "Sword of Descension",
            "description": "A sword of unique craftsmanship. It does not appear to belong to this world.",
            "refinement": "Hitting opponents with Normal and Charged Attacks grants a {{0}}% chance to deal 200% ATK as DMG in a small AoE. This effect can only occur once every 10s. Additionally, if the Traveler equips the Sword of Descension, their ATK is increased by {{1}}."
        },
        {
            "key": "Festering Desire",
            "name": "Festering Desire",
            "description": "A creepy straight sword that almost seems to yearn for life. It drips with a shriveling venom that could even corrupt a mighty dragon.",
            "refinement": "Increases Elemental Skill DMG by {{0}}% and Elemental Skill CRIT Rate by {{1}}%."
        },
        {
            "key": "Aquila Favonia",
            "name": "Aquila Favonia",
            "description": "The soul of the Knights of Favonius. Millennia later, it still calls on the winds of swift justice to vanquish all evil  just like the last heroine who wielded it.",
            "refinement": "ATK is increased by {{0}}%. Triggers on taking DMG: the soul of the Falcon of the West awakens, holding the banner of resistance aloft, regenerating HP equal to {{1}}% of ATK and dealing {{2}}% of ATK as DMG to surrounding enemies. This effect can only occur once every 15s."
        },
        {
            "key": "Skyward Blade",
            "name": "Skyward Blade",
            "description": "The sword of a knight that symbolizes the restored honor of Dvalin. The blessings of the Anemo Archon rest on the fuller of the blade, imbuing the sword with the powers of the sky and the wind.",
            "refinement": "CRIT Rate increased by {{0}}%. Gains Skypiercing Might upon using an Elemental Burst: Increases Movement SPD by 10%, increases ATK SPD by 10%, and increases the DMG of Normal and Charged Attack hits by {{1}}% for 12s."
        },
        {
            "key": "Summit Shaper",
            "name": "Summit Shaper",
            "description": "A symbol of a legendary pact, this sharp blade once cut off the peak of a mountain.",
            "refinement": "Increases Shield Strength by {{0}}%. Scoring hits on opponents increases ATK by {{1}}% for 8s. Max 5 stacks. Can only occur once every 0.3s. While protected by a shield, this ATK increase effect is increased by 100%."
        },
        {
            "key": "Apprentice’s Notes",
            "name": "Apprentice’s Notes",
            "description": "Notes left behind by a top student. Many useful spells are listed, and the handwriting is beautiful.",
            "refinement": null
        },
        {
            "key": "Pocket Grimoire",
            "name": "Pocket Grimoire",
            "description": "A carefully compiled notebook featuring the essentials needed to pass a magic exam.",
            "refinement": null
        },
        {
            "key": "Amber Bead",
            "name": "Amber Bead",
            "description": "A catalyst carved out of amber that gains a warm halo under the sun.",
            "refinement": "Normal Attack hits increase all Elemental DMG by {{0}}% for 6s. Max 2 stacks."
        },
        {
            "key": "Emerald Orb",
            "name": "Emerald Orb",
            "description": "A catalyst carved out of the hard jade from Jueyun Karst north of Liyue. It is small, light, and durable.",
            "refinement": "Upon causing a Vaporize, Electro-Charged, Frozen, or a Hydro-infused Swirl reaction, increases ATK by {{0}}% for 12s."
        },
        {
            "key": "Magic Guide",
            "name": "Magic Guide",
            "description": "Version 12. A reprint featuring corrections to Version 11 and brand-new additions based on recent developments.",
            "refinement": "Increases DMG against enemies affected by Hydro or Electro by {{0}}%."
        },
        {
            "key": "Otherworldly Story",
            "name": "Otherworldly Story",
            "description": "A cheap fantasy novel with no value whatsoever. Any claim that it possesses the power of catalysis is also pure fantasy.",
            "refinement": "Picking up an Elemental Energy Orb/Particle recovers {{0}}% HP."
        },
        {
            "key": "Thrilling Tales of Dragon Slayers",
            "name": "Thrilling Tales of Dragon Slayers",
            "description": "A fictional story of a band of five heroes who go off on a dragon hunt. It is poorly written and structurally incoherent. Its value lies in the many lessons that can be learned from failure.",
            "refinement": "When switching characters, the new character taking the field has their ATK increased by {{0}}% for 10s. This effect can only occur once every 20s."
        },
        {
            "key": "Twin Nephrite",
            "name": "Twin Nephrite",
            "description": "A jade pendant formed by piecing together two jade stones.",
            "refinement": "Defeating an enemy increases Movement SPD and ATK by {{0}}% for 15s."
        },
        {
            "key": "Blackcliff Agate",
            "name": "Blackcliff Agate",
            "description": "A mysterious catalyst made of a material known as \"blackcliff.\" It has an ominous crimson glow that seems to pulse in synchronization with the tremors from deep within the earth.",
            "refinement": "After defeating an enemy, ATK is increased by {{0}}% for 30s. This effect has a maximum of 3 stacks, and the duration of each stack is independent of the others."
        },
        {
            "key": "Favonius Codex",
            "name": "Favonius Codex",
            "description": "A secret tome that belonged to the scholars of the Knights of Favonius. It describes the logic and power of elements and matter.",
            "refinement": "CRIT Hits have a {{0}}% chance to generate a small amount of Elemental Particles, which will regenerate 6 Energy for the character. Can only occur once every {{1}}s."
        },
        {
            "key": "Mappa Mare",
            "name": "Mappa Mare",
            "description": "A nautical chart featuring nearby currents and climates that somehow found its way into Liyue via foreign traders.",
            "refinement": "Triggering an Elemental reaction grants a {{0}}% Elemental DMG Bonus for 10s. Max 2 stacks."
        },
        {
            "key": "Prototype Amber",
            "name": "Prototype Amber",
            "description": "A dully gilded catalyst secretly guarded in the Blackcliff Forge. It seems to glow with the very light from the sky.",
            "refinement": "Using an Elemental Burst regenerates {{0}} Energy every 2s for 6s. All party members will regenerate {{1}}% HP every 2s for this duration."
        },
        {
            "key": "Royal Grimoire",
            "name": "Royal Grimoire",
            "description": "A book that once belonged to a royal mage of Mondstadt. It contains faithful and comprehensive historical accounts as well as magic spells.",
            "refinement": "Upon damaging an opponent, increases CRIT Rate by {{0}}%. Max 5 stacks. A CRIT hit removes all stacks."
        },
        {
            "key": "Sacrificial Fragments",
            "name": "Sacrificial Fragments",
            "description": "A weathered script, the text of which is no longer legible. A cursed item eroded by the winds of time.",
            "refinement": "After damaging an opponent with an Elemental Skill, the skill has a {{0}}% chance to end its own CD. Can only occur once every {{1}}s."
        },
        {
            "key": "Solar Pearl",
            "name": "Solar Pearl",
            "description": "A dull, golden pearl made of an unknown substance that harbors the light of the sun and the moon, and pulses with a warm strength.",
            "refinement": "Normal Attack hits increase Elemental Skill and Elemental Burst DMG by {{0}}% for 6s. Likewise, Elemental Skill or Elemental Burst hits increase Normal Attack DMG by {{1}}% for 6s."
        },
        {
            "key": "The Widsith",
            "name": "The Widsith",
            "description": "A heavy notebook filled with musical scores. Though suffering from moth damage and heavy wear-and-tear, there is still much power to be found among the hand-written words within.",
            "refinement": "When the character takes the field, they will gain a random theme song for 10s. This can only occur once every 30s. Recitative: ATK is increased by {{0}}%. Aria: Increases all Elemental DMG by {{1}}%. Interlude: Elemental Mastery is increased by {{2}}."
        },
        {
            "key": "Wine and Song",
            "name": "Wine and Song",
            "description": "A songbook from the bygone aristocratic era, whose composer has become forgotten. It chronicles the tale of a certain heroic outlaw.",
            "refinement": "For every character in the party who hails from Mondstadt, the character who equips this weapon gains {{0}}% ATK increase and {{1}}% Movement SPD increase."
        },
        {
            "key": "Eye of Perception",
            "name": "Eye of Perception",
            "description": "A dim black glaze pearl that is said to have the power to read the purity of one’s heart.",
            "refinement": "Normal and Charged Attacks have a 50% chance to fire a Bolt of Perception, dealing {{0}}% ATK as DMG. This bolt can bounce between enemies a maximum of 4 times. This effect can occur once every {{1}}s."
        },
        {
            "key": "Frostbearer",
            "name": "Frostbearer",
            "description": "A fruit that possesses a strange, frosty will. A faint sense of agony emanates from it.",
            "refinement": "Hitting an enemy with Normal and Charged Attacks has a {{0}}% chance of forming and dropping an Everfrost Icicle above them, dealing {{1}}% AoE ATK DMG. Can only occur once every 10s. Enemies affected by Cryo are dealt {{2}}% ATK DMG. Can only occur once every 10s."
        },
        {
            "key": "Lost Prayer to the Sacred Winds",
            "name": "Lost Prayer to the Sacred Winds",
            "description": "An educational tome written by anonymous early inhabitants who worshiped the wind. It has been blessed by the wind for its faithfulness and influence over the millennia.",
            "refinement": "Increases Movement SPD by 10%. When in battle, gain an {{0}}% Elemental DMG Bonus every 4s. Max 4 stacks. Lasts until the character falls or leaves combat."
        },
        {
            "key": "Skyward Atlas",
            "name": "Skyward Atlas",
            "description": "A cloud atlas symbolizing Dvalin and its former master, the Anemo Archon. It details the winds and clouds of the northern regions and contains the powers of the sky and wind.",
            "refinement": "Increases Elemental DMG Bonus by {{0}}%. Normal Attack hits have a 50% chance to earn the favor of the clouds, which actively seek out nearby enemies to attack for 15s, dealing {{1}}% ATK DMG. Can only occur once every 30s."
        },
        {
            "key": "Memory of Dust",
            "name": "Memory of Dust",
            "description": "A stone dumbbell containing distant memories. Its endless transformations reveal the power within.",
            "refinement": "Increases Shield Strength by {{0}}%. Scoring hits on opponents increases ATK by {{1}}% for 8s. Max 5 stacks. Can only occur once every 0.3s. While protected by a shield, this ATK increase effect is increased by 100%."
        },
        {
            "key": "Waster Greatsword",
            "name": "Waster Greatsword",
            "description": "A sturdy sheet of iron that may be powerful enough to break apart mountains if wielded with enough willpower.",
            "refinement": null
        },
        {
            "key": "Old Merc’s Pal",
            "name": "Old Merc’s Pal",
            "description": "A battle-tested greatsword that has seen better days and worse.",
            "refinement": null
        },
        {
            "key": "Bloodtainted Greatsword",
            "name": "Bloodtainted Greatsword",
            "description": "A steel sword that is said to have been coated with dragon blood, rendering it invulnerable to damage. This effect is not extended to its wielder, however.",
            "refinement": "Increases DMG dealt against enemies affected by Pyro or Electro by {{0}}%"
        },
        {
            "key": "Debate Club",
            "name": "Debate Club",
            "description": "A handy club made of fine steel. The most persuasive line of reasoning in any debater’s arsenal.",
            "refinement": "After using an Elemental Skill, Normal or Charged Attacks, on hit, deal an additional {{0}}% ATK DMG in a small area. Effect lasts 15s. DMG can only occur once every 3s."
        },
        {
            "key": "Ferrous Shadow",
            "name": "Ferrous Shadow",
            "description": "A replica of the famed sword of Arundolyn, the Lion of Light. Feel the power of a legendary hero as you hold this sword in your hand! Imagine yourself as the great warrior himself! Note: Daydreaming not recommended in live combat.",
            "refinement": "When HP falls below {{0}}%, increases Charged Attack DMG by {{1}}% and Charged Attacks become harder to interrupt."
        },
        {
            "key": "Quartz",
            "name": "Quartz",
            "description": "A simple but heavy greatsword made of polished black quartz with a golden gilt. It has an air of elegance and dignity about it.",
            "refinement": "Upon causing an Overloaded, Melt, Burning, Vaporize, or a Pyro-infused Swirl reaction, ATK is increased by {{0}}% for 12s."
        },
        {
            "key": "Skyrider Greatsword",
            "name": "Skyrider Greatsword",
            "description": "A reliable steel sword. The legendary Skyrider once tried to ride it as a flying sword... for the second time.",
            "refinement": "On hit, Normal or Charged Attacks increase ATK by {{0}}% for 6s. Max 4 stacks. Can occur once every 0.5s."
        },
        {
            "key": "White Iron Greatsword",
            "name": "White Iron Greatsword",
            "description": "A claymore made from white iron. Lightweight without compromising on power. Effective even when wielded by one of average strength, it is extremely deadly in the hands of a physically stronger wielder.",
            "refinement": "Defeating an opponent restores {{0}}% HP."
        },
        {
            "key": "Blackcliff Slasher",
            "name": "Blackcliff Slasher",
            "description": "An extremely sturdy greatsword from the Blackcliff Forge. It has a dark crimson color from the blade to pommel.",
            "refinement": "After defeating an enemy, ATK is increased by {{0}}% for 30s. This effect has a maximum of 3 stacks, and the duration of each stack is independent of the others."
        },
        {
            "key": "Favonius Greatsword",
            "name": "Favonius Greatsword",
            "description": "A heavy ceremonial sword of the Knights of Favonius. It channels elemental power easily and is highly destructive.",
            "refinement": "CRIT Hits have a {{0}}% chance to generate a small amount of Elemental Particles, which will regenerate 6 Energy for the character. Can only occur once every {{1}}s."
        },
        {
            "key": "Lithic Blade",
            "name": "Lithic Blade",
            "description": "A greatsword carved and chiseled from the very bedrock of Liyue.",
            "refinement": "For every character in the party who hails from Liyue, the character who equips this weapon gains {{0}}% ATK increase and {{1}}% CRIT Rate increase."
        },
        {
            "key": "Prototype Archaic",
            "name": "Prototype Archaic",
            "description": "An ancient greatsword discovered in the Blackcliff Forge. It swings with such an immense force that one feels it could cut straight through reality itself.",
            "refinement": "On hit, Normal or Charged Attacks have a 50% chance to deal an additional {{0}}% ATK DMG to enemies within a small AoE. Can only occur once every 15s."
        },
        {
            "key": "Rainslasher",
            "name": "Rainslasher",
            "description": "A fluorescent greatsword with no sharp edge that crushes enemies with brute force and raw power.",
            "refinement": "Increases DMG against enemies affected by Hydro or Electro by {{0}}%"
        },
        {
            "key": "Royal Greatsword",
            "name": "Royal Greatsword",
            "description": "An old greatsword that belonged to the erstwhile rulers of Mondstadt. It is made from the finest-quality materials and has stood the test of time. A weapon for use by royals only.",
            "refinement": "Upon damaging an opponent, increases CRIT Rate by {{0}}%. Max 5 stacks. A CRIT hit removes all stacks."
        },
        {
            "key": "Serpent Spine",
            "name": "Serpent Spine",
            "description": "A rare weapon whose origin is the ancient ocean. One can hear the sound of the ageless waves as one swings it.",
            "refinement": "Every 4s a character is on the field, they will deal {{0}}% more DMG and take {{1}}% more DMG. This effect has a maximum of 5 stacks and will not be reset if the character leaves the field, but will be reduced by 1 stack when the character takes DMG."
        },
        {
            "key": "The Bell",
            "name": "The Bell",
            "description": "A heavy greatsword. A clock is embedded within it, though its internal mechanisms have long been damaged.",
            "refinement": "Taking DMG generates a shield which absorbs DMG up to {{0}}% of Max HP. This shield lasts for 10s or until broken, and can only be triggered once every 45s. While protected by the shield, the character gains {{1}}% increased DMG."
        },
        {
            "key": "Whiteblind",
            "name": "Whiteblind",
            "description": "An exotic sword with one section of the blade left blunt. It made its way into Liyue via the hands of foreign traders. Incredibly powerful in the hands of someone who knows how to use it.",
            "refinement": "On hit, Normal or Charged Attacks increase ATK and DEF by {{0}}% for 6s. Max 4 stacks. This effect can only occur once every 0.5s."
        },
        {
            "key": "Sacrificial Greatsword",
            "name": "Sacrificial Greatsword",
            "description": "A ceremonial greatsword that has become petrified over time. The trinkets on it are still visible. It grants the wielder the power to withstand the winds of time.",
            "refinement": "After damaging an opponent with an Elemental Skill, the skill has a {{0}}% chance to end its own CD. Can only occur once every {{1}}s."
        },
        {
            "key": "Snow-Tombed Starsilver",
            "name": "Snow-Tombed Starsilver",
            "description": "An ancient greatsword that was stored between frescoes. Forged from Starsilver, it has the power to cleave through ice and snow.",
            "refinement": "Hitting an enemy with Normal and Charged Attacks has a {{0}}% chance of forming and dropping an Everfrost Icicle above them, dealing {{1}}% AoE ATK DMG. Can only occur once every 10s. Enemies affected by Cryo are dealt {{2}}% ATK DMG. Can only occur once every 10s."
        },
        {
            "key": "Skyward Pride",
            "name": "Skyward Pride",
            "description": "A claymore that symbolizes the pride of Dvalin soaring through the skies. When swung, it emits a deep hum as the full force of Dvalin’s command of the sky and the wind is unleashed.",
            "refinement": "Increases all DMG by {{0}}%. After using an Elemental Burst, Normal or Charged Attack, on hit, creates a vacuum blade that does {{1}}% of ATK as DMG to enemies along its path. Lasts for 20s or 8 vacuum blades."
        },
        {
            "key": "Wolf’s Gravestone",
            "name": "Wolf’s Gravestone",
            "description": "A longsword used by the Wolf Knight. Originally just a heavy sheet of iron given to the knight by a blacksmith from the city, it became endowed with legendary power owing to his friendship with the wolves.",
            "refinement": "Increases ATK by {{0}}%. On hit, attacks against enemies with less than 30% HP increase all party members’ ATK by {{1}}% for 12s. Can only occur once every 30s."
        },
        {
            "key": "The Unforged",
            "name": "The Unforged",
            "description": "Capable of driving away evil spirits and wicked people alike, this edgeless claymore seems to possess divine might.",
            "refinement": "Increases Shield Strength by {{0}}%. Scoring hits on opponents increases ATK by {{1}}% for 8s. Max 5 stacks. Can only occur once every 0.3s. While protected by a shield, this ATK increase effect is increased by 100%."
        },
        {
            "key": "Beginner’s Protector",
            "name": "Beginner’s Protector",
            "description": "A polearm as straight as a flag pole. Well suited to most combat situations, it has an imposing presence when swung.",
            "refinement": null
        },
        {
            "key": "Iron Point",
            "name": "Iron Point",
            "description": "Sharp and pointy at one end, it is a balanced weapon that is quite popular among travelers.",
            "refinement": null
        },
        {
            "key": "Black Tassel",
            "name": "Black Tassel",
            "description": "An exceptionally powerful polearm that also offers a simple but elegant solution to the issue of the easily stained white tassel.",
            "refinement": "Increases DMG against slimes by {{0}}%"
        },
        {
            "key": "Halberd",
            "name": "Halberd",
            "description": "A polearm with an axe blade mounted on top that can deal quite a lot of damage. It’s favored by the Millelith officers.",
            "refinement": "Normal Attacks deal an additional {{0}}% DMG. Can only occur once every 10s."
        },
        {
            "key": "White Tassel",
            "name": "White Tassel",
            "description": "A standard-issue weapon of the Millelith soldiers. It has a sturdy shaft and sharp spearhead. It’s a reliable weapon.",
            "refinement": "Increases Normal Attack DMG by {{0}}%."
        },
        {
            "key": "Blackcliff Pole",
            "name": "Blackcliff Pole",
            "description": "A weapon made of blackcliff and aerosiderite. There is a dark crimson glow on its cold black sheen.",
            "refinement": "After defeating an enemy, ATK is increased by {{0}}% for 30s. This effect has a maximum of 3 stacks, and the duration of each stack is independent of the others."
        },
        {
            "key": "Crescent Pike",
            "name": "Crescent Pike",
            "description": "An exotic weapon with an extremely long blade on the top and a crescent blade at the bottom. It found its way into Liyue through foreign traders. With practice, it can deal heavy damage.",
            "refinement": "After picking up an Elemental Orb/Particle, Normal and Charged Attacks deal an additional {{0}}% ATK DMG for 5s."
        },
        {
            "key": "Deathmatch",
            "name": "Deathmatch",
            "description": "A sharp crimson polearm that was once a gladiator’s priceless treasure. Its awl has been stained by the blood of countless beasts and men.",
            "refinement": "If are there at least 2 enemies nearby, ATK is increased by {{0}}% and DEF is increased by {{1}}%. If there are less than 2 enemies nearby, ATK is increased by {{2}}%"
        },
        {
            "key": "Dragon’s Bane",
            "name": "Dragon’s Bane",
            "description": "A polearm decorated with an entwining golden dragon. Light and sharp, this weapon may very well kill dragons with ease.",
            "refinement": "Increases DMG against enemies affected by Hydro or Pyro by {{0}}%"
        },
        {
            "key": "Lithic Spear",
            "name": "Lithic Spear",
            "description": "A spear forged from the rocks of the Guyun Stone Forest. Its hardness knows no equal.",
            "refinement": "Normal Attack hits have a {{0}}% chance of causing the next Charged Attack performed in the following 10s to deal {{1}}% increased DMG."
        },
        {
            "key": "Prototype Starglitter",
            "name": "Prototype Starglitter",
            "description": "A grudge discovered in the Blackcliff Forge. The glimmers along the sharp edge are like stars in the night.",
            "refinement": "After using an Elemental Skill, increases Normal and Charged Attack DMG by {{0}}% for 12s. Max 2 stacks."
        },
        {
            "key": "Favonius Lance",
            "name": "Favonius Lance",
            "description": "A polearm made in the style of the Knights of Favonius. Its shaft is straight, and its tip flows lightly like the wind.",
            "refinement": "CRIT Hits have a {{0}}% chance to generate a small amount of Elemental Particles, which will regenerate 6 Energy for the character. Can only occur once every {{1}}s."
        },
        {
            "key": "Royal Spear",
            "name": "Royal Spear",
            "description": "This polearm was once cherished by a member of the old nobility that governed Mondstadt long ago. Although it has never seen the light of day, it is still incomparably sharp.",
            "refinement": "Upon damaging an opponent, increases CRIT Rate by {{0}}%. Max 5 stacks. A CRIT hit removes all stacks."
        },
        {
            "key": "Dragonspine Spear",
            "name": "Dragonspine Spear",
            "description": "A spear created from the fang of a dragon. It is oddly warm to the touch.",
            "refinement": "Hitting an enemy with Normal and Charged Attacks has a {{0}}% chance of forming and dropping an Everfrost Icicle above them, dealing {{1}}% AoE ATK DMG. Can only occur once every 10s. Enemies affected by Cryo are dealt {{2}}% ATK DMG. Can only occur once every 10s."
        },
        {
            "key": "Vortex Vanquisher",
            "name": "Vortex Vanquisher",
            "description": "This sharp polearm can seemingly pierce through anything. When swung, one can almost see the rift it tears in the air.",
            "refinement": "Increases Shield Strength by {{0}}%. Scoring hits on opponents increases ATK by {{1}}% for 8s. Max 5 stacks. Can only occur once every 0.3s. While protected by a shield, this ATK increase effect is increased by 100%."
        },
        {
            "key": "Primordial Jade Winged-Spear",
            "name": "Primordial Jade Winged-Spear",
            "description": "A jade polearm made by the archons, capable of slaying ancient beasts.",
            "refinement": "On hit, increases ATK by {{0}}% for 6s. Max 7 stacks. This effect can only occur once every 0.3s. While in possession of the maximum possible stacks, DMG dealt is increased by {{1}}%."
        },
        {
            "key": "Skyward Spine",
            "name": "Skyward Spine",
            "description": "A polearm that symbolizes Dvalin’s firm resolve. The upright shaft of this weapon points towards the heavens, clad in the might of sky and wind.",
            "refinement": "Increases CRIT Rate by {{0}}% and increases Normal ATK SPD by 12%. Additionally, Normal and Charged Attacks hits on enemies have a 50% chance to trigger a vacuum blade that deals {{1}}% of ATK as DMG in a small AoE. This effect can occur no more than once every 2s."
        }
    ],
    "artifacts": [
        {
            "key": "Adventurer",
            "name": "Adventurer",
            "bonus": [
                {
                    "key": "b1",
                    "bonus": "Max HP increased by 1000."
                },
                {
                    "key": "b2",
                    "bonus": "Opening a chest regenerates 30% Max HP over 5s."
                }
            ]
        },
        {
            "key": "Traveling Doctor",
            "name": "Traveling Doctor",
            "bonus": [
                {
                    "key": "b1",
                    "bonus": "Increases incoming healing by 20%."
                },
                {
                    "key": "b2",
                    "bonus": "Using Elemental Burst restores 20% HP."
                }
            ]
        },
        {
            "key": "Lucky Dog",
            "name": "Lucky Dog",
            "bonus": [
                {
                    "key": "b1",
                    "bonus": "DEF increased by 100."
                },
                {
                    "key": "b2",
                    "bonus": "Picking up Mora restores 300 HP."
                }
            ]
        },
        {
            "key": "Resolution of Sojourner",
            "name": "Resolution of Sojourner",
            "bonus": [
                {
                    "key": "b1",
                    "bonus": "ATK +18%."
                },
                {
                    "key": "b2",
                    "bonus": "Increases Charged Attack CRIT Rate by 30%."
                }
            ]
        },
        {
            "key": "Tiny Miracle",
            "name": "Tiny Miracle",
            "bonus": [
                {
                    "key": "b1",
                    "bonus": "All Elemental RES increased by 20%."
                },
                {
                    "key": "b2",
                    "bonus": "Incoming elemental DMG increases corresponding Elemental RES by 30% for 10s. Can only occur once every 10s."
                }
            ]
        },
        {
            "key": "Brave Heart",
            "name": "Brave Heart",
            "bonus": [
                {
                    "key": "b1",
                    "bonus": "ATK +18%."
                },
                {
                    "key": "b2",
                    "bonus": "Increases DMG by 30% against enemies with more than 50% HP."
                }
            ]
        },
        {
            "key": "Defender’s Will",
            "name": "Defender’s Will",
            "bonus": [
                {
                    "key": "b1",
                    "bonus": "DEF +30%."
                },
                {
                    "key": "b2",
                    "bonus": "For each different element present in your own party, the wearer’s Elemental RES to that corresponding element is increased by 30%."
                }
            ]
        },
        {
            "key": "Martial Artist",
            "name": "Martial Artist",
            "bonus": [
                {
                    "key": "b1",
                    "bonus": "Increases Normal Attack and Charged Attack DMG by 15%."
                },
                {
                    "key": "b2",
                    "bonus": "After using Elemental Skill, increases Normal Attack and Charged Attack DMG by 25% for 8s."
                }
            ]
        },
        {
            "key": "Gambler",
            "name": "Gambler",
            "bonus": [
                {
                    "key": "b1",
                    "bonus": "Increases Elemental Skill DMG by 20%."
                },
                {
                    "key": "b2",
                    "bonus": "Defeating an enemy has a 100% chance to remove Elemental Skill CD. Can only occur once every 15s."
                }
            ]
        },
        {
            "key": "Scholar",
            "name": "Scholar",
            "bonus": [
                {
                    "key": "b1",
                    "bonus": "Energy Recharge +20%."
                },
                {
                    "key": "b2",
                    "bonus": "Gaining Elemental Particles or Orbs gives 3 Energy to all party members who have a bow or a catalyst equipped. Can only occur once every 3s."
                }
            ]
        },
        {
            "key": "Berserker",
            "name": "Berserker",
            "bonus": [
                {
                    "key": "b1",
                    "bonus": "CRIT Rate +12%."
                },
                {
                    "key": "b2",
                    "bonus": "When HP is below 70%, CRIT Rate increases by an additional 24%."
                }
            ]
        },
        {
            "key": "Instructor",
            "name": "Instructor",
            "bonus": [
                {
                    "key": "b1",
                    "bonus": "Increases Elemental Mastery by 80."
                },
                {
                    "key": "b2",
                    "bonus": "Upon triggering an Elemental Reaction, increases all party members’ Elemental Mastery by 120 for 8s."
                }
            ]
        },
        {
            "key": "The Exile",
            "name": "The Exile",
            "bonus": [
                {
                    "key": "b1",
                    "bonus": "Energy Recharge +20%."
                },
                {
                    "key": "b2",
                    "bonus": "Using an Elemental Burst regenerates 2 Energy for all party members (excluding the wearer) every 2s for 6s. This effect cannot stack."
                }
            ]
        },
        {
            "key": "Thundering Fury",
            "name": "Thundering Fury",
            "bonus": [
                {
                    "key": "b1",
                    "bonus": "Electro DMG Bonus +15%."
                },
                {
                    "key": "b2",
                    "bonus": "Increases damage caused by Overloaded, Electro-Charged and Superconduct by 40%. Triggering such effects decreases Elemental Skill CD by 1s. Can only occur once every 0.8s."
                }
            ]
        },
        {
            "key": "Thundersoother",
            "name": "Thundersoother",
            "bonus": [
                {
                    "key": "b1",
                    "bonus": "Electro RES increased by 40%."
                },
                {
                    "key": "b2",
                    "bonus": "Increases DMG against enemies affected by Electro by 35%."
                }
            ]
        },
        {
            "key": "Viridescent Venerer",
            "name": "Viridescent Venerer",
            "bonus": [
                {
                    "key": "b1",
                    "bonus": "Anemo DMG Bonus +15%."
                },
                {
                    "key": "b2",
                    "bonus": "Increases Swirl DMG by 60%. Decreases opponent’s Elemental RES to the element infused in the Swirl by 40% for 10s."
                }
            ]
        },
        {
            "key": "Maiden Beloved",
            "name": "Maiden Beloved",
            "bonus": [
                {
                    "key": "b1",
                    "bonus": "Character Healing Effectiveness +15%."
                },
                {
                    "key": "b2",
                    "bonus": "Using an Elemental Skill or Burst increases healing received by all party members by 20% for 10s."
                }
            ]
        },
        {
            "key": "Archaic Petra",
            "name": "Archaic Petra",
            "bonus": [
                {
                    "key": "b1",
                    "bonus": "Gain a 15% Geo DMG Bonus."
                },
                {
                    "key": "b2",
                    "bonus": "Upon obtaining an Elemental Shard created through a Crystallize Reaction, all party members gain a 35% DMG Bonus for that particular element for 10s. Only one form of Elemental DMG Bonus can be gained in this manner at any one time."
                }
            ]
        },
        {
            "key": "Retracing Bolide",
            "name": "Retracing Bolide",
            "bonus": [
                {
                    "key": "b1",
                    "bonus": "Increases Shield Strength by 35%."
                },
                {
                    "key": "b2",
                    "bonus": "While protected by a shield, gain an additional 40% Normal and Charged Attack DMG."
                }
            ]
        },
        {
            "key": "Crimson Witch of Flames",
            "name": "Crimson Witch of Flames",
            "bonus": [
                {
                    "key": "b1",
                    "bonus": "Pyro DMG Bonus +15%."
                },
                {
                    "key": "b2",
                    "bonus": "Increases Overloaded and Burning DMG by 40%. Increases Vaporize and Melt DMG by 15%. Using an Elemental Skill increases 2-Piece Set effects by 50% for 10s. Max 3 stacks."
                }
            ]
        },
        {
            "key": "Lavawalker",
            "name": "Lavawalker",
            "bonus": [
                {
                    "key": "b1",
                    "bonus": "Pyro RES increased by 40%."
                },
                {
                    "key": "b2",
                    "bonus": "Increases DMG against enemies affected by Pyro by 35%."
                }
            ]
        },
        {
            "key": "Bloodstained Chivalry",
            "name": "Bloodstained Chivalry",
            "bonus": [
                {
                    "key": "b1",
                    "bonus": "Physical DMG +25%."
                },
                {
                    "key": "b2",
                    "bonus": "After defeating an opponent, increases Charged Attack DMG by 50%, and reduces its Stamina cost to 0 for 10s."
                }
            ]
        },
        {
            "key": "Noblesse Oblige",
            "name": "Noblesse Oblige",
            "bonus": [
                {
                    "key": "b1",
                    "bonus": "Elemental Burst DMG +20%."
                },
                {
                    "key": "b2",
                    "bonus": "Using an Elemental Burst increases all party members’ ATK by 20% for 12s. This effect cannot stack."
                }
            ]
        },
        {
            "key": "Gladiator’s Finale",
            "name": "Gladiator’s Finale",
            "bonus": [
                {
                    "key": "b1",
                    "bonus": "ATK +18%."
                },
                {
                    "key": "b2",
                    "bonus": "If the wielder of this artifact set uses a Sword, Claymore or Polearm, increases their Normal Attack DMG by 35%."
                }
            ]
        },
        {
            "key": "Wanderer’s Troupe",
            "name": "Wanderer’s Troupe",
            "bonus": [
                {
                    "key": "b1",
                    "bonus": "Increases Elemental Mastery by 80."
                },
                {
                    "key": "b2",
                    "bonus": "Increases Charged Attack DMG by 35% if the character uses a Catalyst or a Bow."
                }
            ]
        },
        {
            "key": "Prayers for Illumination",
            "name": "Prayers for Illumination",
            "bonus": [
                {
                    "key": "b1",
                    "bonus": "Affected by Pyro for 40% less time."
                }
            ]
        },
        {
            "key": "Prayers for Destiny",
            "name": "Prayers for Destiny",
            "bonus": [
                {
                    "key": "b1",
                    "bonus": "Affected by Hydro for 40% less time."
                }
            ]
        },
        {
            "key": "Prayers for Wisdom",
            "name": "Prayers for Wisdom",
            "bonus": [
                {
                    "key": "b1",
                    "bonus": "Affected by Electro for 40% less time."
                }
            ]
        },
        {
            "key": "Prayers to Springtime",
            "name": "Prayers to Springtime",
            "bonus": [
                {
                    "key": "b1",
                    "bonus": "Affected by Cryo for 40% less time."
                }
            ]
        },
        {
            "key": "Blizzard Strayer",
            "name": "Blizzard Strayer",
            "bonus": [
                {
                    "key": "b1",
                    "bonus": "Cryo DMG Bonus +15%."
                },
                {
                    "key": "b2",
                    "bonus": "When a character attacks an enemy affected by Cryo, their CRIT Rate is increased by 20%. If the enemy is Frozen, CRIT Rate is increased by an additional 20%."
                }
            ]
        },
        {
            "key": "Heart of Depth",
            "name": "Heart of Depth",
            "bonus": [
                {
                    "key": "b1",
                    "bonus": "Hydro DMG Bonus +15%."
                },
                {
                    "key": "b2",
                    "bonus": "After using Elemental Skill, increases Normal Attack and Charged Attack DMG by 30% for 15s."
                }
            ]
        },
        {
            "key": "Glacier and Snowfield",
            "name": "Glacier and Snowfield",
            "bonus": [
                {
                    "key": "b1",
                    "bonus": "Cryo DMG Bonus +15%."
                },
                {
                    "key": "b2",
                    "bonus": "Increases Superconduct DMG by 100%. Increases Melt DMG by 15%. Using an Elemental Burst increases Cryo DMG Bonus by 30% for 10s."
                }
            ]
        },
        {
            "key": "Prayers to the Firmament",
            "name": "Prayers to the Firmament",
            "bonus": [
                {
                    "key": "b1",
                    "bonus": "Affected by Anemo for 40% less time."
                }
            ]
        }
    ],
    "materials": [
        {
            "key": "Freedom",
            "name": "Freedom"
        },
        {
            "key": "Prosperity",
            "name": "Prosperity"
        },
        {
            "key": "Dilligence",
            "name": "Dilligence"
        },
        {
            "key": "Resistance",
            "name": "Resistance"
        },
        {
            "key": "Ballad",
            "name": "Ballad"
        },
        {
            "key": "Gold",
            "name": "Gold"
        },
        {
            "key": "Tail of Boreas",
            "name": "Tail of Boreas",
            "bossName": "Andrius"
        },
        {
            "key": "Ring of Boreas",
            "name": "Ring of Boreas",
            "bossName": "Andrius"
        },
        {
            "key": "Spirit Locket of Boreas",
            "name": "Spirit Locket of Boreas",
            "bossName": "Andrius"
        },
        {
            "key": "Dvalin's Plume",
            "name": "Dvalin's Plume",
            "bossName": "Dvalin"
        },
        {
            "key": "Dvalin's Claw",
            "name": "Dvalin's Claw",
            "bossName": "Dvalin"
        },
        {
            "key": "Dvalin's Sigh",
            "name": "Dvalin's Sigh",
            "bossName": "Dvalin"
        },
        {
            "key": "Tusk of Monoceros Caeli",
            "name": "Tusk of Monoceros Caeli",
            "bossName": "Tartaglia"
        },
        {
            "key": "Shard of a Foul Legacy",
            "name": "Shard of a Foul Legacy",
            "bossName": "Tartaglia"
        },
        {
            "key": "Shadow of the Warrior",
            "name": "Shadow of the Warrior",
            "bossName": "Tartaglia"
        },
        {
            "key": "Decarabian",
            "name": "Decarabian"
        },
        {
            "key": "Guyun",
            "name": "Guyun"
        },
        {
            "key": "Mist Veiled Elixir",
            "name": "Mist Veiled Elixir"
        },
        {
            "key": "Boreal Wolf",
            "name": "Boreal Wolf"
        },
        {
            "key": "Aerosiderite",
            "name": "Aerosiderite"
        },
        {
            "key": "Dandelion Gladiator",
            "name": "Dandelion Gladiator"
        }
    ],
    "debuffs": [
        {
            "key": "Engulfing Storm",
            "name": "Engulfing Storm",
            "effect": "Continuously drains Energy Recharge."
        },
        {
            "key": "Slowing Water",
            "name": "Slowing Water",
            "effect": "Increases skill CD durations."
        },
        {
            "key": "Smoldering Flames",
            "name": "Smoldering Flames",
            "effect": "Continuously inflicts damage over time."
        },
        {
            "key": "Condensed Ice",
            "name": "Condensed Ice",
            "effect": "Increases stamina consumption."
        }
    ],
    "reactions": [
        {
            "key": "Burning",
            "name": "Burning",
            "effect": "Deals Pyro DMG over time."
        },
        {
            "key": "Crystalize",
            "name": "Crystalize",
            "effect": "Creates a crystal that will provide a shield when picked up."
        },
        {
            "key": "Electro-Charged",
            "name": "Electro-Charged",
            "effect": "Deals Electro DMG over time."
        },
        {
            "key": "Frozen",
            "name": "Frozen",
            "effect": "Freezes the target."
        },
        {
            "key": "Melt",
            "name": "Melt",
            "effect": "Deals extra damage."
        },
        {
            "key": "Overloaded",
            "name": "Overloaded",
            "effect": "Deals AoE Pyro DMG."
        },
        {
            "key": "Superconduct",
            "name": "Superconduct",
            "effect": "Deals AoE Cryo DMG and reduces the target's Physical RES by 50%."
        },
        {
            "key": "Swirl",
            "name": "Swirl",
            "effect": "Deals extra elemental damage and spreads the effect."
        },
        {
            "key": "Vaporize",
            "name": "Vaporize",
            "effect": "Deals extra damage."
        }
    ],
    "resonance": [
        {
            "key": "Enduring Rock",
            "name": "Enduring Rock",
            "effect": "Increases resistance to interruption. When protected by a shield, increases Attack DMG by 15%."
        },
        {
            "key": "Fervent Flames",
            "name": "Fervent Flames",
            "effect": "Affected by Cryo for 40% less time. Increases ATK by 25%."
        },
        {
            "key": "Soothing Waters",
            "name": "Soothing Waters",
            "effect": "Affected by Pyro for 40% less time. Increases incoming healing by 30%."
        },
        {
            "key": "Impetuous Winds",
            "name": "Impetuous Winds",
            "effect": "Decreases Stamina Consumption by 15%. Increases Movement SPD by 10%. Shortens Skill CD by 5%."
        },
        {
            "key": "High Voltage",
            "name": "High Voltage",
            "effect": "Affected by Hydro for 40% less time. Superconduct, Overloaded, and Electro-Charged have a 100% chance to generate an Electro Elemental Particle (CD: 5s)."
        },
        {
            "key": "Shattering Ice",
            "name": "Shattering Ice",
            "effect": "Affected by Electro for 40% less time. Increases CRIT Rate against enemies that are Frozen or affected by Cryo by 15%."
        },
        {
            "key": "Protective Canopy",
            "name": "Protective Canopy",
            "effect": "All Elemental RES by 15%. Physical RES + 15%",
            "description": "Any 4 Unique Elements"
        }
    ]
}