{
    "characters": [
        {
            "key": "Albedo",
            "name": "Albedo",
            "description": "Alquimista en Jefe de los Caballeros de Favonius y Capitán del equipo de investigación. Lo llaman el \"Principe de la Roca Caliza\"",
            "skills": [
                {
                    "key": "s1",
                    "title": "Técnica de espada Favonius - Albor",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Realiza hasta 5 ataques rápidos.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Consume una cierta cantidad de Aguante para lanzar un golpe de espada cruzado.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": "Se lanza desde el aire para golpear el suelo, dañando a los enemigos cercanos e infligiendo Daño en el AdE en el momento del impacto.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Abiogénesis: Isotoma Solar",
                    "description": null,
                    "abilities": [
                        {
                            "name": "Isotoma Solar",
                            "description": "Crea una isotoma solar que inflige Daño Geo en el AdE.",
                            "descriptions": [
                                "Cuando los enemigos situados en el centro del área de la isotoma solar reciben daño, esta se convertirá en una flor fugaz, abriéndose e infligiendo Daño Geo en el AdE proporcional a la DEF de Albedo.",
                                "Solo puede crearse una flor fugaz cada 2 s.",
                                "Cuando un personaje se sitúa sobre la isotoma solar, el poder de Geo se concentrará para formar una plataforma cristalizada de cierta altura sobre la que se podrán mantener los personajes.",
                                "Solo puede existir a la vez una isotoma creada por Albedo. La isotoma solar se considera una creación Geo."
                            ]
                        },
                        {
                            "key": "a2",
                            "description": "Controla la ubicación sobre la que tiene lugar la habilidad.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s3",
                    "title": "Creación: Marea tectónica",
                    "description": "Albedo ordena a sus cristales Geo que exploten, lanzándolos al frente e infligiendo Daño Geo en el AdE. Si en el campo de batalla ya hay una isotoma solar creada por Albedo. creará 7 flores de la muerte dentro del área de la isotoma, provocando una violenta explosión que inflige Daño Geo.",
                    "abilities": []
                }
            ],
            "passives": [
                {
                    "key": "p1",
                    "title": "Genio de la alquimia",
                    "description": "Al crear materiales de ascensión de arma, hay una probabilidad del 10% de recibir el doble.",
                    "descriptions": []
                },
                {
                    "key": "p2",
                    "title": "Fuerza caliza",
                    "description": "Creación: Marea tectónica aumenta en 125 pts. la Maestría Elemental de los personajes del equipo cercanos durante 10 s.",
                    "descriptions": []
                },
                {
                    "key": "p3",
                    "title": "Sabiduría del homúnculo",
                    "description": "Aumenta en un 25% el daño infligido por la flor fugaz de Abiogénesis: Isotoma solar contra los enemigos con menos del 50% de Vida.",
                    "descriptions": []
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "Flor del Edén",
                    "description": "Cuando explota una flor fugaz de Abiogénesis: Isotoma solar creada por Albedo, este recupera 1.2 pts. de Energía Elemental.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c2",
                    "title": "Eón Fanerozoico",
                    "description": "Al explotar, las flores fugaces de Abiogénesis: Isotoma solar otorgan a Albedo aritmética fatídica durante 30 s:",
                    "secondDescription": "Creación: Marea tectónica consume la aritmética fatídica, eliminando todas sus acumulaciones y aumentando el daño infligido por las explosiones de Creación: Marea tectónica y de las flores de la muerte.",
                    "descriptions": [
                        "Cada acumulación de aritmética fatídica aumenta el daño de Albedo en una cantidad igual al 30% de su DEF.",
                        "Puede acumularse un máximo de 4 veces."
                    ]
                },
                {
                    "key": "c3",
                    "title": "Gracia de Helios",
                    "description": "Aumenta el nivel de habilidad de Abiogénesis: Isotoma solar +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "Caída divina",
                    "description": "Si los personajes en uso están en el área de la isotoma solar, aumenta en un 30% el daño de sus Ataques Descendientes.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "Marea del Hádico",
                    "description": "Aumenta el nivel de habilidad de Creación: Marea tectónica +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "Tierra purificadora",
                    "description": "Aumenta en un 17% el daño de los personajes si estos están en el área de la isotoma solar y bajo la protección de un escudo creado mediante Cristalización.",
                    "secondDescription": null,
                    "descriptions": []
                }
            ]
        },
        {
            "key": "Amber",
            "name": "Amber",
            "description": "Siempre enérgica y llena de vida, Amber es la mejor exploradora de los Caballeros de Favonius, aunque también es la única...",
            "skills": [
                {
                    "key": "s1",
                    "title": "Arquero divino",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Realiza hasta 5 disparos consecutivos con arco.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": " Dispara un Tiro preciso que inflige mayor daño. Al apuntar, se acumularán llamas en la punta de flecha. Una flecha en llamas totalmente cargada infligirá Daño Pyro.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": "Dispara una lluvia de flechas desde el aire y desciende rápidamente, causando daño a distancia al impactar en el suelo.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Marioneta explosiva",
                    "description": null,
                    "abilities": [
                        {
                            "name": "Baron Bunny",
                            "description": null,
                            "descriptions": [
                                "Se burla de los enemigos cercanos para atraer su atención.",
                                "La Vida Máx. de Barón Bunny aumenta en proporción a la Vida de Amber.",
                                "Cuando es destruido o su temporizador llega a cero, Barón Bunny explota, infligiendo Daño Pyro de Área."
                            ]
                        },
                        {
                            "key": "a2",
                            "description": "Ajusta la dirección de lanzamiento de Barón Bunny. Cuanto más tiempo se mantenga apretado el botón, más lejos se lanzará.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s3",
                    "title": "Lluvia ardiente",
                    "description": "Dispara una lluvia de flechas, infligiendo Daño Pyro de Área continuo.",
                    "abilities": []
                }
            ],
            "passives": [
                {
                    "key": "p1",
                    "title": "Campeona de Vuelo",
                    "description": "Disminuye el consumo de Aguante al planear en un 20%.",
                    "descriptions": []
                },
                {
                    "key": "p2",
                    "title": "¡Puntería final!",
                    "description": "Lluvia ardiente aumenta un 10% de Prob. CRIT y el AdE se expande un 30%.",
                    "descriptions": []
                },
                {
                    "key": "p3",
                    "title": "Disparo preciso",
                    "description": "Al infligir daño en los puntos débiles del enemigo usando Tiro preciso, el ATQ Básico aumenta un 15% durante 10 s.",
                    "descriptions": []
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "¡Una Flecha para Gobernarlos a Todos!",
                    "description": "Lanza 2 flechas por cada Tiro preciso. La segunda flecha inflige 20% del daño de la primera flecha.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c2",
                    "title": "Lanzamiento de Barón Bunny",
                    "description": "¡Un nuevo y mejorado Barón Bunny! Golpear su pie con un Tiro preciso cargado detona inmediatamente a Barón Bunny. Explotarlo manualmente infligirá un 200% de Daño adicional.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c3",
                    "title": "¡Quémalo todo!",
                    "description": "Aumenta el nivel de habilidad de Lluvia ardiente +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "No es una muñeca cualquiera...",
                    "description": "Reduce el TdE de Marioneta explosiva en un 20%, y puede ser utilizada 1 vez más.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "¡Es Barón Bunny!",
                    "description": "Aumenta el nivel de habilidad de marioneta explosiva +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "Fuego Salvaje",
                    "description": "Lluvia ardiente aumenta la Vel. Movimiento y el ATQ Básico de todos los miembros del equipo en un 15% durante 10 s.",
                    "secondDescription": null,
                    "descriptions": []
                }
            ]
        },
        {
            "key": "Ayaka",
            "pending": true,
            "name": "Ayaka",
            "description": "The secretary at Yuehai Pavilion. The blood of the qilin, an illuminated beast, flows within her veins.",
            "skills": [],
            "passives": [],
            "constellations": []
        },
        {
            "key": "Barbara",
            "name": "Bárbara",
            "description": "Todos los habitantes de Mondstadt adoran a Bárbara. Ella vio por primera vez la palabra \"ídolo\" en una revista.",
            "skills": [
                {
                    "key": "s1",
                    "title": "Murmullo del agua",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Realiza hasta 4 ataques de salpicaduras de agua que infligen Daño Hydro.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Consume una cierta cantidad de Aguante para inflgir Daño Hydro de Área después de un corto lanzamiento.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": "El poder Hydro se concentra y desciende hacia el suelo, dañando a todos los enemigos en su camino. A su vez, inflige Daño de Área Hydro.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Que empiece el concierto ♪",
                    "description": "Invoca gotas de agua que se asemejan a notas musicales que forman círculos melódicos. Estas infligen Daño Hydro a los enemigos alrededor y los afecta con el estado Mojado.",
                    "abilities": [
                        {
                            "name": "Círculos melódicos",
                            "description": null,
                            "descriptions": [
                                "Los Ataques Normales de Bárbara curan a todos los miembros del grupo y a los personajes aliados cercanos una cierta cantidad de Vida, que aumenta con la Vida Máx. de Bárbara.",
                                "Su Ataque Cargado puede generar 4 veces la cantidad de curación.",
                                "Regenera una cierta cantidad de Vida del personaje actual a intervalos regulares.",
                                "Aplica el estado Mojado al personaje y a los enemigos que entren en contacto con él."
                            ]
                        }
                    ]
                },
                {
                    "key": "s3",
                    "title": "Milagro brillante ♪",
                    "description": "Cura una cantidad considerable de Vida a las fuerzas aliadas y a todos los personajes del equipo. La curación aumenta en proporción a la Vida Máx. de Bárbara.",
                    "abilities": []
                }
            ],
            "passives": [
                {
                    "key": "p1",
                    "title": "Con todo mi corazón",
                    "description": "Cuando se logra un \"Perfecto\" en un plato con efectos reconstituyentes, hay un 12% de posibilidades de obtener el doble de cantidad del producto.",
                    "descriptions": []
                },
                {
                    "key": "p2",
                    "title": "Momento de gloria",
                    "description": "Reduce el Coste de Aguante del personaje en un 12% cuando está dentro de los círculos melódicos de Que empiece el concierto ♪.",
                    "descriptions": []
                },
                {
                    "key": "p3",
                    "title": "Bis",
                    "description": "Cuando el personaje recoja un Orbe o una Partícula Elemental, extienede la duración de los círculos metódicos de Que empiece el concierto ♪ en 1 s. Puede extenderse un máximo de 5 s de esta forma.",
                    "descriptions": []
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "Canción de júbilo",
                    "description": "Bárbara obtiene 1 de Energía cada 10 s.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c2",
                    "title": "Explosión de vitalidad",
                    "description": "Reduce el TdE de Que empiece el concierto en 15%; Mientras esté activa la habilidad, el personaje actual obtiene 15% de Bono de Daño Hydro.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c3",
                    "title": "Estrella del Mañana",
                    "description": "Aumenta el nivel de habilidad de Milagro brillante +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "El esfuerzo será mi magia",
                    "description": "Por cada enemigo que Bárbara golpee con su Ataque Cargado, regenera 1 punto de energía. Se puede regenerar un máximo de 5 pts. de energía de esta manera con cualquier Ataque Cargado.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "Vínculo de inocencia",
                    "description": "Aumenta el nivel de habilidad de Que empiece el concierto +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c1",
                    "title": "Dedicándote Todo",
                    "description": "Cuando Bárbara está fuera de escena, si un miembro del equipo ha sido derrotado:",
                    "secondDescription": "Solo puede ocurrir una vez cada 15 min.",
                    "descriptions": [
                        "El personaje revive automáticamente.",
                        "Su vida se restaura en un 100%."
                    ]
                }
            ]
        },
        {
            "key": "Beidou",
            "name": "Beidou",
            "description": "Lider de la Flota Crux Meridianam. Es una jefa bastante desenfadada y franca.",
            "skills": [
                {
                    "key": "s1",
                    "title": "Conquista del océano",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Realiza hasta 5 tajos rápidos.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Sigue consumiendo Aguante para realizar golpes de espada continuos. Cuando termina el Ataque Cargado, hará un movimiento final de dos cortes con fuerza añadida.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": "Se lanza desde el aire para golpear el suelo, dañando a los enemigos a lo largo del camino e infligiendo Daño de Área en el momento del impacto.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Invocadora de mareas",
                    "description": "No hay de qué preocuparse. Si alguien levanta una mano contra ella o sus hombres, ella se vengará diez veces con la espada y el trueno.",
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Acumulando el poder del rayo, Beidou blande su espada hacia delante con fiereza, infligiendo Daño Electro.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Levanta su arma como un escudo, y la absorción máxima de daño se reduce proporcionalmente con la Vida Máx. de Beidou. Cuando la habilidad haya sido liberada o termine su duración, contraatacará con la energía almacenada dentro de la gran espada, infligiendo Daño Electro. Ataca usando la energía almacenada dentro de la gran espada tras su lanzamiento o una vez que expira la duración de esta habilidad, infligiendo Daño Electro, El Daño infligido aumenta con el número de veces que Beidou es atacada mientras dure la habilidad. La mayor bonificación de Daño se obtendrá una vez que este efecto se active dos veces.",
                            "descriptions": [
                                "Tiene 250% de Daño Electro.",
                                "Aplica el Elemento Electro a Beidou tras su activación."
                            ]
                        }
                    ]
                },
                {
                    "key": "s3",
                    "title": "Quebrantatormentas",
                    "description": "Recordando su batalla contra la gran bestia Haishan, Beidou recurre a esa monstruosa fuerza y al rayo para crear un Escudo del trueno a su alrededor que inflige Daño Electro a los enemigos cercanos.",
                    "abilities": [
                        {
                            "name": "Escudo del trueno",
                            "description": null,
                            "descriptions": [
                                "Al golpear con Ataques Normales y Ataques Cargados, crean una descarga de rayo que puede saltar entre enemigos, infligiendo Daño Electro.",
                                "Aumenta la RES a interrupción del personaje y reduce el Daño recibido.",
                                "Dispara un máximo de 1 descarga de rayo por segundo."
                            ]
                        }
                    ]
                }
            ],
            "passives": [
                {
                    "key": "p1",
                    "title": "Conquistador de mareas",
                    "description": "Disminuye el consumo de Aguante al nadar en un 20%.",
                    "descriptions": []
                },
                {
                    "key": "p2",
                    "title": "Castigo divino",
                    "description": "Contraatacar con Invocadora de mareas en el momento preciso de ser golpeado le otorga el Máx. Bono de Daño.",
                    "descriptions": []
                },
                {
                    "key": "p3",
                    "title": "Tormenta eléctrica",
                    "description": "Al lanzar el máximo Bono de Daño con Invocadora de mareas, en los 10s posteriores obtendrás los siguientes efectos:",
                    "descriptions": [
                        "Aumenta el Daño por Ataque Normal y Ataque Cargado en 15%. Vel. de Ataque Normal y Ataque Cargado +15%.",
                        "Reduce drásticamente el tiempo de preparación para Ataques Cargados."
                    ]
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "Cazador de ictiosaurios",
                    "description": "Al activar Quebrantatormentas:",
                    "secondDescription": null,
                    "descriptions": [
                        "Crea un escudo que absorbe el equivalente al 16% de la Vida Máx. en Daño durante 15 s.",
                        "El escudo tiene un 250% de absorción de Daño Electro."
                    ]
                },
                {
                    "key": "c2",
                    "title": "Tormenta sobre el mar turbulento",
                    "description": "Los rayos de Quebrantatormentas rebotan a 2 objetivos adicionales.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c3",
                    "title": "Invocadora de la tormenta",
                    "description": "Aumenta el nivel de habilidad de Invocadora de mareas +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "Venganza súbita",
                    "description": "Durante los siguiente 10 s de ser atacada, el Ataque Normal de Beidou obtiene 20% de Daño electro adicional.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "Caminante de mareas carmesí",
                    "description": "Aumenta el nivel de habilidad de Quebrantatormentas +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "Flagelo del mal",
                    "description": "Mientras esté activa la habilidad de Quebrantatormentas, la RES Electro de los enemigos alrededor se reduce en un 15%.",
                    "secondDescription": null,
                    "descriptions": []
                }
            ]
        },
        {
            "key": "Bennett",
            "name": "Bennett",
            "description": "El chico aventurero de Mondstadt. Su naturaleza amable no va acorde con su mala suerte.",
            "skills": [
                {
                    "key": "s1",
                    "title": "Espada de la suerte",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Realiza hasta 5 ataques rápidos.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Consume una cierta cantidad de Aguante para lanzar un golpe de espada cruzado.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": "Se lanza desde el aire para golpear el suelo, dañando a los enemigos a lo largo del camino e infligiendo Daño de Área en el momento del impacto.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Sobrecarga de pasión",
                    "description": "Bennett concentra el espíritu aventurero y la energía Pyro en su espada. Dependiendo del tiempo de carga, se producen diferentes efectos.",
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Realiza un rápido y ardiente movimiento con su espada, infligiendo Daño Pyro.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Dependiendo de la duración, lanza una habilidad distinta basada en en nivel de carga.",
                            "secondDescription": "Bennett no resulta herido por esta explosión.",
                            "descriptions": [
                                "Nivel 1: Golpea dos veces, infligiendo Daño Pyro y lanzando a los enemigos por los aires.",
                                "Nivel 2: Lanza 3 ataques consecutivos que infligen una cantidad significativa de Daño Pyro. El último ataque causa una explosión que lanza tanto a los enemigos como a Bennett por los aires."
                            ]
                        }
                    ]
                },
                {
                    "key": "s3",
                    "title": "Aventura maravillosa",
                    "description": "Bennett salta hacia el enemigo y ataca, infligiendo Daño Pyro y creando un círculo de apoyo moral.",
                    "abilities": [
                        {
                            "name": "Círculo de apoyo moral",
                            "description": null,
                            "descriptions": [
                                "Si la Vida de un personaje dentro del círculo es igual o inferior al 70%, su vida se regenerará continuamente.",
                                "Si al vida de un personaje dentro del círculo es mayor a 70%, obtendrán un Bono de ATQ igual a un porcentaje del ATQ Básico de Bennett.",
                                "Los personajes dentro del círculo obtendrán el efecto Pyro."
                            ]
                        }
                    ]
                }
            ],
            "passives": [
                {
                    "key": "p1",
                    "title": "Supuestamente seguro",
                    "description": "Reduce en un 25% el tiempo necesario para completar una expedición en Mondstadt.",
                    "descriptions": []
                },
                {
                    "key": "p2",
                    "title": "Resurgimiento de la pasión",
                    "description": "Reduce el TdE de Sobrecarga de pasión en 20%.",
                    "descriptions": []
                },
                {
                    "key": "p3",
                    "title": "Fervor intrépido",
                    "description": "Dentro del área de Aventura maravillosa, Sobrecarga de pasión tiene los siguientes efectos:",
                    "descriptions": [
                        "Su TdE se reduce en un 50%.",
                        "Bennett no será lanzado por los aires con la Carga 2."
                    ]
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "Visión de aventura",
                    "description": "El efecto de aumento de ATQ de Aventura maravillosa ya no tiene restricción de Vida, y el personaje gana un 20% adicional de ATQ Básico.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c2",
                    "title": "Huida desesperada",
                    "description": "Aumenta la Recarga de Energía de Bennett en un 30% cuando la Vida es menor al 70%.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c3",
                    "title": "Pasión ardiente",
                    "description": "Aumenta el nivel de habilidad de Sobrecarga de pasión +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "Calidez inagotable",
                    "description": "Usar un ATQ Normal al ejecutar el segundo ataque del nivel 1 de carga de Sobrecarga de pasión permite realizar un ataque adicional. Este ataque adicional es equivalente al 135% del Daño del segundo ataque.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "Explorador verdadero",
                    "description": "Aumenta el nivel de habilidad de Aventura maravillosa +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "Fuego y coraje",
                    "description": "Si los personaje en uso utilizan espada ligera, mandoble o lanza y se encuentran en el AdE de Aventura maravillosa, dichos personajes obtendrán un 15% de Bono de Daño Pyro. Además, serán imbuidos del Elemento Pyro.",
                    "secondDescription": null,
                    "descriptions": []
                }
            ]
        },
        {
            "key": "Chongyun",
            "name": "Chongyun",
            "description": "Un joven exorcista procedente de una familia de exorcistas. Hace todo lo que puede para reprimir su propia \"positividad congénita\".",
            "skills": [
                {
                    "key": "s1",
                    "title": "Desgracia de los demonios",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Realiza hasta 4 tajos rápidos.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Sigue consumiendo Aguante para realizar golpes de espada giratorios contra los enemigos cercanos. Al final del Ataque Cargado, realizará un golpe de espada más poderoso.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": "Se lanza desde el aire para golpear el suelo, dañando a los enemigos a lo largo del camino e infligiendo Daño de Área en el momento del impacto.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Filo espiritual: Estratos de escarcha Chonghua",
                    "description": "Chongyun golpea el suelo con su gran espada, causando una explosión Cryo en un AdE circular frente a él que inflige daño Cryo. Después de un breve periodo de tiempo, el aire frío creado por la explosión Cryo se concentra en un campo de estratos de escarcha, dentro del cual se imbuye del Elemento Cryo a los personajes que usan espadas ligeras, mandobles y lanzas.",
                    "abilities": []
                },
                {
                    "key": "s3",
                    "title": "Filo espiritual: Estrella cortanubes",
                    "description": "Al crear sellos de mano secretos, Chongyun invoca tres Hojas del espíritu gigantes que caen a la tierra, una tras otra, explotando al golpear el suelo. Cuando las Hojas del espíritu gigantes impactan, infligen Daño Cryo en el AdE.",
                    "abilities": []
                }
            ],
            "passives": [
                {
                    "key": "p1",
                    "title": "Viaje por las nubes",
                    "description": "Reduce en un 25% el tiempo necesario para completar una expedición en Liyue.",
                    "descriptions": []
                },
                {
                    "key": "p2",
                    "title": "Respiración inalterable",
                    "description": "Aumenta un 8% la Vel. de ATQ Normal de los personajes con espadas ligeras, espadas Mandoble o lanzas dentro del campo creado por Filo espiritual: Estratos de escarcha.",
                    "descriptions": []
                },
                {
                    "key": "p3",
                    "title": "Hoja cazaescarcha",
                    "description": "Cuando el campo creado por Filo espiritual: Estratos de escarcha desaparece, invoca otro Filo espiritual para atacar a los enemigos cercanos, infligiendo el 100% del Daño de habilidad de Estratos de escarcha como Daño Cryo AdE. La Res Cryo de los enemigos a los que ataque disminuirá en un 10% durante 8 s.",
                    "descriptions": []
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "Ventisca desatada",
                    "description": "El último Ataque Normal de la secuencia de Chongyun lanza 3 cuchillas de hielo. Cada cuchilla inflige el 50% del ATQ de Chongyun como Daño Cryo a todos los enemigos que se atraviesen.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c2",
                    "title": "Revolución atmosférica",
                    "description": "El TdE de las Hab. Elementales y Definitivas lanzadas dentro del área de escarcha creado por Filo espiritual: Estratos de escarcha se reduce en un 15%.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c3",
                    "title": "Cirro-explosión",
                    "description": "Aumenta el nivel de habilidad de Filo espiritual: Estrella cortanubes +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "Cielos congelados",
                    "description": "Chongyun regenera 1 punto de Energía cada vez que golpea a un enemigo afectado por Cryo. Este efecto solo puede ocurrir una vez cada 2 s.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "El verdadero camino",
                    "description": "Aumenta el nivel de habilidad de Filo espiritual: Estratos de escarcha +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "Ofrenda de las Cuatro Divinidades",
                    "description": "Filo espiritual: Estrella cortanubes inflige un 15% más de Daño a los enemigos con un porcentaje de Vida más bajo que el de Chongyun. Esta habilidad también invocará un Filo espiritual adicional.",
                    "secondDescription": null,
                    "descriptions": []
                }
            ]
        },
        {
            "key": "Diluc",
            "name": "Diluc",
            "description": "El magnate del imperio vinícola de Mondstadt, inigualable en todos los sentidos.",
            "skills": [
                {
                    "key": "s1",
                    "title": "Espada templada",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Realiza hasta 4 tajos rápidos.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Sigue consumiendo Aguante para realizar golpes de espada continuos. Cuando termina el Ataque Cargado, hará un movimiento final de dos cortes con fuerza añadida.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": "Se lanza desde el aire para golpear el suelo, dañando a los enemigos a lo largo del camino e infligiendo Daño de Área en el momento del impacto.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Filo ardiente",
                    "description": "Da un golpe de espada hacia enfrente que inflige Daño Pyro. Esta habilidad puede utilizarse 3 veces consecutivas. Entra en TdE si no se activa después de un periodo corto.",
                    "abilities": []
                },
                {
                    "key": "s3",
                    "title": "Amanecer",
                    "description": "Unas llamas emergen de la espada de Diluc, las cuales derriban a los enemigos cercanos e infligen Daño Pyro. Las llamas convergen en la espada, invocando un fénix que vuela hacia adelante e infligiendo daño Pyro a todos los enemigos en su camino. El fénix explota al llegar a su destino, infligiendo una cantidad significativa de daño Pyro en el AdE. Las llamas que quedan en el arma de Diluc la imbuyen del Elemento Pyro.",
                    "abilities": []
                }
            ],
            "passives": [
                {
                    "key": "p1",
                    "title": "Tradición del Caballero del Amanecer",
                    "description": "Recupera el 15% de los minerales utilizados en la fabricación de espadas Mandoble.",
                    "descriptions": []
                },
                {
                    "key": "p2",
                    "title": "Implacable",
                    "description": "Reduce el Coste de Aguante del Ataque Cargado de Diluc en 50%, y la duración del Ataque Cargado aumenta en 3s.",
                    "descriptions": []
                },
                {
                    "key": "p3",
                    "title": "Bendición del fénix",
                    "description": "El Encantamiento Pyro proporcionado por Amanecer se extiende 4s más. Además, Diluc gana un 20% de Bono de Daño Pyro durante la duración de este efecto.",
                    "descriptions": []
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "Condena",
                    "description": "Aumenta el Daño de Diluc en un 15% contra enemigos con más del 50% de Vida.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c2",
                    "title": "Ardor incesante",
                    "description": "Al recibir daño, Diluc aumenta su ATQ Básico en un 10% y la Vel. ATQ en un 5% durante 10 s. Puede acumularse un máximo de 3 veces, y solo puede ocurrir una vez cada 1.5 s.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c3",
                    "title": "Fuego y acero",
                    "description": "Aumenta el nivel de habilidad de Filo ardiente +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "Flujo llameante",
                    "description": "Lanzar Filo ardiente siguiendo la secuencia aumenta considerablemente el daño infligido. 2s después de lanzar Filo ardiente, aumenta el Daño del siguiente Filo ardiente en un 40% durante 2 s.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "Fénix, heraldo del amanecer",
                    "description": "Aumenta el nivel de habilidad de Amanecer + 3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "Espada llameante, némesis de la oscuridad",
                    "description": "Después de lanzar Filo ardiente, aumenta el Daño y la Vel. de ATQ Normal de los siguientes 2 ataques dentro de los próximos 6 s en 30%. Además, Filo ardiente no interrumpe la secuencia de ataque.",
                    "secondDescription": null,
                    "descriptions": []
                }
            ]
        },
        {
            "key": "Diona",
            "name": "Diona",
            "description": "Una joven cuya sangre no es humana por completo. Es la popular cantinera de la Taberna Cola de Gato.",
            "skills": [
                {
                    "key": "s1",
                    "title": "Puntería de cazador",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Realiza hasta 5 disparos consecutivos con arco.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Dispara un Disparo Preciso que inflige mayor daño. Al apuntar, crea una escarcha que acumula Frío en la punta de la flecha, infligiendo Daño Cryo al liberarlo.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": "Dispara una lluvia de flechas desde el aire y desciende rápidamente, causando daño a distancia al impactar en el suelo.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Zarpazo helado",
                    "description": "Dispara unas garras heladas, infligiendo Daño Cryo a los enemigos y creando un escudo es proporcional a la Vida Máx. de Diona, y su duración depende del número de garras que golpeen a su objetivo.",
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Dispara 2 veloces garras heladas.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Retrocede rápidamente y dispara 5 garras heladas. Además, genera un escudo que gana un 75% de bono de absorción de Daño.Este escudo tiene un 250% de bono de absorción de Daño Cryo sobre el personaje actual.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s3",
                    "title": "Cóctel Asesino",
                    "description": "Lanza un cóctel helado especial que inflige Daño Cryo en el adE y crea una Bruma embriagadora en un área.",
                    "abilities": [
                        {
                            "name": "Bruma embriagadora",
                            "description": null,
                            "descriptions": [
                                "Inflige Daño Cryo continuo a los enemigos que están en el área.",
                                "La Vida de los personajes que están en el área se regenera continuamente."
                            ]
                        }
                    ]
                }
            ],
            "passives": [
                {
                    "key": "p1",
                    "title": "Refrigerio gratis",
                    "description": "Cuando se logra un \"Perfecto\" en un plato con efectos reconstituyentes, hay un 12% de posibilidades de obtener el doble de cantidad del producto.",
                    "descriptions": []
                },
                {
                    "key": "p2",
                    "title": "Menú secreto de Cola de Gato",
                    "description": "Aumenta en un 10% la Vel. Movimiento y redce en un 10% el Coste de Aguante de los personajes bajo la protección del escudo creado por Zarpazo Helado.",
                    "descriptions": []
                },
                {
                    "key": "p3",
                    "title": "Diversión de los borrachos",
                    "description": "Disminuye en un 10% el ATQ infligido por los enemigos que entran en el área de Cóctel asesino durante 15 s.",
                    "descriptions": []
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "Cóctel de la casa",
                    "description": "Cuando termina el efecto de Cóctel asesino, Diona recupera 15 pts. de Energía Elemental.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c2",
                    "title": "Ronroneo Glacial",
                    "description": "Aumenta en un 15% el Daño de Zarpazo helado y 15% de la absorción de Daño de escudo. Además, al golpear a un enemigo, crea para el resto de personajes cercanos un escudo que absorbe hasta un 50% del Daño de Zarpazo helado durante 5 s.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c3",
                    "title": "¿O-otra copa más?",
                    "description": "Aumenta el nivel de habilidad de Cóctel asesino +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "Asesina de la industria del vino",
                    "description": "Dentro del área de Cóctel asesino, el tiempo de carga de Disparo Preciso de Diona se reduce en un 60%.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "¡Doble de hielo!",
                    "description": "Aumenta el nivel de habilidad de Zarpazo helado +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "Hora de cerrar",
                    "description": "Los personajes que estén dentro del área de Cóctel asesino obtienen uno de los siguientes efectos dependiendo de su Vida:",
                    "secondDescription": null,
                    "descriptions": [
                        "Si su Vida es igual o inferior al 50%, aumenta su Bono de Curación recibida en un 30%",
                        "Si su vida es superior al 50% aumenta la Maestría Elemental en 200 pts."
                    ]
                }
            ]
        },
        {
            "key": "Fischl",
            "name": "Fischl",
            "description": "Una chica misteriosa que se hace llamar \"Princesa del Juicio\". Siempre camina junto a un cuervo oscuro llamado Oz.",
            "skills": [
                {
                    "key": "s1",
                    "title": "Flechas del juicio",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Realiza hasta 5 disparos consecutivos con arco",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Realiza un Tiro Preciso más preciso con daño aumentado. Al apuntar, los espíritus oscuros del Reino de la Noche Eterna atenderán al llamado de su Princesa y se acumularán en la punta de flecha encantada. Cuando esté completamente habitado, el Relámpago del juicio inflige una cantidad considerable de Daño Electro.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": "Dispara una lluvia de flechas al aire antes de caer y golpear el suelo, infligiendo Daño de Área en el momento del impacto.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Vigía de la noche",
                    "description": "Invoca a Oz. El cuervo nocturno compuesto de oscuridad y truenos desciende sobre la tierra, infligiendo Daño Electro en una pequeña AdE. Mientras dure la habilidad, Oz atacará continuamente a los enemigos cercanos con Balas Electro. Mantén presionado para ajustar la ubicación en la que se invocará a Oz. Pulsa de nuevo cuando Oz esté presente para invocarlo al lado de Fischl.",
                    "abilities": []
                },
                {
                    "key": "s3",
                    "title": "Ilusión nocturna",
                    "description": "Invoca a Oz para extender sus alas del crepúsculo y proteger a Fischl. Durante la habilidad, tiene las siguiente propiedades:",
                    "abilities": [
                        {
                            "name": "",
                            "description": null,
                            "descriptions": [
                                "Fischl adquiere la forma de Oz, lo que aumenta considerablemente su Velocidad de Movimiento.Cada enemigo puede ser golpeado solo una vez.",
                                "Inflige Daño Electro a los enemigos cercanos.",
                                "Una vez que finalice la habilidad, Oz permanecerá en el campo de batalla atacando a los enemigos de la Princesa. Si Oz ya está en el campo de batalla, reiniciará su duración."
                            ]
                        }
                    ]
                }
            ],
            "passives": [
                {
                    "key": "p1",
                    "title": "Mi jardín secreto",
                    "description": "Reduce en un 25% el tiempo necesario para completar una expedición en Mondstadt.",
                    "descriptions": []
                },
                {
                    "key": "p2",
                    "title": "Cuervo devoraestrellas",
                    "description": "Cuando Fischl golpea a Oz con una carga completa de Tiro preciso, Oz lanza una Retribución del trueno a los enemigos cercanos, causando Daño Electro de Área igual al 152.7% del daño de la flecha.",
                    "descriptions": []
                },
                {
                    "key": "p3",
                    "title": "Juicio de los pecadores",
                    "description": "Si un personaje desencadena una Reacción Elemental relacionada con Electro cuando Oz está en combate, el enemigo será golpeado con Retribución del trueno, infligiendo Daño Electro igual al 80% del ATQ de Fischl.",
                    "descriptions": []
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "Ojo de cuervo penetrante",
                    "description": "Cuando Oz no está en el campo de batalla, también mira a Fischl a través del Ojo de cuervo. Cuando Fischl daña al enemigo con Ataque Normal, Oz atacará simultáneamente con el Ojo de cuervo e infligirá un 22% de daño.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c2",
                    "title": "Devoradora de pecados",
                    "description": "Vigía de la noche inflige un 200% de daño adicional, y su AdE aumenta en un 50%.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c3",
                    "title": "Alas sombrías",
                    "description": "Aumenta el nivel de habilidad de Alas de vigilancia nocturna +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "Fantasía de la reina",
                    "description": "Al lanzar Ilusión nocturna, inflige un 222% de daño de ATQ de Daño Electro a los enemigos cercanos. Cuando la habilidad termina, Fischl recupera el 20% de su Vida.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "Noche silenciosa",
                    "description": "Aumenta el nivel de habilidad de Ilusión nocturna +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "Ave de la noche eterna",
                    "description": "Aumenta la duración de la invocación de Oz en 2 s. Mientras Oz esté presente, atacará con el personaje actual, e infligirá el 30% del ATQ de Fischl como Daño Electro.",
                    "secondDescription": null,
                    "descriptions": []
                }
            ]
        },
        {
            "key": "Ganyu",
            "pending": true,
            "name": "Ganyu",
            "description": "La secretaria del pabellón Yuehai. La sangre de los Qilin, una bestia iluminada, fluye por sus venas.",
            "skills": [
                {
                    "key": "s1",
                    "title": "Técnica de tiro Liutian",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Ejecuta hasta 6 disparos consecutivos.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": " Ejecuta un Disparo Preciso. Mientras apunta, un aura helada se acumulará en la punta de la flecha antes de que esta sea disparada. Sus efectos serán distintos dependiendo de cuánto tiempo se ha cargado:",
                            "descriptions": [
                                "Carga 1: Dispara una flecha congelada que inflige Daño Cryo.",
                                "Carga 2: Dispara una flecha helada que inflige Daño Cryo. Al golpear a su objetivo, la flecha estallará, creando una explosión de escarcha e infligiendo Daño Cryo en el AdE."
                            ]
                        },
                        {
                            "key": "a3",
                            "description": "Dispara una lluvia de flechas al aire antes de caer y golpear el suelo, infligiendo Daño de Área en el momento del impacto.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Senda de Chilin",
                    "description": "Ganyu da un salto atrás para dejar un loto de hielo, evitando toda impureza e inflingiendo Daño Cryo en el AdE.",
                    "abilities": [
                        {
                            "name": "Loto de Hielo",
                            "descriptions": [
                                "El loto de hielo provoca continuamente a los enemigos que lo rodean, atrayéndolos para que lo ataquen.",
                                "La resistencia del loto es proporcional a la Vida Max. de Ganyu.",
                                "Explota cuando es destruido o una vez terminada su duración, infligiendo Daño Cryo en el AdE.."
                            ]
                        }
                    ]
                },
                {
                    "key": "s3",
                    "title": "Diluvio celestial",
                    "description": "Fusiona nieve y escarcha en la atmósfera para invocar una perla de hielo sagrada que exorciza el mal. Mientras dure la habilidad, la perla hará llover continuamente fragmentos de hielo que golpean a los enemigos dentro de un AdE e infligen Daño Cryo.",
                    "abilities": []
                }
            ],
            "passives": [
                {
                    "key": "p1",
                    "title": "Arco de repuesto",
                    "description": "Recupera el 15% de los minerales utilizados en la fabricación de arcos.",
                    "descriptions": []
                },
                {
                    "key": "p2",
                    "title": "Corazón indiviso",
                    "description": "Tras lanzar una flecha helada, aumenta en un 20% la Prob.CRIT de la siguiente flecha helada y de la explosión de escarcha causada por ella durante 5 s.",
                    "descriptions": []
                },
                {
                    "key": "p3",
                    "title": "Armonía entre el Cielo y la Tierra",
                    "description": "Los personajes del equipo dentro del área de Diluvio celestial obtienen un 20% de Bono de Daño Cryo.",
                    "descriptions": []
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "Bebedora de rocío",
                    "description": "Reduce en un 15% la RES Cryo de los enemigos golpeados por una flecha helada de Carga 2 o una explosión de escarcha durante 6 s.\nAdemás, al golpear a un enemigo, Ganyu recupera 2 pts. de Energía Elemental. Este efecto solo puede activarse una vez por cada flecha helada de carga 2, independientemente de que tanto dicha flecha helada como la explosión de escarcha golpeen al enemigo.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c2",
                    "title": "La auspiciosa",
                    "description": "Aumenta en 1 las cargas de Senda de Chilin.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c3",
                    "title": "Jinete de las nubes",
                    "description": "Aumenta el nivel de habilidad de Diluvio celestial +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "Viaje al Oeste",
                    "description": "Los enemigos une estén en el AdE de Diluvio celestial reciben daño adicional. Este efecto se fortalece con el tiempo.\nEl daño comienza con un 5% adicional, y aumenta en un 5% cada 3 s hasta un máximo de un 25%.\nEste efecto persiste durante 3 s después de que el enémigo se aleje del AdE de la habilidad.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "La misericordiosa",
                    "description": "Aumenta el nivel de habilidad de Senda de Chilin +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "La clemente",
                    "description": "Utilizar Senda de Chilin hace que durante 30 s no se requiera cargar la siguiente flecha helada.",
                    "secondDescription": null,
                    "descriptions": []
                }
            ]
        },
        {
            "key": "HuTao",
            "name": "Hu Tao",
            "description": "77.° directora de la Funeraria El Camino. Pese a su corta edad, ya es la principal encargada de todos los asuntos funerarios de Liyue.",
            "skills": [
                {
                    "key": "s1",
                    "title": "Técnica de lanza de El Camino",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Realiza hasta 6 ataques rápidos con lanza.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Consume una cierta cantidad de Aguante para lanzarse al frente e inflige daño a los enemigos en el camino.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": "Se lanza desde el aire para golpear el suelo, dañando a los enemigos cercanos e infligiendo Daño en el AdE en el momento del impacto.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Guía hacia el más allá",
                    "description": "Solo las llamas eternas pueden purificar las impurezas de este mundo.\nHu Tao consume una parte de su Vida para empujar a sus enemigos y entrar en el estado de mariposa excelsa.",
                    "abilities": [
                        {
                            "name": "Mariposa excelsa",
                            "descriptions": [
                                "Aumenta el ATQ de Hu Tao en base a la Vida Máx. que tenía al entrar en este estado. El bono de ATQ obtenido de esta forma no podrá ser superior al 400% del ATQ Básico de Hu Tao.",
                                "El daño de ATQ se convierte en Daño Pyro. Este cambio elemental no puede sustituirse imbuyéndose de otro elemento.",
                                "Al atacar a sus enemigos con Ataques Cargados, aplicará sobre ellos el efecto de pétalos sangrientos.",
                                "Aumenta la RES a interrupción de Hu Tao."
                            ]
                        },
                        {
                            "name": "Pétalos sangrientos",
                            "description": " Los enemigos afectados por pétalos sangrientos recibirán Daño Pyro cada 4 s. Este daño se considera daño de Habilidad Elemental.\nCada enemigo solo puede ser afectado por un único pétalo sangriento al mismo tiempo, y dicho efecto solamente podrá ser reiniciado por Hu Tao.\nEl estado de mariposa excelsa se disparará cuando su duración termine, o cuando Hu Tao se retire del combate o sea derrotada.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s3",
                    "title": "Calma de los espíritus",
                    "description": "Hu Tao ordena a las almas ardientes que ataquen, e inflige Daño Pyro en una gran AdE.\nAl golpear a sus enemigos, Hu Tao regenera Vida en proporción a su Vida Máx. Este efecto solo puede tener lugar contra un máximo de 5 enemigos.\nSi la Vida de Hu Tao es inferior o igual al 50% al atacar con esta habilidad, infligirá mayor daño y regenerará más Vida.",
                    "abilities": []
                }
            ],
            "passives": [
                {
                    "key": "p1",
                    "title": "Cuanto más, mejor",
                    "description": "Cuando se logra un \"Perfecto\" al cocinar un plato, hay una probabilidad del 18% de obtener ese mismo plato con la calidad \"extraña\".",
                    "descriptions": []
                },
                {
                    "key": "p2",
                    "title": "Aleteo sutil",
                    "description": "Al terminar la duración del estado de mariposa excelsa aplicado mediante Guía hacia el más allá, la Prob. CRIT de todos los miembros del equipo (a excepción de Hu Tao) aumenta en un 12% durante 8 s.",
                    "descriptions": []
                },
                {
                    "key": "p3",
                    "title": "Baño de sangre",
                    "description": "Cuando su Vida es inferior o igual al 50%, Hu Tao obtiene un 33% de Bono de Daño Pyro.",
                    "descriptions": []
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "Florecimiento carmesí",
                    "description": "Al estar bajo los efectos de mariposa excelsa aplicados por Guía hacia el más allá, el Ataque Cargado de Hu Tao no consumirá Aguante.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c2",
                    "title": "Mal presagio",
                    "description": "Aumenta el daño infligido por pétalos sangrientos en una cantidad equivalente al 10% de la Vida Máx. que tenía Hu Tao al aplicar dicho efecto.\nAdemás, Calma de los espíritus aplicará sobre los enemigos atacados el efecto de pétalos sangrientos.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c3",
                    "title": "Persistencia escarlata",
                    "description": "Aumenta el nivel de habilidad de Guía hacia el más allá +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "Jardín del reposo eterno",
                    "description": "Al derrotar a un enemigo que está bajo los efectos de pétalos sangrientos aplicados por Hu Tao, la Prob. CRIT de todos los miembros del equipo (a excepción de Hu Tao) aumenta en un 12% durante 15 s.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "Ofrenda de incienso",
                    "description": "Aumenta el nivel de habilidad de Calma de los espíritus +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "Último suspiro",
                    "description": "Cuando la Vida de Hu Tao esté por debajo del 25% o cuando vaya a recibir una cantidad de daño suficiente como para ser derrotada, esta habilidad se activará y tendrá los siguientes efectos:",
                    "secondDescription": null,
                    "descriptions": [
                        "Dicho daño no hará que Hu Tao sea derrotada, y durante 10 s aumentará en un 200% todas sus RES Elementales y su RES Física, así como su Prob. CRIT en un 100%. Además, su RES a interrupción se incrementará en gran medida.",
                        "Este efecto se activará automáticamente cuando Hu Tao tenga 1 pt. de Vida.",
                        "Solo puede ocurrir una vez cada 60 s."
                    ]
                }
            ]
        },
        {
            "key": "Jean",
            "name": "Jean",
            "description": "La justa y rigurosa Caballera de Dandelion, y Gran Maestra Intendente de los Caballeros de Favonius de Mondstadt.",
            "skills": [
                {
                    "key": "s1",
                    "title": "Técnica de espada Favonius",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Realiza hasta 5 ataques rápidos.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Consume una cierta cantidad de Aguante para desatar un ataque que contiene fuerza Anemo.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": "Se lanza desde el aire para golpear el suelo, dañando a los enemigos a lo largo del camino e infligiendo Daño de Área en el momento del impacto.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Filo de ventisca",
                    "description": "Concentrando el poder del viento en su espada, Jean canaliza una minitormenta, lanzando a los enemigos que se encuentran en la dirección que apunta e infligiendo una gran cantidad de Daño Anemo.",
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Aguante para ordenar al torbellino que atraiga a los enemigos cercanos frente a ella. La dirección de atracción puede ajustarse. El personaje quedará inmóvil mientras dure la habilidad.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s3",
                    "title": "Brisa de Dandelion",
                    "description": "Invoca la protección del viento para crear un Campo de diente de león, empujando a los enemigos cercanos e infligiendo Daño Anemo. Al mismo tiempo, cura de inmediato una gran cantidad de Vida a todos los aliados y miembros del equipo. La cantidad restaurada varía según el ATQ de Jean.",
                    "abilities": [
                        {
                            "name": "Campo de dientes de león",
                            "description": null,
                            "descriptions": [
                                "Regenera continuamente la Vida de un aliado y continuamente otorga a dicho aliado afinidad Anemo.",
                                "Inflige Daño Anemo a los enemigos que entran o salen del Campo."
                            ]
                        }
                    ]
                }
            ],
            "passives": [
                {
                    "key": "p1",
                    "title": "Viento guía",
                    "description": "Cuando se logra un \"Perfecto\" en un plato con efectos reconstituyentes, hay un 12% de posibilidades de obtener el doble de cantidad del producto.",
                    "descriptions": []
                },
                {
                    "key": "p2",
                    "title": "Compañero del viento",
                    "description": "Al golpear, los Ataques Normales tienen un 50% de probabilidad de curar a todos los miembros del grupo un 15% del ATQ de Jean.",
                    "descriptions": []
                },
                {
                    "key": "p3",
                    "title": "Que el viento nos guie",
                    "description": "Después de usar la Brisa de Dandelion regenera el 20% de la Energía elemental.",
                    "descriptions": []
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "Espiral de tempestad",
                    "description": "Al presionar Filo de ventisca por más de 1 s., aumenta la velocidad de atracción e inflige un 40% de Daño adicional.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c2",
                    "title": "Escudo del pueblo",
                    "description": "Cuando Jean recoge un Orbe Elemental o Partícula Elemental, aumenta la Vel. ATQ y la Vel. Movimiento de todos los miembros del equipo en un 15% durante 15 s.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c3",
                    "title": "Cuando sopla el viento del oeste",
                    "description": "Aumenta el nivel de habilidad de Brisa de Dandelion +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "Reino de Dandelion",
                    "description": "La RES Anemo de todos los enemigos dentro del campo de Brisa de Dandelion disminuye en un 40%.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "Ráfaga explosiva",
                    "description": "Aumenta el nivel de habilidad de Filo de ventisca +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "Diente de león, fiel protectora de Mondstadt",
                    "description": "Dentro del campo de Brisa de Dandelion, disminuye el Daño entrante en un 35%. Al salir de él, el efecto dura 3 ataques más o 10s.",
                    "secondDescription": null,
                    "descriptions": []
                }
            ]
        },
        {
            "key": "Kaeya",
            "name": "Kaeya",
            "description": "El gran estratega de los Caballeros de Favonius, con una apariencia algo excéntrica...",
            "skills": [
                {
                    "key": "s1",
                    "title": "Técnica de espada ceremonial",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Realiza hasta 5 ataques rápidos.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Consume una cierta cantidad de Aguante para lanzar un golpe de espada cruzado.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": "Se lanza desde el aire para golpear el suelo, dañando a los enemigos a lo largo del camino e infligiendo Daño de Área en el momento del impacto.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Golpe de escarcha",
                    "description": "Lanza una ráfaga gélida que inflige Daño Cryo a los enemigos frente a Kaeya.",
                    "abilities": []
                },
                {
                    "key": "s3",
                    "title": "Vals gélido",
                    "description": "Al condensar la escarcha en el aire, Kaeya invoca 3 carámbanos que giran a su alrededor. Estos carámbanos seguirán al personaje e infligirán Daño Cryo a los enemigos que se atraviesen.",
                    "abilities": []
                }
            ],
            "passives": [
                {
                    "key": "p1",
                    "title": "Fuerza subyacente",
                    "description": "Disminuye el consumo de Aguante de todos los miembros del equipo al esprintar en un 20%.",
                    "descriptions": []
                },
                {
                    "key": "p2",
                    "title": "Espada de sangre fría",
                    "description": "Al golpear a un enemigo con Golpe de escarcha, Kaeya restaura Vida equivalente al 15% del ATQ.",
                    "descriptions": []
                },
                {
                    "key": "p3",
                    "title": "Corazón glacial",
                    "description": "Cuando Golpe de escarcha congela a un enemigo, el enemigo congelado dejará caer Partículas Elementales adicionales. Cada golpe dará un máximo de 2 Partículas Elementales adicionales.",
                    "descriptions": []
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "Sangre Excelente",
                    "description": "La Prob. CRIT del ATQ Normal y Cargado de Kaeya aumentan en un 15% contra enemigos afectados por Cryo.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c2",
                    "title": "Actuación eterna",
                    "description": "Al derrotar a un enemigo con Vals gélido, aumenta su duración en 2.5 s hasta un máximo de 15 s.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c3",
                    "title": "Baile de escarcha",
                    "description": "Aumenta el nivel de habilidad de Golpe de escarcha + 3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "Beso Congelado",
                    "description": "Cuando la Vida de Kaeya cae por debajo del 20%:",
                    "secondDescription": null,
                    "descriptions": [
                        "Genera un escudo que absorbe Daño igual al 30% de su Vida Máx. durante 20 s.",
                        "El escudo absorberá un 250% del Daño Cryo recibido. Solo puede ocurrir una vez cada 60 s."
                    ]
                },
                {
                    "key": "c5",
                    "title": "Abrazo helado",
                    "description": "Aumenta el nivel de habilidad de Vals gélido +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "Torbellino helado",
                    "description": "Vals gélido produce 1 carámbano adicional y regenera 15 pts. de Energía al ser lanzado.",
                    "secondDescription": null,
                    "descriptions": []
                }
            ]
        },
        {
            "key": "Keqing",
            "name": "Keching",
            "description": "El Equilibrio Terrenal de las Siete Estrellas de Liyue. Tiene su opinión sobre el gobierno de Rex Lapis en Liyue, pero, en verdad, a los dioses les gustan bastante los escépticos como ella.",
            "skills": [
                {
                    "key": "s1",
                    "title": "Estilo Yunlai",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Realiza hasta 5 ataques rápidos.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Consume una cierta cantidad de Aguante para lanzar un golpe de espada cruzado.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": "Se lanza desde el aire para golpear el suelo, dañando a los enemigos a lo largo del camino e infligiendo Daño de Área en el momento del impacto.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Retorno estelar",
                    "description": "Lanza una Cuña relámpago que aniquila a sus enemigos como un rayo veloz.\nCuando la cuña golpea a su objetivo, inflige Daño Electro a los enemigos en un AdE pequeña, y añade una Marca de Cuña en el lugar donde golpea.",
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Mantén pulsado para ajustar la dirección en la que se lanzará la cuña. Las cuñas lanzadas al mantener presionado pueden suspenderse en el aire, permitiendo que Keching salte hacia ellas al usar Retorno estelar por segunda vez.",
                            "descriptions": []
                        },
                        {
                            "name": "Cuña relámpago",
                            "description": "Si Keching usa Retorno estelar de nuevo o hace un Ataque Cargado durante la habilidad, borrará la Marca de Cuña y producirá diferentes efectos:",
                            "descriptions": [
                                "Si vuelve a usar Retorno Estelar, se teletransportará hasta la ubicación de la marca y desatará un ataque cortante que inflige Daño Electro en el AdE. Al teletransportarse a una cuña lanzada al mantener presionado, Keching ignora los obstáculos del terreno.",
                                "Si Keching usa un Ataque Cargado, desencadenará una serie de cortes de tormenta en la Marca de Cuña, infligiendo Daño Electro en el AdE"
                            ]
                        }
                    ]
                },
                {
                    "key": "s3",
                    "title": "Paseo celestial",
                    "description": "Keching desata el poder del rayo, infligiendo Daño Electro en el AdE. Después, se funde en la sombra de su espada y ataca con una serie de golpes relámpago a los enemigos infligiendo, al mismo tiempo, Daño Electro. El ataque final inflige una gran cantidad de Daño Electro en el AdE.",
                    "abilities": []
                }
            ],
            "passives": [
                {
                    "key": "p1",
                    "title": "Supervisora de la tierra",
                    "description": "Reduce en un 25% el tiempo necesario para completar una expedición en Liyue.",
                    "descriptions": []
                },
                {
                    "key": "p2",
                    "title": "Penitencia del trueno",
                    "description": "Al utilizar Retorno estelar mientras esté presente una cuña relámpago, Keching se imbuye del Elemento Electro durante 5 s.",
                    "descriptions": []
                },
                {
                    "key": "p3",
                    "title": "Dignidad aristocrática",
                    "description": "Al lanzar Paseo celestial, la Prob. CRIT y la Recarga de Energía de Keching incrementan en un 15%. Este efecto dura 8 s.",
                    "descriptions": []
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "Fuerza atronadora",
                    "description": "Volver a lanzar Retorno estelar mientras está presente una Cuña relámpago hace que Keching inflija 50% de su ATQ como Daño Electro en el AdE en el punto de inicio y final al teletransportarse.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c2",
                    "title": "Impuestos desorbitantes",
                    "description": "Cuando los ATQ Normal y Cargado de Keching golpean a los enemigos afectados por Electro, tienen un 50% de probabilidad de producir una Partícula Elemental. Este efecto solo puede ocurrir una vez cada 5 segundos.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c3",
                    "title": "Reforma anticipada",
                    "description": "Aumenta el nivel de habilidad de Paseo celestial +3. Puede ser aumentado hasta Niv. 15",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "Sintonización",
                    "description": "10 s después de que Keching lance una Reacción Elemental relacionada con Electro, aumenta su ATQ en un 25%.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "Luces viajeras",
                    "description": "Aumenta el nivel de habilidad de Retorno estelar +3. Puede ser aumentado hasta Niv. 15",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "Estrella tenaz",
                    "description": "Al hacer un Ataque Normal, un Ataque Cargado, una Habilidad Elemental o una Habilidad Definitiva, Keching obtiene un 6% de Bono de Daño Electro durante 8 s. Los efectos activados por Ataques Normales, Ataques Cargados, Habilidades Elementales y Habilidades Definitivas no se incluirán en dicho bono.",
                    "secondDescription": null,
                    "descriptions": []
                }
            ]
        },
        {
            "key": "Klee",
            "name": "Klee",
            "description": "Una visitante frecuente de los calabozos de los Caballeros de Favonius, la maestra de explosiones de Mondstadt. La llaman \"el Sol Fugitivo\".",
            "skills": [
                {
                    "key": "s1",
                    "title": "¡Buuum!",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Realiza hasta 3 ataques explosivos que infligen Daño Pyro.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Consume una cierta cantidad de Aguante para infligir Daño Pyro en el AdE después de un corto tiempo de lanzamiento.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": "Al acumular poder Pyro, Klee se lanza hacia el suelo desde el aire, dañando a todos los enemigos en su camino. A su vez, inflige Daño Pyro en el AdE.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Bomba saltarina",
                    "description": "¡La Bomba saltarina es un montón de diversión!\nArroja una Bomba saltarina poderosa que puede rebotar hasta tres veces. Cada vez que rebota genera una explosión con Daño Pyro en el AdE.\nDespués de rebotar tres veces, se dividirá en varias Trampas cazabobos. Al tocar al enemigo, las ráfagas explotarán, causando Daño Pyro en el AdE.\nPuede ser usado 2 veces consecutivas.",
                    "abilities": []
                },
                {
                    "key": "s3",
                    "title": "Chispas explosivas",
                    "description": "¡Klee a la carga! Mientras dure la Habilidad, no para de invocar Chispas explosivas que hacen daño a los enemigos cercanos, infligiendo Daño Pyro en el AdE.",
                    "abilities": []
                }
            ],
            "passives": [
                {
                    "key": "p1",
                    "title": "Todos mis tesoros",
                    "description": "Muestra la ubicación de las especialidades de Mondstadt cercanas en el Mini-mapa.",
                    "descriptions": []
                },
                {
                    "key": "p2",
                    "title": "Regalo explosivo",
                    "description": "Cuando Bomba saltarina inflige daño junto con un ATQ Normal, hay un 50% de posibilidades de que Klee obtenga una Flor explosiva. El siguiente ATQ Cargado consumirá esta Flor explosiva sin consumir Aguante. El daño infligido aumentará en un 50%.",
                    "descriptions": []
                },
                {
                    "key": "p3",
                    "title": "Estallido incesante",
                    "description": "Después de asestar un golpe CRIT. con el Ataque Cargado, todos los miembros del equipo reciben 2 pts. de Energía Elemental.",
                    "descriptions": []
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "Explosión en cadena",
                    "description": "Al atacar o usar una habilidad, hay una probabilidad de invocar chispas que atacan al enemigo, las cuales infligen Daño equivalente a 120% del Daño de Chispas explosivas.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c2",
                    "title": "Fragmentos de metralla",
                    "description": "Las trampas cazabobos de Bomba saltarina reducen la DEF de los enemigos en 23% por 10 s.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c3",
                    "title": "Mezcla especial de Klee",
                    "description": "Aumenta el nivel de habilidad de Bomba saltarina +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "¡Bomba va!",
                    "description": "Si el personaje se retira mientras la habilidad Chispas explosivas está activa, creará una explosión que inflige 555% de Daño Pyro de Área.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "Estrella de los bombardeos",
                    "description": "Aumenta el nivel de habilidad de Chispas explosivas +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "¡A la carga!",
                    "description": "Mientras las Chispas explosivas estén activas, los miembros del equipo recuperarán energía elemental; después de activar Chispas explosivas, y por 25 s todos los miembros del equipo reciben 10% de Bono de Daño Pyro.",
                    "secondDescription": null,
                    "descriptions": []
                }
            ]
        },
        {
            "key": "Lisa",
            "name": "Lisa",
            "description": "La perezosa pero sabia bibliotecaria de los Caballeros de Favonius. En realidad, fue considerada por la Academia de Sumeru como su graduada mas sobresaliente en los últimos dos siglos.",
            "skills": [
                {
                    "key": "s1",
                    "title": "Toque de relámpago",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Realiza hasta 4 ataques relámpago que infligen Daño Electro.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Consume una cierta cantidad de Aguante para infligir Daño Electro de Área después de un corto tiempo de lanzamiento.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": "El poder Electro se concentra y desciende hacia el suelo, dañando a todos los enemigos en su camino. A su vez, inflige Daño de Área Electro.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Arco violeta",
                    "description": "Canaliza el poder del rayo para eliminar las cosas molestas.",
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Lanza un Orbe del rayo con destino a la Tierra. En el momento del impacto, inflige Daño Electro y acumula una pila de estado conductor (Máx. 3 pilas) a los enemigos en una área pequeña.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Después de un largo tiempo de lanzamiento, llama a la luz de los cielos, infligiendo una gran cantidad de Daño Electro a los enemigos cercanos. Inflige grandes cantidades de daño extra a los enemigos basado en el número de pilas conductoras acumuladas sobre ellos, y elimina el efecto de Conductor.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s3",
                    "title": "Rayo de la rosa",
                    "description": "Invoca una Rosa devastadora que libera un inmenso poder de relámpago y golpea a los oponentes cercanos mientras inflige Daño Electro. Durante su efecto, Rosa devastadora chispea periódicamente relámpagos para atacar a los oponentes cercanos infligiendo Daño Electro.",
                    "abilities": []
                }
            ],
            "passives": [
                {
                    "key": "p1",
                    "title": "Conocimientos farmacéuticos",
                    "description": "Al fabricar una Poción, hay un 20% de probabilidad de recuperar los materiales usados.",
                    "descriptions": []
                },
                {
                    "key": "p2",
                    "title": "Réplica eléctrica",
                    "description": "Al hacer un ATQ cargado, Arco violeta aplica Conductor sobre los enemigos.",
                    "descriptions": []
                },
                {
                    "key": "p3",
                    "title": "Campo de electricidad estática",
                    "description": "Rayo de la rosa reduce la DEF del enemigo en un 15% durante 10 s",
                    "descriptions": []
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "Circuito Infinito",
                    "description": "Al mantener pulsado Arco violeta, Lisa recupera 2 puntos de Energía por cada enemigo golpeado. Se puede regenerar un máximo de 10 pts. de energía de esta manera a la vez.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c2",
                    "title": "Campo Electromagnético",
                    "description": "Al mantener pulsado, Arco violeta tiene los siguiente efectos:",
                    "secondDescription": null,
                    "descriptions": [
                        "Aumenta la DEF en 25%.",
                        "Aumenta la RES a interrupción de Lisa."
                    ]
                },
                {
                    "key": "c3",
                    "title": "Trueno Resonante",
                    "description": "Aumenta el nivel de habilidad de Rayo de la rosa +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "Erupción de Plasma",
                    "description": "Aumenta el número de rayos lanzados por Rayo de la rosa de 1 a 3.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "Electrocución",
                    "description": "Aumenta el nivel de habilidad de Arco violeta +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "Bruja Palpitante",
                    "description": "Al cambiar a Lisa, los enemigos cercanos acumulan 3 cargas de Conductor de Arco violeta. El efecto ocurre una vez cada 5 s.",
                    "secondDescription": null,
                    "descriptions": []
                }
            ]
        },
        {
            "key": "Mona",
            "name": "Mona",
            "description": "Una misteriosa y joven astróloga que se hace llamar \"Astróloga Mona Megistus\". Está convencida de que posee las habilidades para estar a la altura del título. Erudita y orgullosa.",
            "skills": [
                {
                    "key": "s1",
                    "title": "Destino revelado",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Realiza hasta 4 ataques de salpicaduras de agua que infligen Daño Hydro.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Consume una cierta cantidad de Aguante para inflgir Daño Hydro de Área después de un corto lanzamiento.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": "El poder Hydro se concentra y desciende hacia el suelo, dañando a todos los enemigos en su camino. A su vez, inflige Daño de Área Hydro.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Espejismo del agua",
                    "description": "Acumula chorros de agua para crear una Ilusión del Destino.",
                    "abilities": [
                        {
                            "name": "",
                            "description": "La Ilusión tiene las siguientes propiedades especiales:",
                            "descriptions": [
                                "Provoca continuamente a los enemigos cercanos, atrayendo sus ataques.",
                                "Continuamente inflige Daño Hydro a los enemigos cercanos.",
                                "Al terminar su efecto, la Ilusión explota e inflige Daño Hydro en el AdE."
                            ]
                        },
                        {
                            "key": "a2",
                            "description": "Utiliza las corrientes de agua para impulsarse hacia atrás rápidamente antes de conjurar una Ilusión.Solo puede existir una Ilusión creada por Aguas Ilusorias a la vez.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s3",
                    "title": "Órbita divina",
                    "description": "Mona invoca unas olas cristalinas para crear un reflejo del cielo estrellado, aplicando el estado burbuja ilusoria sobre los enemigos en una gran AdE.",
                    "abilities": [
                        {
                            "name": "Burbuja ilusoria",
                            "description": "Invoca una burbuja estrellada que envuelve a sus enemigos, aplicando el efecto Mojado sobre ellos. La burbuja inmoviliza a los enemigos más débiles, los cuales no podran moverse. Cuando un enemigo que está bajo los efectos de la burbuja ilusoria recibe daño, se producen los siguientes efectos:",
                            "descriptions": [
                                "Coloca un presagio sobre el enemigo, lo que otorga un bono de daño y tambien aumenta el daño del ataque que lo causa.",
                                "Elimina la burbuja ilusoria, inflingiendo Daño Hydro adicional."
                            ]
                        },
                        {
                            "name": "Presagio",
                            "description": "Mientras dura la habilidad, aumenta el daño que reciben los enemigos",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s4",
                    "title": "Torrente ilusorio",
                    "description": null,
                    "abilities": [
                        {
                            "name": "Reemplazo de Esprintar",
                            "description": "Cuando está bajo el efecto del Torrente ilusorio, Mona puede moverse a gran velocidad sobre el agua. Aplica el estado de Mojado a los enemigos cercanos cuando reaparece.",
                            "descriptions": []
                        }
                    ]
                }
            ],
            "passives": [
                {
                    "key": "p1",
                    "title": "Principio de astrología",
                    "description": "Al fabricar materiales de ascensión de Arma, hay un 25% de probabilidad de recuperar los materiales usados.",
                    "descriptions": []
                },
                {
                    "key": "p2",
                    "title": "¡Atrápame si puedes!",
                    "description": "Tras haber usado Torrente ilusorio durante 2 s, si hay algún enemigo cerca, Mona creará automáticamente un fantasma. Un fantasma creado de esta manera durará 2 s, y su daño de explosión será igual al 50% del daño de Espejismo del agua.",
                    "descriptions": []
                },
                {
                    "key": "p3",
                    "title": "¡Que el destino decida!",
                    "description": "Incrementa adicionalmente el Bono de Daño Hydro de Mona. Aumenta el equivalente al 20% de su tasa de Recarga de Energía.",
                    "descriptions": []
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "Profecía de sumersión",
                    "description": "Los efectos de reacciones elementales relacionadas con Hydro se mejoran durante 8 s después de que un personaje golpee a un enemigo afectado por Presagio:",
                    "secondDescription": null,
                    "descriptions": [
                        "El Daño por Electrocargado aumenta en un 15%.",
                        "El Daño por Vaporización aumenta en un 15%.",
                        "El Daño por Torbellino Hydro aumenta en un 15%.",
                        "La duración del efecto Congelado en enemigos aumenta en un 15%."
                    ]
                },
                {
                    "key": "c2",
                    "title": "Cadena lunar",
                    "description": "Al golpear con un ATQ normal, hay un 20% de probabilidad de que vaya seguido automáticamente por un Ataque Cargado. Este efecto solo puede ocurrir una vez cada 5 segundos.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c3",
                    "title": "Revolución incesante",
                    "description": "Aumenta el nivel de habilidad de Órbita divina +3. Puede ser aumentada hasta Niv. 15",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "Profecía del fin",
                    "description": "Cuando un personaje ataca a un enemigo afectado por un Presagio, la Prob. CRIT del personaje aumenta en un 15%.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "Burla del destino",
                    "description": "Aumenta el nivel de habilidad de Aguas ilusorias +3. Puede ser aumentada hasta Niv. 15",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "Retórica de la calamidad",
                    "description": "Al ingresar en Torrente Ilusorio, Mona obtiene un aumento del 60% de Daño en su próximo Ataque Cargado por cada segundo que se mueve. Se puede lograr un máximo de 180% de Bono de Daño de esta manera. El efecto dura menos de 8 s.",
                    "secondDescription": null,
                    "descriptions": []
                }
            ]
        },
        {
            "key": "Ningguang",
            "name": "Ninguang",
            "description": "Ninguang es conocida como el \"Equilibrio Celestial\", es miembro de las \"Siete Estrellas de Liyue\". Su riquza es insuperable en todo Teyvat.",
            "skills": [
                {
                    "key": "s1",
                    "title": "Lanzamiento centelleante",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Dispara gemas que infligen Daño Geo. Al golpear, eso le otorga a Ninguang un jade estelar",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Consume una cierta cantidad de Aguante para disparar una gema gigante que inflige Daño Geo. Si Ninguang tiene algún jade estelar, lanzar un Ataque Cargado también disparará el jade estelar contra el enemigo, causando Daño adicional.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": "Al acumular poder Geo, Ninguang se lanza hacia el suelo desde el aire, dañando a todos los enemigos en su camino. Inflige Daño Geo en el AdE en el momento del impacto.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Pantalla de jade",
                    "description": "Ninguang crea una Pantalla de jade de oro y obsidiana de gran opulencia, infligiendo Daño Geo en el AdE.",
                    "abilities": [
                        {
                            "name": "Pantalla de jade",
                            "description": "La Pantalla de jade se considera una creación Geo y puede ser usada para bloquear ciertos ataques, pero no se puede escalar. Solo puede existir una Pantalla de jade a la vez.",
                            "descriptions": [
                                "Bloquea los proyectiles enemigos.",
                                "La duración de la pantalla es proporcional a la Vida Máx de Ninguang."
                            ]
                        }
                    ]
                },
                {
                    "key": "s3",
                    "title": "Devastaestrellas",
                    "description": "Ninguang reúne piedras preciosas a su alrededor y las destruye a la vez, repartiéndolas entre todos los enemigos cercanos e infligiendo Daño Geo masivo. Si Devastaestrellas se lanza cuando una Pantalla de jade está cerca, la Pantalla de jade disparará proyectiles de gemas adicionales al mismo tiempo.",
                    "abilities": []
                }
            ],
            "passives": [
                {
                    "key": "p1",
                    "title": "Registro de tesoros maravillosos",
                    "description": "Muestra la ubicación de los minerales cercanos en el Mini-mapa (hierro, hierro blanco, cristal, cristal mágico y argento estelar).",
                    "descriptions": []
                },
                {
                    "key": "p2",
                    "title": "Plan B",
                    "description": "Cuando está en posesión de jades estelares, el Ataque Cargado de Ninguang no consume Aguante.",
                    "descriptions": []
                },
                {
                    "key": "p3",
                    "title": "Reserva estratégica",
                    "description": "Los personajes que pasen a través de la Pantalla de jade obtienen un 12% de Bono de Daño Geo por 10 s.",
                    "descriptions": []
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "Fragmentos perforadores",
                    "description": "Los Ataques Normales infligen daño de área.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c2",
                    "title": "Efecto choque",
                    "description": "Al desintegrarse la Pantalla de jade, se elimina el TdE. Solo puede ocurrir una vez cada 6 segundos.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c3",
                    "title": "Su Majestad, el Equilibrio Celestial",
                    "description": "Aumenta el nivel de habilidad de Devastaestrellas +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "Excelente sea el jade, que eclipsa todo a sus pies",
                    "description": "Pantalla de jade aumenta la RES elemental de los personajes cercanos en un 10%.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "Invencible sea la pantalla de jade",
                    "description": "Aumenta el nivel de habilidad de Pantalla de jade +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "Grandiosas sean las Siete Estrellas",
                    "description": "Al lanzar Devastaestrellas, Ninguang obtiene 7 jades estelares.",
                    "secondDescription": null,
                    "descriptions": []
                }
            ]
        },
        {
            "key": "Noelle",
            "name": "Noelle",
            "description": "La criada de confianza de los Caballeros de Favonius, sueña con convertirse algún dia en caballera de la orden.",
            "skills": [
                {
                    "key": "s1",
                    "title": "Técnica de espada Favonius - Criada",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Realiza hasta 4 tajos rápidos.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Sigue consumiendo Aguante para realizar golpes de espada giratorios contra los enemigos cercanos. Al final del Ataque Cargado, realizará un golpe de espada más poderoso.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": "Se lanza desde el aire para golpear el suelo, dañando a los enemigos a lo largo del camino e infligiendo Daño de Área en el momento del impacto.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Guardiana del corazón",
                    "description": "Invoca una armadura de roca la cual inflige Daño Geo en los oponentes alrededor y absorbe el daño. El Daño absorbido aumenta en proporción a la DEF de Noelle.",
                    "abilities": [
                        {
                            "name": "",
                            "description": "El Escudo tiene los siguientes efectos:",
                            "descriptions": [
                                "Cuando los Ataques Normales y Ataques Cargados de Noelle golpean un objetivo, hay una posibilidad de regenerar Vida a todos los miembros del equipo. La cantidad de Vida curada es proporcional a la DEF de Noelle.",
                                "Aplica el elemento Geo al personaje.",
                                "Posee un 250% de eficiencia de absorción contra Daño Geo."
                            ]
                        }
                    ]
                },
                {
                    "key": "s3",
                    "title": "Hora de limpiar",
                    "description": "Al reunir el poder de la roca alrededor de su arma, Noelle golpea a los enemigos que la rodean dentro de un AdE de gran tamaño e inflige Daño Geo.",
                    "abilities": [
                        {
                            "name": "",
                            "description": "Después, Noelle obtiene los siguientes efectos:",
                            "descriptions": [
                                "Ataque con mayor AdE.",
                                "Convierte el Daño de ataque en Daño Geo.",
                                "El incremento del ATQ es proporcional a su DEF."
                            ]
                        }
                    ]
                }
            ],
            "passives": [
                {
                    "key": "p1",
                    "title": "Dedicación de la criada",
                    "description": "Cuando se logra un \"Perfecto\" en un plato con efectos de defensa, hay un 12% de posibilidades de obtener el doble de cantidad del producto.",
                    "descriptions": []
                },
                {
                    "key": "p2",
                    "title": "De todo corazón",
                    "description": "Cuando Noelle está fuera de escena, si la Vida del personaje activo es inferior al 30%, ocurrirán automáticamente los siguientes efectos: El personaje recibirá inmediatamente un escudo que absorbe el daño equivalente al 400% de DEF de Noelle. Este escudo puede durar hasta 20 s y se puede activar una vez cada 60 s.",
                    "descriptions": []
                },
                {
                    "key": "p3",
                    "title": "Pulcra y eficaz",
                    "description": "Cuando Noelle inflige daño a los enemigos con ATQ Normal o Cargado, el TdE de Guardiana del corazón se reducirá 1 s cada 4 golpes. Infligir daño a varios enemigos al mismo tiempo se considera un solo movimiento de ataque.",
                    "descriptions": []
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "Yo te cubro",
                    "description": "Al atacar estando en los estados de Hora de limpiar y Guardiana del corazón, el efecto de restauración de Vida de Guardiana del corazón será del 100%.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c2",
                    "title": "Torbellino de la criada",
                    "description": "Reduce el coste de Aguante del ATQ Cargado de Noelle un 20%, aumentando el daño infligido un 15%.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c3",
                    "title": "Sin un rasguño",
                    "description": "Aumenta el nivel de habilidad de Guardiana del corazón +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "Limpieza obligada",
                    "description": "Cuando Guardiana del corazón termina o se rompe debido al daño, inflige un 400% de Daño Geo a los enemigos cercanos.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "Experta en limpieza",
                    "description": "Aumenta el nivel de habilidad de Hora de limpiar +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "Debe quedar impoluto",
                    "description": "Hora de limpiar aumenta la DEF de Noelle un 50%; Además, durante la duración de la habilidad, la duración se extendrá en 1 s por cada enemigo noqueado (máx. 10 s).",
                    "secondDescription": null,
                    "descriptions": []
                }
            ]
        },
        {
            "key": "Qiqi",
            "name": "Qiqi",
            "description": "Una aprendiz y recolectora de hierbas en la Farmacia Bubu. Una zombi con una tez blanca como el hueso, de pocas palabras y emociones.",
            "skills": [
                {
                    "key": "s1",
                    "title": "Técnica de espada antigua",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Realiza hasta 5 ataques rápidos.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Consume cierta cantidad de Aguante para lanzarse al frente, infligiendo daño a los enemigos en el camino.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": "Se lanza desde el aire para golpear el suelo, dañando a los enemigos a lo largo del camino e infligiendo Daño de Área en el momento del impacto.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Magia Adeptus: Heraldo de la escarcha",
                    "description": "Usando el Talismán de sangre helada, Qiqi invoca al Heraldo de la escarcha, infligiendo Daño Cryo a todos los enemigos cercanos.",
                    "abilities": [
                        {
                            "name": "Heraldo de la escarcha",
                            "description": "",
                            "descriptions": [
                                "Cuando Qiqi golpea a un objetivo con sus Ataques Normales o Cargados, regenera Vida para todos los miembros del equipo y todos los personajes aliados cercanos. La cantidad de Vida regenerada dependerá del ATQ de Qiqi.",
                                "Regenera una cierta cantidad de Vida del personaje actual a intervalos regulares.",
                                "Sigue al personaje actual para infligir Daño Cryo a todos los enemigos que se encuentre a su paso."
                            ]
                        }
                    ]
                },
                {
                    "key": "s3",
                    "title": "Magia Adeptus: Preservadora de la fortuna",
                    "description": "Qiqi libera el poder Adeptus sellado dentro de su cuerpo, marcando a los enemigos cercanos con un Talismán de conservación de la fortuna que inflige Daño Cryo.",
                    "abilities": [
                        {
                            "name": " Talismán de conservación de la fortuna",
                            "description": "Cuando los enemigos marcados con el Talismán reciben Daño, el personaje que infligió el daño regenera Vida.",
                            "descriptions": []
                        }
                    ]
                }
            ],
            "passives": [
                {
                    "key": "p1",
                    "title": "Recuerdos de una vida pasada",
                    "description": "Muestra la ubicación de las especialidades de Liyue cercanas en el Mini-mapa.",
                    "descriptions": []
                },
                {
                    "key": "p2",
                    "title": "Elixir de vida",
                    "description": "Cuando un personaje bajo el efecto de Arte de Adeptus: Heraldo de la escarcha activa una Reacción Elemental, aumenta su Bono de Curación recibida en un 20% durante 8 s.",
                    "descriptions": []
                },
                {
                    "key": "p3",
                    "title": "Un vistazo al arcano",
                    "description": "Cuando Qiqi golpea a enemigos con Ataque Normal o Ataque Cargado, tiene un 50% de posibilidad de ponerles un Talismán de conservación de la fortuna durante 6 s. Este efecto solo puede activarse una vez cada 30 s.",
                    "descriptions": []
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "Ascetismo de la escarcha",
                    "description": "Qiqi regenera 2 pts. de Energía cuando el Heraldo de la escarcha golpea a un enemigo marcado por un Talismán de conservación de la fortuna.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c2",
                    "title": "Frío Polar",
                    "description": "El Daño del ATQ Normal y Cargado de Qiqi aumentan en un 15% contra enemigos afectados por Cryo.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c3",
                    "title": "Mandato celestial",
                    "description": "Aumenta el nivel de habilidad de Arte de Adeptus: Preservadora de la fortuna +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "Supresión Divina",
                    "description": "Reduce en un 20% el ATQ de los objetivos marcados por el talismán de conservación de la fortuna.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "Flor de Loto Carmesí",
                    "description": "Aumenta el nivel de habilidad de Arte de Adeptus: Heraldo de la escarcha +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "Rito de la resurrección",
                    "description": "Al lanzar la habilidad de Arte de Adeptus: Preservadora de la fortuna, revive a todos los personajes derrotados y regenera un 50% de Vida. Solo puede ocurrir una vez cada 15 min.",
                    "secondDescription": null,
                    "descriptions": []
                }
            ]
        },
        {
            "key": "Razor",
            "name": "Razor",
            "description": "Un niño que vive entre los lobos en el Reino de los Lobos de Mondstadt, lejos de la civilización. Es ágil como un relámpago.",
            "skills": [
                {
                    "key": "s1",
                    "title": "Colmillo de acero",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Realiza hasta 4 tajos rápidos.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Sigue consumiendo Aguante para realizar golpes de espada giratorios contra los enemigos cercanos. Al final del Ataque Cargado, realizará un golpe de espada más poderoso.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": "Se lanza desde el aire para golpear el suelo, dañando a los enemigos a lo largo del camino e infligiendo Daño de Área en el momento del impacto.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Garra y trueno",
                    "description": "Caza su presa usando las técnicas que le enseñó su maestro y su Lupical.",
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Mueve la Garra del lobo del trueno, infligiendo Daño Electro a los enemigos frente a Razor. Al golpear a un enemigo, Razor ganará una Insignia Electro, que aumentará su Recarga de Energía. Razor puede tener hasta 3 Insignias Electro simultáneamente. Ganar una nueva Insignia Electro refrescará su duración.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Reúne energía eléctrica para desatar una tormenta de rayos sobre una pequeña área, infligiendo una gran cantidad de Daño Electro, y elimina todas las Insignias Electro de Razor. Cada Insignia Electro eliminada de esta manera se convertirá en Energía Elemental de Razor.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s3",
                    "title": "Colmillo de relámpago",
                    "description": "Invoca al Lobo interior, infligiendo Daño Electro a todos los oponentes cercanos. Esto elimina todas las Insignias Electro de Razor, que se convertirán en energía elemental. El Lobo interior luchará junto a Razor mientras dure la habilidad.",
                    "abilities": [
                        {
                            "name": "Lobo interior",
                            "description": "Estos efectos terminan cuando Razor abandona el campo de batalla. Al hacerlo, obtendrá de vuelta 10 pts. de Energía de acuerdo con la duración restante de la habilidad.",
                            "descriptions": [
                                "Golpea junto con los Ataques Normales de Razor, infligiendo Daño Electro.",
                                "Aumenta la Vel. ATQ de Razor y su RES Electro.",
                                "Hace que Razor sea inmune al Daño infligido por el estado Electrocargado.",
                                "Desactiva los ataques cargados de Razor.",
                                "Aumenta la RES a interrupción de Razor."
                            ]
                        }
                    ]
                }
            ],
            "passives": [
                {
                    "key": "p1",
                    "title": "Velocidad de lobo",
                    "description": "Disminuye el consumo de Aguante de todos los miembros del equipo al esprintar en un 20%.",
                    "descriptions": []
                },
                {
                    "key": "p2",
                    "title": "Despertar",
                    "description": "Reduce el TdE en Garra y trueno un 18%. Al lanzar Colmillo de relámpago reiniciará automáticamente el TdE de Garra y trueno.",
                    "descriptions": []
                },
                {
                    "key": "p3",
                    "title": "Hambre",
                    "description": "Cuando la Energía Elemental de Razor es inferior al 50%, la Recarga de Energía aumenta un 30%.",
                    "descriptions": []
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "Naturaleza del Lobo",
                    "description": "Recoger un Orbe o Partícula Elemental incrementa el daño de Razor un 10% durante 8 segundos.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c2",
                    "title": "Supresión",
                    "description": "Incrementa la tasa crítica contra enemigos con menos del 30% de su PS en un 10%.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c3",
                    "title": "Compañía del Alma",
                    "description": "Incrementa el nivel de Colmillo de relámpago por 3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "Mordisco",
                    "description": "Al invocar Garra y trueno, los enemigos golpeados verán su defensa disminuida un 15% durante 7 segundos.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "Garras afiladas",
                    "description": "Incrementa el nivel de Garra y trueno por 3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "Lupus Fulguris",
                    "description": "Cada 10 segundos, el ataque de espada de Razor se carga, causando que el siguiente ataque normal libere un relámpago que inflige 100% del ataque de Razor como daño Electro. Cuando Razor no está usando Colmillo de relámpago, un golpe de rayo sobre un enemigo hará que Razor gane Sigilo Electro para Garra y trueno.",
                    "secondDescription": null,
                    "descriptions": []
                }
            ]
        },
        {
            "key": "Rosaria",
            "name": "Rosaria",
            "description": "A nun who, outside of her garb, seems nothing at all like a person of the cloth. Known for her sharp, cold words and manner, she often works alone.",
            "skills": [
                {
                    "key": "s1",
                    "title": "Spear of Worship",
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Performs up to five consecutive spear strikes.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Consumes a certain amount of Stamina to lunge forward, dealing damage to opponents along the way.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": "Plunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Ravaging Confession",
                    "description": "Rosaria swiftly shifts her position to appear behind her opponent, then stabs and slashes them with her polearm, dealing Cyro DMG.\nThis ability cannot be used to travel behind opponents of a larger build.",
                    "abilities": []
                },
                {
                    "key": "s3",
                    "title": "Rites of Termination",
                    "description": "Rosaria's unique take on this prayer ritual: First, she swings her weapon to slash surrounding opponents; then, she summons a frigid Ice Lance that strikes the ground. Both actions deal Cryo DMG.\nWhile active, the Ice Lance periodically releases a blast of cold air, dealing Cryo DMG to surrounding opponents.",
                    "abilities": []
                }
            ],
            "passives": [
                {
                    "key": "p1",
                    "title": "Night Walk",
                    "description": "At night (18:00–6:00), increases the Movement SPD of your own party members by 10%.\nDoes not take effect in Domains, Trounce Domains, or Spiral Abyss. Not stackable with Passive Talents that provide the exact same effects.",
                    "descriptions": []
                },
                {
                    "key": "p2",
                    "title": "Extracted Confession",
                    "description": "When Rosaria strikes an opponent from behind using Ravaging Confession, Rosaria's CRIT Rate increases by 12% for 5s.",
                    "descriptions": []
                },
                {
                    "key": "p3",
                    "title": "Shadow Samaritan",
                    "description": "Casting Rites of Termination increases CRIT Rate of all nearby party members (except Rosaria herself) by 15% of Rosaria's CRIT Rate for 10s.\nCRIT Rate Bonus gained this way cannot exceed 15%.",
                    "descriptions": []
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "Unholy Revelation",
                    "description": "When Rosaria deals a CRIT Hit, her ATK SPD increases by 10% and her Normal Attack DMG increases by 10% for 4s.",
                    "descriptions": []
                },
                {
                    "key": "c2",
                    "title": "Land Without Promise",
                    "description": "The duration of the Ice Lance created by Rites of Termination is increased by 4s.",
                    "descriptions": []
                },
                {
                    "key": "c3",
                    "title": "Sacrament of Penance",
                    "description": "Increases the Level of Ravaging Confessionby 3. Maximum upgrade level is 15.",
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "Amazing Disgrace",
                    "description": "Ravaging Confession's Crit Hits regenerate 5 Energy for Rosaria. Can only be triggered once each time Ravaging Confession is cast.",
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "Extreme Unction",
                    "description": "Increases the Level of Rites of Termination by 3. Maximum upgrade level is 15.",
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "Divine Retribution",
                    "description": "Rites of Termination' attack decreases opponents' Physical RES by 20% for 10s.",
                    "descriptions": []
                }
            ]
        },
        {
            "key": "Sucrose",
            "name": "Sacarosa",
            "description": "Una alquimista e investigadora de la escuela de bioalquimia que siente curiosidad por todo.",
            "skills": [
                {
                    "key": "s1",
                    "title": "Creación del Espíritu del Viento",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Realiza hasta 4 ataques usando Espíritus del Viento, que infligen Daño Anemo.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Consume una cierta cantidad de Aguante e inflige Daño Anemo en el AdE después de un corto tiempo de lanzamiento.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": "Al llamar a los Espíritus del Viento, Sacarosa se lanza hacia el suelo desde el aire, dañando a todos los enemigos en su camino. Inflige Daño Anemo en el AdE al impactar con el suelo.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Creación del espíritu del viento: Experimento 6308",
                    "description": "Invoca un pequeño Espíritu del Viento que inflige Daño Anemo a los enemigos en un AdE, arrastrándolos hacia la ubicación del Espíritu del Viento antes de lanzarlos por los aires.",
                    "abilities": []
                },
                {
                    "key": "s3",
                    "title": "Creación del espíritu del viento prohibida: Isomorfo 75 tipo II",
                    "description": "Sacarosa arroja un brebaje inestable que crea un Gran Espíritu del Viento. Durante la habilidad, el Gran Espíritu del Viento atrae y arroja a los enemigos cercanos, infligiendo Daño Anemo en el AdE",
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Si el espíritu del Viento entra en contacto con Hydro/Pyro/Cryo/Electro, infligirá Daño elemental adicional de ese tipo. El cambio elemental solo puede ocurrir una vez por uso.",
                            "descriptions": []
                        }
                    ]
                }
            ],
            "passives": [
                {
                    "key": "p1",
                    "title": "Invención inestable",
                    "description": "Al crear materiales para personaje y armas, hay un 10% de probabilidad de recibir el doble",
                    "descriptions": []
                },
                {
                    "key": "p2",
                    "title": "Conversión de catalizador",
                    "description": "Cuando Sacarosa active un Torbellino, aumentará la Maestría Elemental de todos los miembros del equipo con el elemento correspondiente en 50 pts. por los próximos 8 s.",
                    "descriptions": []
                },
                {
                    "key": "p3",
                    "title": "Mollis Favonius",
                    "description": "Cuando Creación del espíritu del viento: Experimento 6308 o Creación del espíritu del viento prohibida: Isomorfo 75 tipo II golpee a un enemigo, aumenta la Maestría Elemental de otros miembros del equipo con base en el 20% de Maestría Elemental de Sacarosa durante 8 s.",
                    "descriptions": []
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "Cúmulo de campo de vacío",
                    "description": "Aumenta las cargas de Creación del espíritu del viento: Experimento 6308 en 1.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c2",
                    "title": "Bett - Forma no consolidada",
                    "description": "Aumenta en 2 s la duración de Creación del espíritu del viento prohibida: Isomorfo 75 tipo II.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c3",
                    "title": "Alquimista infalible",
                    "description": "Aumenta el nivel de habilidad de Creación del espíritu del viento: Experimento 6308 +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "Alquemanía",
                    "description": "Por cada 7 Ataques Normales y Cargados de Sacarosa, el TdE de Creación del espíritu del viento: Experimento 6308 se reduce de 1 a 7 s.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "Precaución: frasco ordinario",
                    "description": "Aumenta el nivel de habilidad de Creación del espíritu del viento prohibida: Isomorfo 75 tipo II +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "Entropía caótica",
                    "description": "Si Creación del espíritu del viento prohibida: Isomorfo 75 tipo II desencadena un cambio elemental, todos los miembros del equipo obtienen un 20% de Bono de Daño Elemental del elemento absorbido correspondiente mientras dure la habilidad.",
                    "secondDescription": null,
                    "descriptions": []
                }
            ]
        },
        {
            "key": "Tartaglia",
            "name": "Tartaglia",
            "description": "El undécimo de los Once, llamado \"Nobile\". Famoso por ganar miles de peleas.",
            "skills": [
                {
                    "key": "s1",
                    "title": "Torrente cortante",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": " Realiza hasta 6 disparos consecutivos con arco.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Realiza un ataque más preciso, infligiendo más daño con Disparo Preciso. Mientras se apunta, el poder de Hydro se acumulará en la punta de la flecha. Una flecha totalmente cargada con un torrente infligirá Daño Hydro al golpear, y aplicará el estado de Obstrucción del flujo.",
                            "descriptions": []
                        },
                        {
                            "name": "Obstrucción del flujo",
                            "description": "Inflige Daño Hydro en el AdE cuando Tartaglia ataca a un objetivo afectado por Obstrucción del flujo. El daño infligido por este estado se considera daño de Ataque Normal.",
                            "descriptions": [
                                "Obstrucción del flujo Destello: cuando se dispara un Disparo Preciso totalmente cargado contra un enemigo bajo los efectos de Obstrucción del flujo, inflige daño continuo en el AdE. La Obstrucción del flujo: Destello solo podrá activarse una vez cada 0.7 s.",
                                "Obstrucción del flujo Explosión: al derrotar a un enemigo bajo los efectos de Obstrucción del flujo, se provocará una explosión Hydro que aplicará dicho efecto sobre los enemigos cercanos."
                            ]
                        },
                        {
                            "key": "a4",
                            "description": "Desciende rápidamente desde el aire y dispara una lluvia de flechas, infligiendo Daño en el AdE al impactar contra el suelo. No es posible activar el Ataque descendiente cuando Tartaglia se encuentra en posición de combate cuerpo a cuerpo de Legado del mal: Olas furiosas.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Legado del mal: Olas furiosas",
                    "description": "Lanza un arsenal hecho de agua pura que inflige Daño Hydro a los enemigos cercanos y entra en posición de combate cuerpo a cuerpo.\nEn esta posición, los ataques Normales y Cargados de Tartaglia se convierten en Daño Hydro, el cual no puede ser sustituido imbuyéndolo de otro elemento, y cambian de la siguiente forma:",
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Realiza hasta 6 tajos Hydro consecutivos.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Al consumir una cierta cantidad de Aguante, lanza un golpe de espada cruzado que inflige Daño Hydro.",
                            "descriptions": []
                        },
                        {
                            "name": "Obstrucción del flujo: Corte",
                            "description": "Al golpear con un ataque cuerpo a cuerpo a un enemigo bajo los efectos de Obstrucción del flujo, Tartaglia realiza Obstrucción del flujo: Corte, infligiendo Daño Hydro en el AdE. Este daño es considerado como daño de Habilidad Elemental, y solo se puede activar una vez cada 1.5 s.\nDespués de 30 s, o una vez que los efectos de la habilidad se hayan disipado tras lanzarla, Tartaglia regresa a su posición de combate a distancia, y esta habilidad entra en TdE. Cuanto más tiempo permanezca Tartaglia en su posición de combate cuerpo a cuerpo, más durará el TdE.\nSi el retorno a la posición de combate a distancia se produce automáticamente después de 30 s, el TdE será aún más largo.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s3",
                    "title": "Caos: Obliteración",
                    "description": "Realiza diferentes ataques dependiendo de la posición de Tartaglia.",
                    "abilities": [
                        {
                            "name": "Combate a distancia: Flecha del caos",
                            "description": "Dispara rápidamente una flecha mágica Hydro, infligiendo Daño Hydro en el AdE y aplicando el estado de Obstrucción del flujo. Tras lanzar la habilidad, devuelve una parte de su costo de Energía Elemental.",
                            "descriptions": []
                        },
                        {
                            "name": "Combate cuerpo a cuerpo: Luz de obliteración",
                            "description": "Realiza un corte con una gran AdE, infligiendo una gran cantidad de Daño Hydro a todos los enemigos cercanos y provocando Obstrucción del flujo Estallido.",
                            "descriptions": []
                        },
                        {
                            "name": "Obstrucción del flujo: Estallido",
                            "description": "Al atacar con Luz de obliteración a un enemigo afectado por Obstrucción del flujo, consumirá dicho efecto y creará una hidroexplosión, infligiendo Daño Hydro en el AdE.",
                            "descriptions": []
                        }
                    ]
                }
            ],
            "passives": [
                {
                    "key": "p1",
                    "title": "Maestro de armas",
                    "description": "Aumenta en 1 el nivel del ATQ normal de todos los miembros de tu equipo.",
                    "descriptions": []
                },
                {
                    "key": "p2",
                    "title": "Infinito sinfín",
                    "description": "Aumenta en 8 s la duración de Obstrucción del flujo.",
                    "descriptions": []
                },
                {
                    "key": "p3",
                    "title": "Espada hidromorfa",
                    "description": "Cuando Tartaglia está en la posición de combate cuerpo a cuerpo de Legado del mal: Olas furiosas, si los Ataques Normales o Cargados hacen Daño CRIT, el enemigo golpeado será afectado por Obstrucción del flujo.",
                    "descriptions": []
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "Legado del mal: Retención de la marea",
                    "description": "El TdE de Legado del mal: Olas furiosas se reduce un 20%.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c2",
                    "title": "Legado del mal: Transfondo",
                    "description": "Cuando los enemigos afectados por Obstrucción del flujo son derrotados, Tartaglia restaura 4 pts. de Energía Elemental.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c3",
                    "title": "Calamidad del Abismo: Fuente del conflicto",
                    "description": "Aumenta el nivel de habilidad de Legado del mal: Olas furiosas + 3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "Calamidad del Abismo: Hidrocontención",
                    "description": "Si Tartaglia está en la posición de combate cuerpo a cuerpo de Legado del mal: Olas furiosas, realizará Obstrucción del flujo: Corte cada 4 s contra los enemigos afectados por Obstrucción del flujo. Si está en posición de combate a distancia, en su lugar, realizará Obstrucción del flujo: Destello. La Obstrucción del flujo Corte y Obstrucción del flujo: Destello desencadenadas mediante el efecto de esta constelación no están sujetas a los intervalos de tiempo que se les aplicaría normalmente, ni tampoco afectarán a los tiempos de dichas habilidades.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "Caos: Corte líquido",
                    "description": "Aumenta el nivel de habilidad de Caos: Obliteración +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "Caos: Extinción del ánge",
                    "description": "En combate cuerpo a cuerpo, al lanzar Caos: Obliteración, el TdE de Legado del Mal: Olas furiosas termina inmediatamente. El efecto tiene lugar una vez que Tartaglia vuelve a la posición de combate a distancia.",
                    "secondDescription": null,
                    "descriptions": []
                }
            ]
        },
        {
            "key": "Traveler (Anemo)",
            "name": "Traveler (Anemo)",
            "description": "Una viajera de otro mundo a quien arrebataron a su único familiar, y que se vio obligada a embarcarse en un viaje en busca de los Siete.",
            "skills": [
                {
                    "key": "s1",
                    "title": "Viento metálico extranjero",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Realiza hasta 5 ataques rápidos.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Consume una cierta cantidad de Aguante para lanzar un golpe de espada cruzado.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": "Se lanza desde el aire para golpear el suelo, dañando a los enemigos a lo largo del camino e infligiendo Daño de Área en el momento del impacto.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Espada de vórtice",
                    "description": "Toma el poder del viento para formar un vórtice de vacio en la palma de la mano, infligiendo Daño Anemo continuo a los enemigos que haya enfrente.\nEl vórtice de vacio explota cuando termina la duración de la habilidad, infligiendo aún más cantidad de Daño Anemo en un área más grande.",
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "El Daño y el AdE aumentarán progresivamente.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Si el vórtice de vacio entra en contacto con Hydro/Pyro/Cryo/Electro, infligirá un bono de Daño Elemental adicional de ese tipo. El cambio elemental solo puede ocurrir una vez durante la habilidad.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s3",
                    "title": "Oleada de ráfagas",
                    "description": "Guía al viento para invocar un tornado que avanza y atrae a los objetos y oponentes hacia ella, infligiendo Daño Anemo continuo",
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Si el tornado entra en contacto con Hydro/Pyro/Cryo/Electro, infligirá un bono de Daño Elemental adicional de ese tipo. El cambio elemental solo puede ocurrir una vez durante la habilidad.",
                            "descriptions": []
                        }
                    ]
                }
            ],
            "passives": [
                {
                    "key": "p2",
                    "title": "Viento del cielo quebrado",
                    "description": "Después del último golpe de Ataque Normal, se lanzará una hoja afilada de viento, causando un 60% de Daño Anemo a los enemigos que estén alrededor.",
                    "descriptions": []
                },
                {
                    "key": "p3",
                    "title": "Viento de la resurrección",
                    "description": "Después de derrotar al enemigo, Espada de vórtice regenera un 2% de Vida cada 5 s. Solo puede ocurrir una vez cada 5 s.",
                    "descriptions": []
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "Torbellino furioso",
                    "description": "Espada de vórtice atrae a los enemigos en un radio de 5 m.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c2",
                    "title": "Torbellino ascendiente",
                    "description": "Recarga de energía + 16%.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c3",
                    "title": "Torbellino arrebatador",
                    "description": "Aumenta el nivel de habilidad de Oleada de ráfagas +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "Brisa protectora",
                    "description": "Mientras Espada de vórtice, esté activa, el daño entrante se reduce en 10%.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "Vórtice Stellaris",
                    "description": "Aumenta el nivel de habilidad de Espada de vórtice +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "Vientos entrelazados",
                    "description": "El objetivo que reciba daño de Oleada de ráfagas reduce su RES Anemo en 20%. Si ocurre un cambio elemental, la RES elemental del nuevo atributo se reducirá en un 20%.",
                    "secondDescription": null,
                    "descriptions": []
                }
            ]
        },
        {
            "key": "Traveler (Geo)",
            "name": "Traveler (Geo)",
            "description": "Una viajero de otro mundo a quien arrebataron a su único familiar, y que se vio obligada a embarcarse en un viaje en busca de los Siete.",
            "skills": [
                {
                    "key": "s1",
                    "title": "Espada de piedra extranjera",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Realiza hasta 5 ataques rápidos.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Consume una cierta cantidad de Aguante para lanzar un golpe de espada cruzado.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": "Se lanza desde el aire para golpear el suelo, dañando a los enemigos a lo largo del camino e infligiendo Daño de Área en el momento del impacto.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Espada estrellacaída",
                    "description": "Toma un meteorito de las profundidades de la tierra, infligiendo Daño Geo de Área. El meteorito es considerado un objeto Geo, puede ser escalado o usado para bloquear ataques.",
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Puede ajustar la posición de efecto de esta habilidad.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s3",
                    "title": "Despertar de la Tierra",
                    "description": "Inflige Daño Geo de Área a todos los enemigos a los que alcanza. Tras ello, crea una columna de piedra que se levanta abruptamente en el límite de la onda. La columna de piedra se considera un objeto Geo, por lo que puede escalarse o usarse para bloquear ataques.",
                    "abilities": []
                }
            ],
            "passives": [
                {
                    "key": "p2",
                    "title": "Roca quebrada",
                    "description": "Disminuye el TdE de Espada estrellacaída -2 s.",
                    "descriptions": []
                },
                {
                    "key": "p3",
                    "title": "Roca turbulenta",
                    "description": "El último golpe del Ataque Normal provoca una destrucción, infligiendo un 60% de Daño Geo a los enemigos dentro del área.",
                    "descriptions": []
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "Muro inquebrantable",
                    "description": "Aumenta la Prob. CRIT de todos los aliados dentro del radio de Despertar de la Tierra en 10%, y aumenta su RES a interrupción.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c2",
                    "title": "Fusión de lava",
                    "description": "El meteorito de Espada estrellacaída explota de nuevo cuando es destruido, causando Daño Geo de Área adicional equivalente al daño de Espada estrellacaída.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c3",
                    "title": "Voluntad pétrea",
                    "description": "Aumenta el nivel de habilidad de Despertar de la Tierra +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "Fuerza de reacción",
                    "description": "Al golpear al enemigo con una onda expansiva de Despertar de la Tierra, recuperas 5 de Energía. Puedes recuperar hasta 25 puntos de energía de esta forma.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "Impacto meteórico",
                    "description": "Aumenta el nivel de habilidad de Espada estrellacaída +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "Bloque eterno",
                    "description": "Extiende la duración del muro de piedra de Despertar de la Tierra en 5s.; Extiende la duración del meteorito de Espada estrellacaída en 10 s.",
                    "secondDescription": null,
                    "descriptions": []
                }
            ]
        },
        {
            "key": "Venti",
            "name": "Venti",
            "description": "Uno de los muchos bardos de Mondstadt que deambula libremente por las calles y callejones de la ciudad.",
            "skills": [
                {
                    "key": "s1",
                    "title": "Puntería divina",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Realiza hasta 6 disparos consecutivos con arco.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Dispara un Tiro preciso que inflige mayor daño. Al apuntar, se acumularán vientos favorables en la punta de flecha. Una flecha con fuerza del viento totalmente cargada infligirá Daño Anemo.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": "Dispara una lluvia de flechas desde el aire y desciende rápidamente, causando daño a distancia al impactar en el suelo",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Sonata celestial",
                    "description": "¡Oh viento sobre el que vuelan todos los himnos y cantos, lleva a estos caminantes de la tierra hacia los cielos!",
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Invoca un campo de viento en la ubicación del enemigo, infligiendo Daño Anemo de Área y lanzando a los enemigos por el aire.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Invoca un campo de viento aún más grande con Venti como epicentro, infligiendo Daño Anemo de Área y lanzando a los enemigos afectados al aire. Después de soltar esta habilidad, Venti cabalga el viento en el aire.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s3",
                    "title": "Gran Oda del Viento",
                    "description": "Dispara una flecha hecha de innumerables vientos fusionados, creando un enorme Ojo de la Tormenta que absorbe objetos y enemigos a su paso e inflige Daño Anemo.",
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Si el Ojo de la tormenta entra en contacto con Hydro/Pyro/Cryo/Electro, inflige Daño elemental adicional de ese tipo. El cambio elemental solo puede ocurrir una vez por uso.",
                            "descriptions": []
                        }
                    ]
                }
            ],
            "passives": [
                {
                    "key": "p1",
                    "title": "Jinete del viento",
                    "description": "Disminuye el consumo de Aguante al planear en un 20%.",
                    "descriptions": []
                },
                {
                    "key": "p2",
                    "title": "Abraza los vientos",
                    "description": "Mantener pulsado la Sonata celestial genera corrientes de viento ascendentes con una duración de 20 s.",
                    "descriptions": []
                },
                {
                    "key": "p3",
                    "title": "Ojo del huracán",
                    "description": "Después de que termine el efecto de Gran Oda del Viento, Venti restaurará 15 puntos de Energía Elemental. Si ocurre un cambio elemental, también restaurará 15 pts. de Energía Elemental a todos los personajes con los elementos correspondientes.",
                    "descriptions": []
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "Vendaval feroz",
                    "description": "Dispara 2 flechas adicionales por cada Tiro preciso, infligiendo cada uno 33% del Daño de la flecha original.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c2",
                    "title": "Brisa de reminiscencia",
                    "description": "Sonata celestial reduce la RES Anemo del enemigo en un 12% durante 10 s. Los enemigos lanzados al aire por Sonata celestial sufren una reducción adicional del 12% de RES Anemo y de RES física.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c3",
                    "title": "Oda a los Mil Vientos",
                    "description": "Aumenta el nivel de habilidad de Gran Oda del Viento +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "Huracán de la libertad",
                    "description": "Venti obtiene un 25% de Bono de Daño Anemo durante 10 s tras recoger un Orbe Elemental o una Partícula Elemental.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "Concierto celestial",
                    "description": "Aumenta el nivel de habilidad de Sonata celestial +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "Tormenta de desafío",
                    "description": "Gran Oda del Viento reduce la RES Anemo del enemigo en un 20%. Si ocurriera un cambio elemental durante Gran Oda del Viento, la RES Elemental del nuevo atributo se reducirá un 20%.",
                    "secondDescription": null,
                    "descriptions": []
                }
            ]
        },
        {
            "key": "Xiangling",
            "name": "Xiangling",
            "description": "Una reconida chef de Liyue. Le aposiona la cocina y sobresale al hacer sus platos calientes y picantes.",
            "skills": [
                {
                    "key": "s1",
                    "title": "Kung-Fu pasta",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Realiza hasta 5 ataques rápidos.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Consume cierta cantidad de Aguante para lanzarse al frente, infligiendo daño a los enemigos en el camino.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": "Se lanza desde el aire para golpear el suelo, dañando a los enemigos a lo largo del camino e infligiendo Daño de Área en el momento del impacto.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Ataque de Guoba",
                    "description": "Invoca al Panda Guoba. Guoba escupe fuego continuamente hacia el enemigo, infligiendo Daño Pyro de Área.",
                    "abilities": []
                },
                {
                    "key": "s3",
                    "title": "Pyronado",
                    "description": "Haciendo muestra de su dominio sobre el fuego y las lanzas, Xiangling provoca un Torbellino de llamas a su alrededor. El torbellino se mueve con el personaje durante su efecto, infligiendo Daño Pyro a todos los enemigos en su camino.",
                    "abilities": []
                }
            ],
            "passives": [
                {
                    "key": "p1",
                    "title": "Chef de cocina",
                    "description": "Cuando se logra un \"Perfecto\" en un plato con efectos de ataque, hay un 12% de posibilidades de obtener el doble de cantidad del producto.",
                    "descriptions": []
                },
                {
                    "key": "p2",
                    "title": "Fuego cruzado",
                    "description": "El alcance del lanzallamas de Guoba aumenta un 20%.",
                    "descriptions": []
                },
                {
                    "key": "p3",
                    "title": "¡Cuidado, que pica!",
                    "description": "Cuando termina el Ataque de guoba, Guoba deja chiles en el lugar donde desaparece. Obtén los chiles para aumentar el ATQ un 10% durante 10 s.",
                    "descriptions": []
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "Crujiente por fuera, tierno por dentro",
                    "description": "Reduce la RES Pyro de los oponentes atacados por Guoba en un 15% durante 6 s.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c2",
                    "title": "Aceite y fuego",
                    "description": "El último golpe del Ataque Normal hace que el enemigo implote durante 2 s. Después de eso, el enemigo explotará, produciendo un 75% de Daño Pyro de Área.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c3",
                    "title": "Que quede bien frito",
                    "description": "Aumenta el nivel de habilidad de Torbellino de llamas +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "A fuego lento",
                    "description": "Aumenta en un 40% el tiempo de duración de Torbellino de llamas.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "Guoba furioso",
                    "description": "Aumenta el nivel de habilidad de Ataque de Guoba +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "Pyronado condensado",
                    "description": "Mientras esté activa la habilidad de Torbellino de llamas, todos los personajes del equipo obtienen un 15% de Bono de Daño Pyro.",
                    "secondDescription": null,
                    "descriptions": []
                }
            ]
        },
        {
            "key": "Xiao",
            "name": "Xiao",
            "description": "Un Yaksha o Adeptus que protege Liyue. También llamado el \"Gran Cazador de Demonios\" o \"Guardian Yaksha\".",
            "skills": [
                {
                    "key": "s1",
                    "title": "Impulso de torbellino",
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Ejecuta hasta 6 ataques rápidos con lanza.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Consume una cierta cantidad de Aguante para atacar alzando su lanza.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": "Se lanza desde el aire para golpear el suelo, dañando a los enemigos cercanos e infligiendo Daño en el AdE en el momento del impacto.\nXiao no recibirá daño al caer con un Ataque Descendente.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Ciclón de viento lemniscático",
                    "description": "Xiao se lanza hacia adelante e inflinge Daño Anemo a todos los enemigos que se crucen en su camino.\nPuede activarse en el aire y empieza con un total de 2 cargas.",
                    "abilities": []
                },
                {
                    "key": "s3",
                    "title": "Azote de todos los males",
                    "description": "Xiao se pone la máscara de Yaksha que aterrorizó tanto a los demonios como a los arcontes hace miles de años",
                    "abilities": [
                        {
                            "description": "Máscara de Yaksha",
                            "descriptions": [
                                "Mejora la capacidad de salto de Xiao.",
                                "Mientras dura la habilidad, aumenta el alcance y el daño de los ataques de Xiao.",
                                "Convierte su daño de ataque en Daño Anemo. Este cambio elemental no puede sustituirse imbuyéndose de otro elemento. Estar en esta forma consume la Vida de Xiao de manera continua.",
                                "Los efectos de esta habilidad terminan cuando Xiao deja el campo."
                            ]
                        }
                    ]
                }
            ],
            "passives": [
                {
                    "key": "p1",
                    "title": "Trascendencia: Desafío a la gravedad",
                    "description": "Disminuye en un 20% el Coste de Aguante al escalar de todos los miembros de tu equipo.\nNo se puede acumular con otros talentos pasivos que tengan los mismos efectos.",
                    "descriptions": []
                },
                {
                    "key": "p2",
                    "title": "Conquista del mal: Domademonios",
                    "description": "Al estar bajo los efectos de Azote de todos los males, el daño infligido por Xiao se incrementa en un 5%. Después, su daño continúa aumentando en un 5% cada 3 s hasta el fin de la habilidad.\nSolo se puede alcanzar un 25% de bono de daño máximo.",
                    "descriptions": []
                },
                {
                    "key": "p3",
                    "title": "Desintegración: Caída celestial",
                    "description": "Usar Ciclón de viento lemniscático aumenta en un 15% el daño infligido por los siguientes Ciclones de viento lemniscático durante 7 s.\nEste efecto puede acumularse un máximo de 3 veces y, cada vez que se obtenga una nueva carga, la duración de este efecto se reiniciará.",
                    "descriptions": []
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "Desintegración: Destructor de mundos",
                    "description": "Aumenta las cargas de Ciclón de viento lemniscático en 1.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c2",
                    "title": "Aniquilación: Flor de Kaleidos",
                    "description": "Cuando Xiao está en tu equipo pero no en combate, su Recarga de Energía aumenta en un 25%.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c3",
                    "title": "Conquista del mal: Deidad de la ira",
                    "description": "Aumenta el nivel de habilidad de Ciclón de viento lemniscático +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "Trascendencia: Fin del sufrimiento",
                    "description": "Cuando la Vida de Xiao cae por debajo del 50%, obtiene un 100% de Bono de DEF.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "Evolución: Origen de la ignorancia",
                    "description": "Aumenta el nivel de habilidad de Azote de todos los males +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "Conquista del mal: Guardián Yaksha",
                    "description": "Mientras Xiao está bajo los efectos de Azote de todos los males, golpear a 2 o más enemigos con Ataque Descendente otorga a Ciclón de viento lemniscático 1 carga adicional y elimina su TdE durante 1 s.",
                    "secondDescription": null,
                    "descriptions": []
                }
            ]
        },
        {
            "key": "Xingqiu",
            "name": "Xingchiu",
            "description": "Un joven con una espada larga al que puede verse frecuentemente en las librerías. Tiene un corazón de oro y anhela la justicia y la igualdad para todos.",
            "skills": [
                {
                    "key": "s1",
                    "title": "Técnica de espada Guhua",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Realiza 5 ataques rápidos.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Consume una cierta cantidad de Aguante para lanzar un golpe de espada cruzado.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": "Se lanza desde el aire para golpear el suelo, dañando a los enemigos a lo largo del camino e infligiendo Daño de Área en el momento del impacto.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Espada Guhua: Lluvia torrencial mortal",
                    "description": "Xingchiu realiza golpes gemelos con su espada, infligiendo Daño Hydro. Al mismo tiempo, esta habilidad crea la cantidad máxima de Espadas de lluvia, que orbitarán alrededor del personaje.\n20% del Bono de Daño Hydro de Xingchiu se convertirá en reducción de Daño adicional para las Espadas de lluvia.\nLa cantidad máxima de reducción de Daño que se puede obtener de esta manera es del 24%.",
                    "abilities": [
                        {
                            "name": "",
                            "description": "Las Espadas de lluvia tienen las siguientes propiedades:",
                            "descriptions": [
                                "Cuando el personaje recibe Daño, una Espada de lluvia se romperá, reduciendo la cantidad de Daño recibido.",
                                "Aumenta la RES a interrupción del personaje."
                            ]
                        }
                    ]
                },
                {
                    "key": "s3",
                    "title": "Espada Guhua: Sable de lluvia",
                    "description": "Activa la Espada arcoíris y lucha con una lluvia de espadas fantasma, a la vez que crea el número máximo de Espadas de lluvia.",
                    "abilities": [
                        {
                            "name": "Espada arcoiris",
                            "description": "Estos efectos se aplican a otros personajes.",
                            "descriptions": [
                                "Los Ataques Normales de tu personaje en uso desencadenarán una lluvia de espadas consecutivas que infligen Daño Hydro",
                                "Durante el efecto de ésta habilidad, se mantendrá en todo momento el máximo numero posible de espadas de lluvia."
                            ]
                        }
                    ]
                }
            ],
            "passives": [
                {
                    "key": "p1",
                    "title": "Destello repentino",
                    "description": "Al fabricar Materiales de talento del personaje, hay un 25% de probabilidad de recuperar los materiales usados.",
                    "descriptions": []
                },
                {
                    "key": "p2",
                    "title": "Secretos del agua",
                    "description": "Cuando Espadas de lluvia se interrumpe o termina su duración, el personaje actual recibe el 6% de la Vida Máx. de Xingchiu.",
                    "descriptions": []
                },
                {
                    "key": "p3",
                    "title": "Cuchillas a cántaros",
                    "description": "Xingchiu recibe un Bono de Daño Hydro de 20%.",
                    "descriptions": []
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "Lluvia sobre mojado",
                    "description": "Máx. de cargas de Espadas de Lluvia +1.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c2",
                    "title": "Arcoíris brillante",
                    "description": "Extiende la duración de Espada Guhua: Sable de lluvia en 3 s y reduce la RES Hydro de los enemigos golpeados por Lluvia de espadas un 15% de manera continua por 4 s.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c3",
                    "title": "Tejedor de versos",
                    "description": "Aumenta el nivel de habilidad de Espada Guhua: Sable de lluvia +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "Pacificador del mal",
                    "description": "A lo largo de la duración de Espada Guhua: Sable de lluvia, el Daño infligido por Espada Guhua: Lluvia torrencial mortal aumenta en un 50%.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "Baile bajo la lluvia",
                    "description": "Aumenta el nivel de habilidad de Espada Guhua: Lluvia torrencial mortal +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "Colección de poesía",
                    "description": "Cada 2 ataques de Espada Guhua: Sable de lluvia, aumentará considerablemente el Daño de Lluvia de espadas. Al ser golpeado, Xingchiu recupera 3 de Energía.",
                    "secondDescription": null,
                    "descriptions": []
                }
            ]
        },
        {
            "key": "Xinyan",
            "name": "Xinyan",
            "description": "La única rockera de Liyue. A través de la música y la pasión de sus canciones, hace una crítica de los prejuicios de la sociedad.",
            "skills": [
                {
                    "key": "s1",
                    "title": "Baile ardiente",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Realiza hasta 4 tajos rápidos.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Sigue consumiendo Aguante para realizar golpes de espada giratorios contra los enemigos cercanos. Al final del Ataque Cargado, realizará un golpe de espada más poderoso.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": "Se lanza desde el aire para golpear el suelo, dañando a los enemigos a lo largo del camino e infligiendo Daño en el AdE en el momento del impacto.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Desenfreno",
                    "description": "Xinyan blande su instrumento, infligiendo Daño Pyro a los enemigos cercanos y formando un escudo hecho con el entusiasmo de su audiencia.",
                    "abilities": [
                        {
                            "name": "",
                            "description": "La absorción de daño del escudo es proporcional a la DEF de Xinyan y al número de enemigos alcanzados:",
                            "descriptions": [
                                "De 0 a 1 enemigos: otorga un Escudo Niv. 1: Improvisación.",
                                "2 enemigos: otorga un Escudo Niv. 2: Entrada.",
                                "3 o más enemigos: otorga un Escudo Niv. 3: Fiesta que inflige intermitentemente Daño Pyro a los enemigos cercanos."
                            ]
                        },
                        {
                            "name": "",
                            "description": "El escudo tiene las siguientes propiedades:",
                            "descriptions": [
                                "Al activarse, aplica el elemento Pyro sobre Xinyan.",
                                "Tiene un 250% de efectividad de absorción de Daño Pyro."
                            ]
                        }
                    ]
                },
                {
                    "key": "s3",
                    "title": "Melodía de la rebelión",
                    "description": "Tocando su música a toda velocidad, Xinyan lanza por los aires a un enemigo e inflige Daño Físico a los enemigos cercanos, dando ánimos a su público. El fervor del ambiente provocará explosiones que infligen Daño Pyro a los enemigos cercanos.",
                    "abilities": []
                }
            ],
            "passives": [
                {
                    "key": "p1",
                    "title": "Receta rockera",
                    "description": "Cuando se logra un \"Perfecto\" en un plato con efectos de defensa, hay un 12% de posibilidades de obtener el doble de cantidad del producto.",
                    "descriptions": []
                },
                {
                    "key": "p2",
                    "title": "El espectáculo debe continuar",
                    "description": "Reduce la cantidad de enemigos que deben ser golpeados con Desenfreno para crear un escudo:",
                    "descriptions": [
                        "Escudo Niv. 2: Entrada: 1 enemigo.",
                        "Escudo Niv. 3: Fiesta: 2 o más enemigos."
                    ]
                },
                {
                    "key": "p3",
                    "title": "¡Rock and Roll!",
                    "description": "Aumenta en un 15% el Daño Físico de los personajes que se encuentran bajo la protección del escudo de Desenfreno.",
                    "descriptions": []
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "Aceleración letal",
                    "description": "Durante 5 s después de realizar un golpe CRIT, aumenta en un 12% la Vel. ATQ de los Ataques Normales y Cargados. Solo puede ocurrir una vez cada 5 s.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c2",
                    "title": "Comienzo improvisado",
                    "description": "La Prob. CRIT de Daño Físico de Melodía de la revolución aumenta en un 100% y al lanzar la habilidad se creará un Escudo Niv. 3: Fiesta.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c3",
                    "title": "Dobles cuerdas",
                    "description": "Aumenta el nivel de habilidad de Desenfreno +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "Ritmo contagioso",
                    "description": "El Daño de Desenfreno reduce en un 15% la RES Física de los enemigos durante 12 s.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "¡Otra canción!",
                    "description": "Aumenta el nivel de habilidad de Melodía de la rebelión +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "Rockeando en el infierno",
                    "description": "El Coste de Aguante del Ataque Cargado de Xinyan se reduce en un 30%. Además, al realizar un Ataque Cargado, gana un 50% de la DEF como Boño de ATQ.",
                    "secondDescription": null,
                    "descriptions": []
                }
            ]
        },
        {
            "key": "Zhongli",
            "name": "Zhongli",
            "description": "Misterioso invitado de la Funeraria El Camino. Erudito con información sobre todo tipo de cosas",
            "skills": [
                {
                    "key": "s1",
                    "title": "Lluvia pétrea",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Realiza hasta 6 ataques rápidos con lanza.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Consume una cierta cantidad de Aguante para lanzarse al frente, haciendo que caigan lanzas de piedra en su camino.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": "Se lanza desde el aire para golpear el suelo, dañando a los enemigos cercanos e infligiendo Daño en el AdE en el momento del impacto.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Dominus Lapidis",
                    "description": "Cada montaña, roca y centímetro de la tierra contiene poder Geo, pero solo unos pocos pueden usar libremente tal poder.",
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Ordena al poder Geo de la tierra que se solidifique en una cresta de piedra.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Hace que los elementos Geo cercanos exploten, provocando los siguientes efectos:",
                            "descriptions": [
                                "Si aún no se ha alcanzado la cantidad máxima de crestas de piedra, invocará una cresta de piedra.",
                                "Crea un escudo de jade. La cantidad de absorción de daño del escudo es proporcional a la Vida Max. de Zhongli.",
                                "Inflige Daño Geo en el AdE.",
                                "Si hay enemigos cercanos afectados por el elemento Geo, absorberá una gran cantidad de dicho elemento de un máximo de dos objetivos afectados por él. Este efecto no causa daño."
                            ]
                        },
                        {
                            "name": "Cresta de piedra",
                            "description": "Al ser creada, inflige Daño Geo en el AdE.\nLa cresta de piedra resonará con las creaciones de Geo cercanas, infligiendo Daño Geo a los enemigos cercanos.\nLa cresta de piedra es considerada una creación Geo, y puede escalarse y usarse para bloquear ataques.\nSolo puede existir una al mismo tiempo.",
                            "descriptions": []
                        },
                        {
                            "name": "Escudo de jade",
                            "description": "Tiene un 150% de eficiencia de abosorción contra todo el Daño Elemental y el Daño Físico. Cuando un personaje se encuentra protegido por este escudo, todas las RES Elementales y la RES Física de los enemigos cercanos a él en una pequeña AdE se reducen en un 20%.\nEste efecto no puede acumularse.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s3",
                    "title": "Lluvia estelar",
                    "description": "Atrae un meteorito a la tierra, causando Daño Geo masivo a los enemigos dentro de su AdE y aplicando el efecto de Petrificación.",
                    "abilities": [
                        {
                            "name": "Petrificación",
                            "description": "Los enemigos bajo el efecto de Petrificación no pueden moverse.",
                            "descriptions": []
                        }
                    ]
                }
            ],
            "passives": [
                {
                    "key": "p1",
                    "title": "Cristal del destino",
                    "description": "Recupera el 15% de los minerales utilizados en la fabricación de lanzas.",
                    "descriptions": []
                },
                {
                    "key": "p2",
                    "title": "Ondas resonantes",
                    "description": "Cuando el Escudo de Jade recibe daño, genera un efecto de fortalecimiento:",
                    "descriptions": [
                        "Los personajes con Escudo de Jade aumentan su Protección de Escudo en un 5%.",
                        "Este efecto puede acumularse hasta 5 veces y dura hasta que desaparezca el Escudo de Jade."
                    ]
                },
                {
                    "key": "p3",
                    "title": "Dominio de la Tierra",
                    "description": "El daño infligido por los siguientes ataques de Zhongli aumenta en proporción a su Vida Máx.:",
                    "descriptions": [
                        "Aumenta el daño de Ataque Normal, Ataque Cargado y Ataque Descendente en un 1.39% de su Vida Máx.",
                        "Aumenta en un 1.9% de su Vida Máx. el daño de resonancia de la cresta de piedra de Dominus lapidis, asi como el daño de mantener pulsado",
                        "Aumenta el daño de Lluvia estelar en un 33% de la Vida Máx. de Zhongli"
                    ]
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "Roca, el núcleo de la Tierra",
                    "description": "Dominus lapidis puede crear un máximo de 2 Crestas de piedra al mismo tiempo.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c2",
                    "title": "Piedra, el origen del jade",
                    "description": "Al caer Lluvia estelar, otorga un Escudo de jade a los personajes cercanos que están en combate.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c3",
                    "title": "Jade, el brillo del crepúsculo",
                    "description": "Aumenta el nivel de habilidad de Dominus lapidis +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "Topacio, indestructible e intrépido",
                    "description": "Aumenta el AdE de Lluvia estelar en un 20%. Además, aumenta en 2 s la duración de Petrificación de Lluvia estelar.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "Lapislázuli, el heraldo del orden",
                    "description": "Aumenta el nivel de habilidad de Lluvia estelar +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "Chrysos, la generosidad del dominador",
                    "description": "Cuando Escudo de Jade recibe daño, el 40% del daño recibido se convierte en Vida para el personaje actual.\nNo se puede recuperar más del 8% de la Vida Máx. del personaje cada vez que se activa el efecto.",
                    "secondDescription": null,
                    "descriptions": []
                }
            ]
        }
    ],
    "weapons": [
        {
            "key": "Hunter’s Bow",
            "name": "Arco del Cazador",
            "description": "La música de un cazador consta de dos sonidos: el de la tensión de la cuerda del arco y el silbido de las flechas que vuelan.",
            "refinement": null
        },
        {
            "key": "Seasoned Hunter’s Bow",
            "name": "Arco del Cazador Estacional",
            "description": "Un arco viejo pero bien conservado. Podría ser considerado una extensión del brazo del arquero cuando se utiliza.",
            "refinement": null
        },
        {
            "key": "Ebony Bow",
            "name": "Ebony Bow",
            "description": "A longbow made of ebony wood with stiffer limbs than ordinary bows. It is also a far more powerful weapon.",
            "refinement": "Increases DMG against mechanoid Ruin enemies by {{0}}%"
        },
        {
            "key": "Messenger",
            "name": "Mensajero",
            "description": "Un arco de madera básico. Dicen que se usaba para comunicaciones de larga distancia.",
            "refinement": "Al golpear un punto débil con un Ataque Cargado, inflige un {{0}}% adicional de Daño de ATQ como Daño CRIT. Este efecto puede activarse una vez cada 10 s."
        },
        {
            "key": "Raven Bow",
            "name": "Arco de Cuervo",
            "description": "Los cuervos son conocidos por ser los mensajeros de la muerte. Las plumas que decoran este arco presagian la muerte inminente de cualquier objetivo.",
            "refinement": "Aumenta el daño contra los enemigos afectados por Hydro o Pyro en un {{0}}%."
        },
        {
            "key": "Recurve Bow",
            "name": "Arco Recurvo",
            "description": "Se dice que este arco podría derribar águilas en vuelo, pero mucho de eso depende de la habilidad del arquero.",
            "refinement": "Restaura {{0}}% de Vida después de derrotar al oponente."
        },
        {
            "key": "Sharpshooter’s Oath",
            "name": "Juramento del Arquero",
            "description": "Este sublime arco perteneció una vez a un maestro arquero. Emite un fuerte olor, por lo que no es apto para la caza.",
            "refinement": "Aumenta el daño contra los puntos débiles en un {{0}}%."
        },
        {
            "key": "Slingshot",
            "name": "Tirachinas",
            "description": "Después de muchas modificaciones y mejoras, su inventor acabó cambiando su aspecto por completo. Ahora, en realidad, es un arco.",
            "refinement": "Al activar un Ataque Normal o Cargado, si se golpea al enemigo en menos de 0,3 segundos, el daño causado tendrá un aumento de un {{0}}%. Si excede el tiempo, el daño causado disminuirá un 10%."
        },
        {
            "key": "The Stringless",
            "name": "Último Acorde",
            "description": "Un arco que alguna vez sirvió como un instrumento extraordinario. Ya no puede levantar a las personas para hacerlas bailar.",
            "refinement": "Incrementa el daño de la habilidad elemental y la explosión elemental un {{0}}%"
        },
        {
            "key": "Alley Hunter",
            "name": "Alley Hunter",
            "description": "Un arco de largo alcance. Una vez perteneció a un caballero ladrón que nunca fue atrapado.",
            "refinement": "Cada 4 segundos cuando hay un personaje en su campo, su ataque aumenta un {{0}}% y su probabilidad crítica aumenta un {{1}}%. Este efecto se puede acumular un máximo de 5 veces y no se reiniciará si el personaje abandona el campo, pero se eliminará cuando el personaje reciba daño."
        },
        {
            "key": "Blackcliff Warbow",
            "name": "Arco del Peñasco Oscuro",
            "description": "Un arco hecho de Piedra negra cuyos extremos son sumamente resistentes. Su uso requiere de un arquero diestro y de brazos fuertes.",
            "refinement": "Al derrotar a un enemigo, aumenta el ATQ en {{0}}% durante 30s, pudiéndose acumular hasta 3 veces. La duración de cada acumulación es independiente."
        },
        {
            "key": "Compound Bow",
            "name": "Arco Compuesto",
            "description": "Un arco de aleación de metal, con ruedas que estiran la cuerda. Su extraña estructura hace que sea difícil de manejar, pero las flechas golpean al objetivo con una fuerza impresionante.",
            "refinement": "Al golpear con Ataque Normal y Ataque Cargado, aumenta el ATQ en un {{0}}% y la Vel. de Ataque Normal en un {{1}}% durante 6 s. Este efecto puede acumularse hasta 4 veces y activarse una vez cada 0.3 s."
        },
        {
            "key": "Favonius Warbow",
            "name": "Arco de Favonius",
            "description": "Un arco recurvo estándar de los Caballeros de Favonius. Solo los mejores arqueros pueden sacar todo su potencial.",
            "refinement": "Los Golpes CRIT tienen un {{0}}% probabilidad de generar una pequeña cantidad de Partículas Elementales, que regenerarán 6 de Energía para el personaje. Solo puede ocurrir una vez cada {{1}} s."
        },
        {
            "key": "Prototype Crescent",
            "name": "Prototipo Luz de Luna",
            "description": "Un prototipo de arco largo descubierto en la Forja Peñasco Oscuro. La flecha disparada desde este arco brilla como un rayo de luz de luna.",
            "refinement": "Al golpear con Ataque Cargado los puntos débiles del enemigo, aumenta la Vel. Movimiento en 10% y ATQ {{0}}% durante 10 s."
        },
        {
            "key": "Royal Bow",
            "name": "Arco Real",
            "description": "Un viejo arco largo de la realeza que alguna vez gobernó Mondstadt. Innumerables generaciones después, la cuerda del arco sigue tensa y puede disparar flechas rápidamente.",
            "refinement": "Al dañar a un oponente, aumenta la Prob. CRIT en un {{0}}%. Acumulable hasta 5 veces. Un vez dado un golpe CRIT, reiniciará todos aquellos acumulados."
        },
        {
            "key": "Rust",
            "name": "Herrumbre",
            "description": "Un arco de hierro completamente oxidado. La gente común ni siquiera tiene la fuerza necesaria para levantarlo, y menos aún para disparar sus flechas.",
            "refinement": "El Daño de Ataque Normal aumenta un {{0}}%, y el Daño de Ataque Cargado disminuye un 10%."
        },
        {
            "key": "Sacrificial Bow",
            "name": "Arco del Sacrificio",
            "description": "Un arco de caza decorativo que ha sido petrificado por el tiempo. Las decoraciones en él son todavía fácilmente visibles. Concede al portador el poder de resistir los vientos del tiempo.",
            "refinement": "Al hacer daño por medio de una Habilidad Elemental, hay un {{0}}% de probabilidad de restablecer el TdE de esta habilidad. Este efecto puede activarse una vez cada {{1}} s."
        },
        {
            "key": "The Viridescent Hunt",
            "name": "Arco Esmeralda de la Cazadora",
            "description": "Un noble e inmaculado arco de caza de color verde oscuro. Perteneció a una persona que solía cazar en los bosques.",
            "refinement": "Al golpear con un Ataque Normal o Ataque Cargado, hay un 50% de probabilidad de crear un ciclón que atrae a los enemigos cercanos de forma continua, infligiendo un {{0}}% del ATQ como Daño cada 0.5s durante 4s. Este efecto puede ocurrir una vez cada {{1}} s."
        },
        {
            "key": "Skyward Harp",
            "name": "Alas Celestiales",
            "description": "Un gran arco que simboliza la afiliación de Dvalin con el Arconte Anemo. El sonido del arco disparando es música para los oidos del Arconte Anemo. Contiene el poder del cielo y el viento en su interior.",
            "refinement": "Aumenta el daño crítico un {{0}}%. Los golpes tienen un {{1}}% de probabilidad de infligir un pequeño ataque en área, causando 125% del ataque físico como daño. Este efecto solo puede ocurrir una vez cada {{2}} segundos."
        },
        {
            "key": "Amos’ Bow",
            "name": "Arco de Amos",
            "description": "Un arco muy antiguo que conserva su poder a pesar de que su dueño original se fue hace mucho tiempo. Toma el poder de todos y todo en el mundo.",
            "refinement": "El daño infligido con Ataques Normales y Cargados aumenta en un {{0}}%. Tras hacer un Ataque Normal o Cargado, el daño aumenta en un {{1}}% cada 0.1 s, acumulable hasta 5 veces."
        },
        {
            "key": "Dreams of Dragonfell",
            "name": "Dreams of Dragonfell",
            "description": "A great bow that once shot clean through a giant dragon. Once released, the impetus of its bowstring resembles a peal of thunder.",
            "refinement": "Increases Shield Strength by {{0}}%. Scoring hits on opponents increases ATK by {{1}}% for 8s. Max 5 stacks. Can only occur once every 0.3s. While protected by a shield, this ATK increase effect is increased by 100%."
        },
        {
            "key": "Dull Blade",
            "name": "Hoja Desafilada",
            "description": "Si tus sueños de la juventud y la emoción de la aventura no son suficientes, ¡compleméntalos con valentía!",
            "refinement": null
        },
        {
            "key": "Silver Sword",
            "name": "Espada Plateada",
            "description": "Una espada para ahuyentar a los demonios. Todo el mundo sabe que está hecha de una aleación de plata, no de plata pura.",
            "refinement": null
        },
        {
            "key": "Cool Steel",
            "name": "Hoja Fría",
            "description": "Un arma laminada fiable, forjada en acero, que sirve como testimonio de las grandes aventuras de su antiguo maestro.",
            "refinement": "Aumenta el Daño contra los enemigos afectados por Hydro o Cryo un {{0}}%."
        },
        {
            "key": "Dark Iron Sword",
            "name": "Espada de Hierro Oscuro",
            "description": "Bueno... Es simplemente una espada de hierro oscura.",
            "refinement": "Aumenta el ATQ en un {{0}}% durante los 12 s posteriores a la activación de Sobrecarga, Superconductor, Electrocarga o Torbellino Electro."
        },
        {
            "key": "Fillet Blade",
            "name": "Hoja de Filetear",
            "description": "Un cuchillo afilado con una hoja larga.",
            "refinement": "Al atacar, hay un 50% de Prob. de infligir un {{0}}% de Daño a un solo enemigo, Este efecto puede activarse una vez cada {{1}} s."
        },
        {
            "key": "Harbinger of Dawn",
            "name": "Espada del Alba",
            "description": "Una espada que solía brillar como el sol. Su portador será bendecido con una sensación de poder y bienestar. El material reflectante de su hoja se desgastó hace mucho tiempo.",
            "refinement": "Cuando la Vida esté al 90%, aumenta la Prob. CRIT un {{0}}%."
        },
        {
            "key": "Skyrider Sword",
            "name": "Espada Surcacielos",
            "description": "Una espada de acero fiable. Cierta persona intentó usarla como una espada voladora...",
            "refinement": "Después de causar Daño Elemental, aumenta el Daño y Velocidad de Movimiento en un {{0}}% por 15 s."
        },
        {
            "key": "Traveler’s Handy Sword",
            "name": "Espada del Viajero",
            "description": "Una práctica espada de acero que esconde en su vaina unas tijeras, una lupa y yesca, entre otras cosas...",
            "refinement": "Al obtener un Orbe o Partícula Elemental, recupera un {{0}}% de Vida."
        },
        {
            "key": "Blackcliff Longsword",
            "name": "Espada Larga del Peñasco Oscuro",
            "description": "Una espada larga hecha de Piedra negra. Tiene un brillo carmesí oscuro en su oscura hoja.",
            "refinement": "Al derrotar a un enemigo, aumenta el ATQ en {{0}}% durante 30s, pudiéndose acumular hasta 3 veces. La duración de cada acumulación es independiente."
        },
        {
            "key": "Favonius Sword",
            "name": "Espada de Favonius",
            "description": "Una espada larga estándar de los Caballeros de Favonius. ¡Canalizar el poder de los elementos nunca fue tan fácil como con esta espada!",
            "refinement": "Los Golpes CRIT tienen un {{0}}% probabilidad de generar una pequeña cantidad de Partículas Elementales, que regenerán 6 de Energía para el personaje. Solo puede ocurrir una vez cada {{1}} s."
        },
        {
            "key": "Iron Sting",
            "name": "Espina de Hierro",
            "description": "Espada exótica que de alguna forma acabó en manos de comerciantes de Liyue. Es ligera, ágil y afilada.",
            "refinement": "Después de 6s de causar Daño Elemental, aumenta todo el Daño un {{0}}%. Este efecto puede acumularse hasta 2 veces y puede activarse una vez cada 1s."
        },
        {
            "key": "Lion’s Roar",
            "name": "Rugido del León",
            "description": "Una hoja afilada con tallas de lujo que de alguna manera no comprometen su durabilidad y nitidez. El sonido de la misma cortando el aire es como el rugido de un león.",
            "refinement": "Aumenta el Daño contra los enemigos afectados por Pyro o Electro un {{0}}%."
        },
        {
            "key": "Prototype Rancour",
            "name": "Prototipo Rencor",
            "description": "Una espada larga antigua descubierta en la Forja Peñasco Oscuro. Es tan afilada que con ella se puede cortar una roca con gran facilidad.",
            "refinement": "Al golpear, los Ataques Normales o Cargados aumentan el ATQ y DEF en {{0}}% durante 6 s. Máximo 4 acumulaciones. Puede ocurrir una vez cada 0.3 s."
        },
        {
            "key": "Royal Longsword",
            "name": "Espada Real Larga",
            "description": "Una vieja espada larga que perteneció a aquellos que algunas vez gobernaron sobre Mondstadt. Tiene un acabado exquisito. Sus decoraciones y grabados hablan del prestigio del propietario.",
            "refinement": "Al dañar a un oponente, aumenta la Prob. CRIT en un {{0}}%. Acumulable hasta 5 veces. Un vez dado un golpe CRIT, reiniciará todos aquellos acumulados."
        },
        {
            "key": "Sacrificial Sword",
            "name": "Espada de Sacrificio",
            "description": "Una espada decorativa que ha sido petrificada por el tiempo. Las baratijas incrustadas en su superficie todavía son visibles. Concede al portador el poder de resistir los vientos del tiempo.",
            "refinement": "Al hacer daño por medio de una Habilidad Elemental, hay un {{0}}% de probabilidad de restablecer el TdE de esta habilidad. Este efecto puede activarse una vez cada {{1}} s."
        },
        {
            "key": "The Alley Flash",
            "name": "The Alley Flash",
            "description": "Una espada tan negra como la noche. Alguna vez perteneció a un ladrón que acechaba en las calles oscuras",
            "refinement": "Correr continuamente durante al menos 1s aumenta el ataque un {{0}}% durante 6s. Este efecto no se acumula."
        },
        {
            "key": "The Black Sword",
            "name": "Espada Negra",
            "description": "Una espada larga oscura que ansia el conflicto y el combate. Se dice que sume a su portador en el violento deseo de mancharse de sangre en una masacre.",
            "refinement": "Aumenta el daño de ATQ Normal y ATQ Cargado en un {{0}}%; además, al hacer CRIT con Ataque Normal o Ataque Crítico, recuperas vida equivalente al {{1}}% del ATQ. Este efecto puede activarse una vez cada 5s."
        },
        {
            "key": "The Flute",
            "name": "Flauta",
            "description": "Tras el óxido, se esconde una hoja delgada y lujosamente decorada. Se balancea tan rápido como el viento.",
            "refinement": "Al golpear, los ATQ Normales o Cargados obtendrán un Armónico. 5 Armónicos activan el poder de la música, que inflige un {{0}}% de Daño ATQ a los oponentes de alrededor. Los Armónicos duran hasta 30 segundos, y se puede 1 Armónico cada 0.5 s."
        },
        {
            "key": "Sword of Descension",
            "name": "Espada del Descenso",
            "description": "Una espada de artesanía única. No parece pertenecer a este mundo.",
            "refinement": "Golpear a los enemigos con Ataques Normales y Cargados otorga un {{0}}% de probabilidad de infligir 200% de ATQ como Daño de Área pequeña. Este efecto solo puede ocurrir una vez cada 10 s. Además, si el Viajero equipa la Espada del Descenso, su ATQ aumenta en {{1}} pts."
        },
        {
            "key": "Festering Desire",
            "name": "Deseo Ponzoñoso",
            "description": "Una espada muy recta y misteriosa que parece sedienta de Vida. De ella gotea un veneno capaz de corromper hasta a un dragón.",
            "refinement": "Aumenta el daño de la habilidad elemental un {{0}}% y la probabilidad crítica de la habilidad elemental un {{1}}%."
        },
        {
            "key": "Aquila Favonia",
            "name": "Aquila Favonia",
            "description": "La espada de los Caballeros de Favonius. Milenios más tarde, aun llama por los vientos de la justicia para eliminar todo el mal, justo como la última heroina que la usó.",
            "refinement": "Aumenta el ataque un {{0}}%. Se activa al recibir daño: el alma del halcón del oeste despierta, sosteniendo el estandarte de la resistencia, regenerando Vida igual al {{1}}% del ataque e infligiendo {{2}}% del ataque como daño a los enemigos que le rodean. Este efecto sólo puede ocurrir una vez cada 15 segundos."
        },
        {
            "key": "Skyward Blade",
            "name": "Hoja Afilada Celestial",
            "description": "La espada de un caballero que simboliza el honor restaurado de Dvalin. Las bendiciones del Arconte de Anemo descansan en esta espada, imbuyéndola con poderes del cielo y el viento.",
            "refinement": "Probabilidad crítica aumentada un {{0}}%. Gana Skypiercing Might al usar la habilidad elemental. Aumenta la velocidad de movimiento un 10%, aumenta la velocidad de ataque un 10% y aumenta el daño de los ataques normales y cargados un {{1}}% durante 12s."
        },
        {
            "key": "Summit Shaper",
            "name": "Rompemontañas",
            "description": "Según la leyenda, esta afilada espada, que representa la firma de cierto contrato, se usó para cortar los picos de las montañas.",
            "refinement": "La Protección de Escudo aumenta en un {{0}}%. Durante 8 s después de atacar a un enemigo, el ATQ aumenta en un {{1}}%. Este efecto puede acumularse hasta 5 veces y activarse una vez cada 0.3 s. Además, al estar bajo la protección de un escudo, el efecto de aumento de ATQ aumenta en un 100%."
        },
        {
            "key": "Apprentice’s Notes",
            "name": "Apuntes del aprendiz",
            "description": "Notas escritas por un estudiante brillante. Dejó anotados muchos hechizos útiles. Su letra es hermosa.",
            "refinement": null
        },
        {
            "key": "Pocket Grimoire",
            "name": "Grimorio de Bolsillo",
            "description": "Un cuaderno que recoge con todo detalle anotaciones muy útiles para los exámenes de magia.",
            "refinement": null
        },
        {
            "key": "Amber Bead",
            "name": "Amber Bead",
            "description": "Un catalizador tallado del ámbar que gana un cálido halo debajo del sol.",
            "refinement": "Los ataques normales aumentan todo el daño elemental un {{0}}% durante 6 segundos. Se acumula hasta 2 veces."
        },
        {
            "key": "Emerald Orb",
            "name": "Orbe Esmeralda",
            "description": "Un catalizador tallado en jade del Desfiladero Jueyun, al norte de Liyue. Es pequeño, ligero y duradero: Popularmente se conoce como \"Orbe de Jade\".",
            "refinement": "12 s después de activar el efecto de Vaporización: Electrocargado, Congelación, o Torbellino Hydro, el ATQ aumenta en un {{0}}%."
        },
        {
            "key": "Magic Guide",
            "name": "Guía Mágica",
            "description": "12ª edición. Una reimpresión con correcciones de la 11ª edición y contenido nuevo basado en el desarrollo de los últimos años.",
            "refinement": "Aumenta el Daño contra los enemigos afectados por Hydro o Electro {{0}}%."
        },
        {
            "key": "Otherworldly Story",
            "name": "Historias de Otros Mundos",
            "description": "Una novela de fantasía sin ningún valor. Probablemente puedas usar este objeto como un catalizador mágico en tu imaginación.",
            "refinement": "Al obtener un Orbe o Partícula Elemental, recupera un {{0}}% de Vida."
        },
        {
            "key": "Thrilling Tales of Dragon Slayers",
            "name": "Cuentos de Cazadores de Dragones",
            "description": "Una historia ficticia de una banda de Cinco Héroes en una expedición de cacería de dragones. Está mal escrita, pero puede transmitir a la gente la importancia de no cometer errores.",
            "refinement": "Al cambiar de personaje, el ATQ del nuevo personaje aumenta en un {{0}}% durante 10s. Este efecto ocurre una vez cada 20s."
        },
        {
            "key": "Twin Nephrite",
            "name": "Nefrita Gemela",
            "description": "Un colgante de Nefrita colocado entre dos piedras de jade.",
            "refinement": "Derrotar a un oponente aumenta la Vel. Movimiento y el Ataque en un {{0}}% durante 15s."
        },
        {
            "key": "Blackcliff Agate",
            "name": "Ágata del Peñasco Oscuro",
            "description": "Un misterioso catalizador hecho de Piedra negra. Tiene un brillo carmesí siniestro que parece latir en sincronía con los temblores de las profundidades de la tierra.",
            "refinement": "Al derrotar a un enemigo, aumenta el ATQ en {{0}}% durante 30s, pudiéndose acumular hasta 3 veces. La duración de cada acumulación es independiente."
        },
        {
            "key": "Favonius Codex",
            "name": "Códice de Favonius",
            "description": "Un libro secreto que perteneció a los eruditos de los Caballeros de Favonius. Describe el poder de la materia y la lógica.",
            "refinement": "Los Golpes CRIT tienen un {{0}}% probabilidad de generar una pequeña cantidad de Partículas Elementales, que regenerarán 6 de Energía para el personaje. Solo puede ocurrir una vez cada {{1}} s."
        },
        {
            "key": "Mappa Mare",
            "name": "Carta Náutica de las Tierras y los Mares",
            "description": "Un mapa muy detallado de las aguas alrededor de Teyvat. Este es uno de esos maravillosos documentos que llegaron a través de las rutas comerciales de Liyue.",
            "refinement": "La activación de una Reacción Elemental otorga un {{0}}% adicional de Daño Elemental durante 10 s, y puede acumularse hasta 2 veces."
        },
        {
            "key": "Prototype Amber",
            "name": "Prototipo Malicia",
            "description": "Un catalizador recubierto de oro guardado en secreto en la Forja Peñasco Oscuro. Parece brillar con la misma luz del cielo.",
            "refinement": "Durante los 6 s. después de lanzar una Habilidad Definitiva, recuperará {{0}} puntos de Energía Elemental cada 2 s. Todos los miembros del equipo recuperarán {{1}}% de Vida cada 2 s."
        },
        {
            "key": "Royal Grimoire",
            "name": "Grimorio Real",
            "description": "Un libro que una vez perteneció a un mago real de Mondstadt. Mantiene extensos y verdaderos relatos históricos y hechizos.",
            "refinement": "Al dañar a un oponente, aumenta la Prob. Crit en un {{0}}%. Se acumula hasta 5 veces. Una vez dado un golpe CRTI, reiniciará todos aquellos acumulados."
        },
        {
            "key": "Sacrificial Fragments",
            "name": "Memorias de Sacrificios",
            "description": "Un guión desgastado, con textos que ya no son identificables. Un objeto maldito erosionado por los vientos del tiempo.",
            "refinement": "Al hacer daño por medio de una Habilidad Elemental, hay un {{0}}% de probabilidad de restablecer el TdE de esta habilidad. Este efecto puede activarse una vez cada {{1}} s."
        },
        {
            "key": "Solar Pearl",
            "name": "Perla Solar",
            "description": "Una perla opaca y dorada hecha de una sustancia desconocida que alberga la luz del sol y la luna. Late con una fuerza muy cálida.",
            "refinement": "Dentro de los 6s después de realizar un Ataque Normal, el Daño de Hab. Elemental y Hab. Definitiva aumenta en un {{0}}%. Dentro de los 6 s después de lanzar una Hab. Elemental o Definitiva, el Daño de Ataque Normal aumenta un {{1}}%."
        },
        {
            "key": "The Widsith",
            "name": "Sinfonía de los Merodeadores",
            "description": "Un pesado cuaderno lleno de partituras. A pesar de que está consumido por las polillas, la escritura sigue mostrando su poder.",
            "refinement": "Al entrar en combate, el personaje obtiene una canción aleatoria durante 10 s. Puede ocurrir una vez cada 30 s. Recital: aumenta el ATQ en un {{0}}%; Aria: aumenta todo el Daño elemental en un {{1}}; Interludio: aumenta la Maestría Elemental en {{2}}."
        },
        {
            "key": "Wine and Song",
            "name": "Wine and Song",
            "description": "Un libro de canciones de la era aristocrática, cuyo compositor ha sido olvidado. Relata las historias de cierto héroe del exterior.",
            "refinement": "Por cada personaje en el equipo proveniente de Mondstadt, el personaje que lleva equipada esta arma gana un aumento del {{0}}% en su ataque y {{1}}% en su velocidad de movimiento."
        },
        {
            "key": "Eye of Perception",
            "name": "Ojo de la Perspicacia",
            "description": "Una oscura joya hecha de cristal. Cuenta la leyenda que posee la capacidad de ver a través de la pureza de las personas.",
            "refinement": "Los Ataques Normales y Ataques Cargados tienen un 50% de probabilidad de lanzar un Ojo de la Perspicacia que inflige {{0}}% de ATQ como Daño. El Ojo de la Perspicacia puede rebotar entre enemigos un máximo de 4 veces. Este efecto puede ocurrir una vez cada {{1}} s."
        },
        {
            "key": "Frostbearer",
            "name": "Frío Eterno",
            "description": "Un fruto cristalizado que posee una extraña voluntad helada. Una tenue sensación de agonía emana de él.",
            "refinement": "Al golpear a los enemigos con Ataques Normales y Cargados, hay un {{0}}% de probabilidad de crear un carámbano sobre ellos. Al caer, el carámbano inflige un {{1}}% de daño de ATQ en el AdE. Si los enemigos están afectados por Cryo, el daño de ATQ infligido será del {{2}}%. Este efecto solo puede ocurrir una vez cada 10 s."
        },
        {
            "key": "Lost Prayer to the Sacred Winds",
            "name": "Oración Perdida a los Vientos Sagrados",
            "description": "Un libro educativo escrito por aldeanos anónimos que adoraban al viento. Fue bendecido por el viento por su fidelidad e influencia acumulada a lo largo de milenios.",
            "refinement": "Aumenta la Vel. Movimiento en un 10%. Obtienes en batalla un {{0}}% de Bono de Daño Elemental cada 4 s, pudiéndose acumular hasta 4 veces. Dura hasta derrotar al último personaje o al abandonar el combate."
        },
        {
            "key": "Skyward Atlas",
            "name": "Pergamino Celestial",
            "description": "Un atlas de nubes que simboliza a Stormterror y al Dios de los Vientos, su antiguo maestro. Detalla los vientos y las nubes de las regiones del norte y contiene los poderes del cielo y de los vientos.",
            "refinement": "Incrementa el el bono de Daño Elemental en un {{0}}%. Al lanzar un Ataque Normal, hay un 50% de prob. de conseguir la gracia de las nubes. Estas buscarán durante 15 s oponentes a los que atacar, infligiendo un {{1}}% de Daño de ATQ. Este efecto solo puede ocurrir una vez cada 30 s."
        },
        {
            "key": "Memory of Dust",
            "name": "Candado Terrenal",
            "description": "A stone dumbbell containing distant memories. Its endless transformations reveal the power within.",
            "refinement": "La Protección de Escudo aumenta en un {{0}}%. Durante 8 s después de atacar a un enemigo, el ATQ aumenta en un {{1}}%. Este efecto puede acumularse hasta 5 veces y activarse una vez cada 0.3 s. Además, al estar bajo la protección de un escudo, el efecto de aumento de ATQ aumenta en un 100%."
        },
        {
            "key": "Waster Greatsword",
            "name": "Gran Espada del Guerrero",
            "description": "Una plancha de hierro resistente que, con la fuerza de voluntad de la persona que la empuñe, puede ser lo suficientemente potente como para romper montañas.",
            "refinement": null
        },
        {
            "key": "Old Merc’s Pal",
            "name": "Espada del Mercenario",
            "description": "Una gran espada probada en batalla, que ha visto días mejores y peores.",
            "refinement": null
        },
        {
            "key": "Bloodtainted Greatsword",
            "name": "Gran Espada Sangrienta",
            "description": "Una espada de acero que se dice que ha sido vestida con sangre de dragón, haciéndola invulnerable al daño. Sin embargo, este efecto no se extiende a su portador.",
            "refinement": "Aumenta el Daño contra los enemigos afectados por Pyro o Electro un {{0}}%."
        },
        {
            "key": "Debate Club",
            "name": "Garrote del Debate",
            "description": "Una práctica vara hecha de acero fino. Es la base de la \"convicción racional\".",
            "refinement": "Después de usar una Habilidad Elemental, los Ataques Normales o Cargados infligirán un daño de ATQ adicional del {{0}}% en un área pequeña durante 15s. Solo puede ocurrir una vez cada 3s."
        },
        {
            "key": "Ferrous Shadow",
            "name": "Sombra férrea",
            "description": "Una réplica de la famosa espada de Arundolyn, el León de la Luz. ¡Sostenla y siente el poder del héroe legendario! Nota: Soñar despierto demasiado tiempo puede ser perjudicial para la salud.",
            "refinement": "Cuando la Vida está por debajo del {{0}}%, los Ataques Cargados casi nunca serán interrumpidos. También aumenta el daño del Ataque Cargado en un {{1}}%."
        },
        {
            "key": "Quartz",
            "name": "Quartz",
            "description": "Una mandoble simple pero pesada hecha de cuarzo negro pulido con adornos dorados. Tiene un aire de elegancia y dignidad.",
            "refinement": "Al causar una reacción de Sobrecarga, Derretimiento, Quemadura, Vaporización o Remolino Pyro, aumenta el ataque base un {{0}}% durante 12s."
        },
        {
            "key": "Skyrider Greatsword",
            "name": "Gran Espada Surcacielos",
            "description": "Una espada de acero fiable. Cierta persona intentó usarla como una espada voladora... por segunda vez.",
            "refinement": "En los Ataques Normales o Cargados, aumenta el ATQ en un {{0}}% durante 6 s y puede ser acumulado hasta 4 veces. Este efecto puede activarse una vez cada 0.5 s."
        },
        {
            "key": "White Iron Greatsword",
            "name": "Espada de Hierro Blanco",
            "description": "Una espada a dos manos fabricada con hierro blanco que aumenta su potencia al tiempo que tiene un peso relativamente ligero. Puede ser manejada por personas con fuerza normal en los brazos, pero su manejo es mucho mejor cuando es empuñada por grandes guerreros.",
            "refinement": "Restaura {{0}}% de Vida después de derrotar al oponente."
        },
        {
            "key": "Blackcliff Slasher",
            "name": "Gran Hoja del Peñasco Oscuro",
            "description": "Una gran espada firme forjada en el Peñasco Oscuro. Tiene un color carmesí oscuro a lo largo de su cuchilla.",
            "refinement": "Al derrotar a un enemigo, aumenta el ATQ en {{0}}% durante 30s, pudiéndose acumular hasta 3 veces. La duración de cada acumulación es independiente."
        },
        {
            "key": "Favonius Greatsword",
            "name": "Gran Espada de Favonius",
            "description": "Una pesada espada ceremonial de los Caballeros de Favonius. Canaliza el poder elemental con facilidad y es muy destructiva.",
            "refinement": "Los Golpes CRIT tienen un {{0}}% probabilidad de generar una pequeña cantidad de Partículas Elementales, que regenerarán 6 de Energía para el personaje. Solo puede ocurrir una vez cada {{1}} s."
        },
        {
            "key": "Lithic Blade",
            "name": "Espada Lítica",
            "description": "Una espada tallada y pulida a partir de la roca que sostiene Liyue.",
            "refinement": "Por cada personaje en el equipo proveniente de Liyue, el personaje que lleva equipada esta arma gana un aumento de {{0}}% en su ataque y {{1}}% en su probabilidad crítica. Este efecto puede acumularse hasta 4 veces."
        },
        {
            "key": "Prototype Archaic",
            "name": "Prototipo Aminus",
            "description": "Una espada larga antigua descubierta en la Forja Peñasco Oscuro. Es tan afilada que con ella se puede cortar una roca con gran facilidad.",
            "refinement": "Al lanzar un Ataque Normal o Cargado, hay un 50% de prob. de causar un {{0}}% de daño adicional en ATQ en un área pequeña. Este efecto solo puede ocurrir una vez cada 15 s."
        },
        {
            "key": "Rainslasher",
            "name": "Segadora de la Lluvia",
            "description": "Una gran espada fluorescente y sin punta que hace añicos a los enemigos con fuerza bruta y poder.",
            "refinement": "Aumenta el daño contra los enemigos afectados por Hydro o Electro un {{0}}%."
        },
        {
            "key": "Royal Greatsword",
            "name": "Gran Espada Real",
            "description": "Una vieja gran espada que perteneció a los que alguna vez gobernaron Mondstadt. Está hecha con materiales de primera calidad que han resistido la prueba del tiempo. Un arma de batalla exclusiva para la realeza.",
            "refinement": "Al dañar a un oponente, aumenta la Prob. CRIT en un {{0}}%. Acumulable hasta 5 veces. Un vez dado un golpe CRIT, reiniciará todos aquellos acumulados."
        },
        {
            "key": "Serpent Spine",
            "name": "Médula de la Serpiente Marina",
            "description": "Un arma muy poco común procedente del océano. Al blandirla, emite un silbido que recuerda al romper de las olas.",
            "refinement": "Cuando el personaje esté en combate, aumenta el Daño que inflige en un {{0}}% y el Daño que recibe en un {{1}}% cada 4s. Este efecto puede acumularse un máximo de 5 veces, y no se reiniciará si el personaje se retira de combate, sino que, cada vez que reciba daño, perderá una de las cargas acumuladas."
        },
        {
            "key": "The Bell",
            "name": "Espada del Tiempo",
            "description": "Una espada pesada con un reloj, pero sus mecanismos internos fueron dañados hace mucho tiempo.",
            "refinement": "Al recibir Daño, genera un escudo que absorbe Daño hasta el {{0}}% de la Vida Máx. Este escudo dura 10 s o hasta que se rompe, y solo puede ser activado una vez cada 45 s. Mientras esté protegido por el escudo, el personaje aumenta su Daño de ATQ en un {{1}}%."
        },
        {
            "key": "Whiteblind",
            "name": "Sombra Blanca",
            "description": "Una espada exótica con una navaja no muy afilada. Terminó en Liyue a manos de comerciantes extranjeros. Increíblemente poderosa en las manos de aquellos que realmente saben cómo usarla.",
            "refinement": "Después de lanzar un Ataque Normal o Cargado, el ATQ y DEF aumentan en un 6% en 6s y pueden ser acumulados hasta 4 veces ({{0}}% en total). Este efecto puede activarse una vez cada 0.5s."
        },
        {
            "key": "Sacrificial Greatsword",
            "name": "Gran Espada de Sacrificio",
            "description": "Una gran espada decorativa que ha sido petrificada por el tiempo. Las baratijas en ella todavía son visibles. Concede al portador el poder de resistir los vientos del tiempo.",
            "refinement": "Al hacer daño por medio de una Habilidad Elemental, hay un {{0}}% de probabilidad de restablecer el TdE de esta habilidad. Este efecto puede activarse una vez cada {{1}} s."
        },
        {
            "key": "Snow-Tombed Starsilver",
            "name": "Argento Estelar de las Nieves",
            "description": "Un mandoble antiguo oculto detrás de un fresco. Fue forjado con argento estelar, y tiene el poder de cortar a través del hielo y la nieve.",
            "refinement": "Al golpear a los enemigos con Ataques Normales y Cargados, hay un {{0}}% de probabilidad de crear un carámbano sobre ellos. Al caer, el carámbano inflige un {{1}}% de daño de ATQ en el AdE. Si los enemigos están afectados por Cryo, el daño de ATQ infligido será del {{2}}%. Este efecto solo puede ocurrir una vez cada 10 s."
        },
        {
            "key": "Skyward Pride",
            "name": "Orgullo Celestial",
            "description": "Una espada de dos manos que simboliza el orgullo de Dvalin en los cielos. Cuando es utilizada, emite un zumbido que representa la fuerza Dvalin y el poder de Anemo.",
            "refinement": "Aumenta todo Daño en un {{0}}%. Al realizar Ataques Normales o Cargados después de usar la Habilidad Definitiva, se crea una hoja de vacío que inflige un {{1}}% de Daño Físico a todos los enemigos cercanos. Tiene una duración de 20 s u 8 ataques de hoja."
        },
        {
            "key": "Wolf’s Gravestone",
            "name": "Lápida del Lobo",
            "description": "Una espada larga que fue usada por el Caballero Lobo. Originariamente, era solo una pesada lámina de hierro que le regaló el herrero de la ciudad. Pero se convirtió en una gran espada al serle otorgado poderes legendarios por su amistad con los lobos.",
            "refinement": "Aumenta el ATQ en un {{0}}%. Al atacar a oponentes con Vida menor al 30%, aumenta el ATQ de todos los compañeros en un {{1}}% durante 12 s. Este efecto puede activarse una vez cada 30 s."
        },
        {
            "key": "The Unforged",
            "name": "Espada de la Desidia",
            "description": "Capaz de alejar a los malos espíritus y las personas desquiciadas, esta mandoble posee una fuerza adivina",
            "refinement": "La Protección de Escudo aumenta en un {{0}}%. Durante 8 s después de atacar a un enemigo, el ATQ aumenta en un {{1}}%. Este efecto puede acumularse hasta 5 veces y activarse una vez cada 0.3 s. Además, al estar bajo la protección de un escudo, el efecto de aumento de ATQ aumenta en un 100%."
        },
        {
            "key": "Beginner’s Protector",
            "name": "Protector del Principiante",
            "description": "Una arma tan recta como el asta de una bandera. Adecuada para la mayoría de las situaciones, el portador se siente imponente cuando la balancea.",
            "refinement": null
        },
        {
            "key": "Iron Point",
            "name": "Punta de Hierro",
            "description": "Aguda y puntiaguda en un extremo, es un arma muy equilibrada. Popular entre los viajeros.",
            "refinement": null
        },
        {
            "key": "Black Tassel",
            "name": "Borla Negra",
            "description": "Bueno... El hecho de que sea de color oscuro soluciona el problema que tienen las borlas blancas... Las negras no se manchan fácilmente",
            "refinement": "Aumenta el daño contra los Slimes un {{0}}%."
        },
        {
            "key": "Halberd",
            "name": "Alabarda",
            "description": "Un arma de asta con una hoja de hacha montada en la parte superior, capaz de causar mucho daño. El arma predilecta entre los oficiales del Ejército de las Mil Rocas.",
            "refinement": "Los ataques normales infligen un {{0}}% de daño adicional a los enemigos. Este efecto solo puede ocurrir una vez cada 10 segundos."
        },
        {
            "key": "White Tassel",
            "name": "Borla Blanca",
            "description": "Un arma estándar del Ejército de las Mil Rocas. Tiene un eje firme y una punta de lanza afilada. Es un arma confiable.",
            "refinement": "Aumenta el daño del ATQ Normal un {{0}}%."
        },
        {
            "key": "Blackcliff Pole",
            "name": "Lanza del Peñasco Oscuro",
            "description": "Un arma hecha de Piedra negra y Siderita. Hay un brillo carmesí oscuro a lo largo de su filo frío.",
            "refinement": "Al derrotar a un enemigo, aumenta el ATQ en {{0}}% durante 30s, pudiéndose acumular hasta 3 veces. La duración de cada acumulación es independiente."
        },
        {
            "key": "Crescent Pike",
            "name": "Pica Luna Creciente",
            "description": "Un arma exótica con una cuchilla extremadamente larga en pa parte superior y una cuchilla en forma de media luna en la parte inferior. Llegó a Liyue a través de comerciantes extranjeros. Con la práctica, puede causar grandes daños.",
            "refinement": "5 s después de obtener una Partícula u Orbe Elemental, los Ataques Normales y Ataques Cargados causan un {{0}}% adicional de Daño de Ataque."
        },
        {
            "key": "Deathmatch",
            "name": "Lanza del Duelo",
            "description": "Una lanza afilada de color rojo sangre que fue un objeto de valor incalculable para un gladiador. Su punta está manchada con la sangre de innumerables bestias y personas.",
            "refinement": "Cuando hay dos o más enemigos cerca, aumenta el ATQ en un {{0}}% y la DEF en un {{1}}%. Cuando haya menos de 2 enemigos, aumenta el ATQ en un {{2}}%."
        },
        {
            "key": "Dragon’s Bane",
            "name": "Perdición del Dragón",
            "description": "Un plano decorado con un dragón dorado entrelazado. Ligera y afilada, esta arma puede matar dragones con facilidad.",
            "refinement": "Aumenta el daño contra los enemigos afectados por Hydro o Pyro un {{0}}%."
        },
        {
            "key": "Lithic Spear",
            "name": "Lanza Lítica",
            "description": "Una lanza forjada a partir de las rocas del Bosque de Rocas de Guyun. Su dureza no tiene rival.",
            "refinement": "Por cada personaje en el equipo proveniente de Liyue, el personaje que lleva equipada esta arma gana un aumento de {{0}}% en su ataque y {{1}}% en su probabilidad crítica. Este efecto puede acumularse hasta 4 veces."
        },
        {
            "key": "Prototype Starglitter",
            "name": "Prototipo Resentimiento",
            "description": "Una alabarda descubierta en la Forja Peñasco Oscuro. Los destellos a lo largo del borde afilado son como estrellas en la noche.",
            "refinement": "Después de usar una Hab. Elemental, aumenta el daño del Ataque Normal y Cargado un {{0}}% durante 12 s. Puede acumularse hasta 2 veces."
        },
        {
            "key": "Favonius Lance",
            "name": "Lanza de Favonius",
            "description": "Una lanza hecha con el estilo de los Caballeros de Favonius Su barra es recta y su punta fluye ligeramente como el viento.",
            "refinement": "Los Golpes CRIT tienen un {{0}}% probabilidad de generar una pequeña cantidad de Partículas Elementales, que regenerán 6 de Energía para el personaje. Solo puede ocurrir una vez cada {{1}} s."
        },
        {
            "key": "Royal Spear",
            "name": "Lanza de Caza Real",
            "description": "Una lnaza atesorada por un antiguo aristócrata que gobernó Mondstadt. Aunque nunca ha visto la luz del día, su filo no tiene rival.",
            "refinement": "Al dañar a un oponente, aumenta la Prob. CRIT en un {{0}}%. Acumulable hasta 5 veces. Un vez dado un golpe CRIT, reiniciará todos aquellos acumulados."
        },
        {
            "key": "Dragonspine Spear",
            "name": "Lanza de Espinadragón",
            "description": "Una lanza creada a partir del colmillo de un dragón. Sorprendentemente, es cálida al tacto.",
            "refinement": "Al golpear a los enemigos con Ataques Normales y Cargados, hay un {{0}}% de probabilidad de crear un carámbano sobre ellos. Al caer, el carámbano inflige un {{1}}% de daño de ATQ en el AdE. Si los enemigos están afectados por Cryo, el daño de ATQ infligido será del {{2}}%. Este efecto solo puede ocurrir una vez cada 10 s."
        },
        {
            "key": "Vortex Vanquisher",
            "name": "Lanza Perforanubes",
            "description": "Una afilada lanza que puede atravesar cualquier cosa. Al blandirla, casi se pueden ver las grietas creadas por su punta en el aire.",
            "refinement": "La Protección de Escudo aumenta en un {{0}}%. Durante 8 s después de atacar a un enemigo, el ATQ aumenta en un {{1}}%. Este efecto puede acumularse hasta 5 veces y activarse una vez cada 0.3 s. Además, al estar bajo la protección de un escudo, el efecto de aumento de ATQ aumenta en un 100%."
        },
        {
            "key": "Primordial Jade Winged-Spear",
            "name": "Halcón de Jade",
            "description": "Una lanza de jade hecha por los arcontes, capaz de derrotar a antiguas bestias.",
            "refinement": "Al impactar, aumenta el ataque un {{0}}% durante 6s. Se acumula hasta 7 veces. Este efecto sólo puede ocurrir una vez cada 0.3s. Mientras se tenga el máximo número de efectos acumulados, el daño infligido aumenta un {{1}}%."
        },
        {
            "key": "Skyward Spine",
            "name": "Púa Celestial",
            "description": "Una lanza que simboliza la resolución de Dvalin. La punta de esta arma señala hacia el cielo, pidiendo la fuerza del cielo y el viento.",
            "refinement": "Aumenta la probabilidad crítica un {{0}}% y aumenta la velocidad del ataque normal un 12%. Adicionalmente, los golpes del ataque normal y cargado tienen un 50% de probabilidad de activar una hoja de vacío que inflige {{1}}% del ataque como daño en un área pequeña. Este efecto no puede ocurrir más de una vez cada 2s."
        },
        {
            "key": "Primordial Jade Cutter",
            "name": "Cortador de Jade Primordial",
            "description": "Una espada para ceremonias hecha con esencia de jade puro muy finamente tallado. El aire que se produce al blandirla emite un sonido parecido al de un suspiro.",
            "refinement": "La Vida aumenta en {{0}}%. Adicionalmente provee un Bono de ATQ basado en el {{1}}% de la Vida Max. de su portador."
        },
        {
            "key": "Staff of Homa",
            "name": "Báculo de Homa",
            "description": "A \"firewood staff\" that was once used in ancient and long-lost rituals.",
            "refinement": "HP increased by {{0}}%. Additionally, provides an ATK Bonus based on {{1}}% of the wielder's Max HP. When the wielder's HP is less than 50%, this ATK Bonus is increased by an additional {{2}}% of Max HP."
        }
    ],
    "artifacts": [
        {
            "key": "Adventurer",
            "name": "Aventurero",
            "bonus": [
                {
                    "key": "b1",
                    "bonus": "Vida Máx. +1000."
                },
                {
                    "key": "b2",
                    "bonus": "Al abrir un cofre, se regenera un 30% de Vida durante 5 s."
                }
            ]
        },
        {
            "key": "Traveling Doctor",
            "name": "Médica Itinerante",
            "bonus": [
                {
                    "key": "b1",
                    "bonus": "Curación de personaje +20%."
                },
                {
                    "key": "b2",
                    "bonus": "Al lanzar una Habilidad Definitiva, restaura 20% de Vida."
                }
            ]
        },
        {
            "key": "Lucky Dog",
            "name": "Afortunado",
            "bonus": [
                {
                    "key": "b1",
                    "bonus": "DEF +100."
                },
                {
                    "key": "b2",
                    "bonus": "Recoger Mora restaura 300 de vida."
                }
            ]
        },
        {
            "key": "Resolution of Sojourner",
            "name": "Corazón del Viajero",
            "bonus": [
                {
                    "key": "b1",
                    "bonus": "ATQ +18%."
                },
                {
                    "key": "b2",
                    "bonus": "Incrementa la Tasa Crítica del Ataque Cargado un 30%."
                }
            ]
        },
        {
            "key": "Tiny Miracle",
            "name": "Milagro",
            "bonus": [
                {
                    "key": "b1",
                    "bonus": "Todas las Resistencias Elementales aumentan un 20%."
                },
                {
                    "key": "b2",
                    "bonus": "El Daño Elemental recibido incrementa la Resistencia Elemental correspondiente un 30% por 10s. Sólo puede ocurrir una vez cada 10s."
                }
            ]
        },
        {
            "key": "Brave Heart",
            "name": "Corazón del Guerrero",
            "bonus": [
                {
                    "key": "b1",
                    "bonus": "ATQ +18%."
                },
                {
                    "key": "b2",
                    "bonus": "Incrementa el Daño un 30% contra enemigos con más de 50% de Vida."
                }
            ]
        },
        {
            "key": "Defender’s Will",
            "name": "Corazón del Guardián",
            "bonus": [
                {
                    "key": "b1",
                    "bonus": "DEF +30%."
                },
                {
                    "key": "b2",
                    "bonus": "Incrementa la Resistencia Elemental un 30% por cada elemento presente junto al personaje en el equipo"
                }
            ]
        },
        {
            "key": "Martial Artist",
            "name": "Artista Marcial",
            "bonus": [
                {
                    "key": "b1",
                    "bonus": "Incrementa el daño del ataque normal y cargado un 15%."
                },
                {
                    "key": "b2",
                    "bonus": "Después de usar una habilidad elemental, incrementa el daño del ataque normal y cargado un 25% durante 8s."
                }
            ]
        },
        {
            "key": "Gambler",
            "name": "Jugadora",
            "bonus": [
                {
                    "key": "b1",
                    "bonus": "Incrementa el daño de la habilidad elemental un 20%."
                },
                {
                    "key": "b2",
                    "bonus": "Derrotar a un enemigo tiene un 100% de probabilidad de remover el tiempo de reutilización de la habilidad elemental. Sólo puede ocurrir una vez cada 15s."
                }
            ]
        },
        {
            "key": "Scholar",
            "name": "Erudita",
            "bonus": [
                {
                    "key": "b1",
                    "bonus": "Recarga de Energía +20%."
                },
                {
                    "key": "b2",
                    "bonus": "Ganar energía da 3 de energía a todos los miembros del equipo que tienen un arco o catalizador equipado. Sólo puede ocurrir una vez cada 3s."
                }
            ]
        },
        {
            "key": "Berserker",
            "name": "Berserker",
            "bonus": [
                {
                    "key": "b1",
                    "bonus": "Tasa Crítica +12%."
                },
                {
                    "key": "b2",
                    "bonus": "Cuando la Vida está debajo del 70%, la Tasa Crítica incrementa un 24%."
                }
            ]
        },
        {
            "key": "Instructor",
            "name": "Instructor",
            "bonus": [
                {
                    "key": "b1",
                    "bonus": "Incrementa la Maestría Elemental en 80."
                },
                {
                    "key": "b2",
                    "bonus": "Después de usar una habilidad elemental, incrementa la Maestría Elemental de todos los miembros del equipo en 120 durante 8s."
                }
            ]
        },
        {
            "key": "The Exile",
            "name": "Exiliado",
            "bonus": [
                {
                    "key": "b1",
                    "bonus": "Recarga de Energía +20%."
                },
                {
                    "key": "b2",
                    "bonus": "Usar una habilidad elemental regenera 2 de energía para todos los miembros del equipo (excepto el portador) cada 2s durante 6s. Este efecto no se acumula."
                }
            ]
        },
        {
            "key": "Thundering Fury",
            "name": "Furia del Trueno",
            "bonus": [
                {
                    "key": "b1",
                    "bonus": "Bonificación de daño Electro +15%."
                },
                {
                    "key": "b2",
                    "bonus": "Aumenta el daño causado por reacciones elementales que involucran al elementl Electro un 40%. Activar tales efectos disminuye el tiempo de reutilización de la habilidad elemental por 1s. Sólo puede ocurrir una vez cada 0.8s."
                }
            ]
        },
        {
            "key": "Thundersoother",
            "name": "Domador de Truenos",
            "bonus": [
                {
                    "key": "b1",
                    "bonus": "Aumenta la RES Electro un 40%."
                },
                {
                    "key": "b2",
                    "bonus": "Aumenta el daño contra enemigos afectados por Electro un 35%."
                }
            ]
        },
        {
            "key": "Viridescent Venerer",
            "name": "Sombra Verde Esmeralda",
            "bonus": [
                {
                    "key": "b1",
                    "bonus": "Bonificación de daño Anemo +15%."
                },
                {
                    "key": "b2",
                    "bonus": "Incrementa el daño por remolino un 60%. Reduce al oponente la Resistencia Elemental del elemento del remolino un 40% durante 10s."
                }
            ]
        },
        {
            "key": "Maiden Beloved",
            "name": "Doncella Amada",
            "bonus": [
                {
                    "key": "b1",
                    "bonus": "Efectividad de la Curación del personaje +15%."
                },
                {
                    "key": "b2",
                    "bonus": "Usar una habilidad elemental o habilidad definitiva incrementa la curación recibida por todos los miembros del equipo un 20% durante 10s."
                }
            ]
        },
        {
            "key": "Archaic Petra",
            "name": "Petra Arcaica",
            "bonus": [
                {
                    "key": "b1",
                    "bonus": "Bonificación de daño Geo +15%."
                },
                {
                    "key": "b2",
                    "bonus": "Al obtener un fragmento elemental creado a partir de una reacción de cristalización, todos los miembros del equipo ganan 35% de daño a ese elemento en particular durante 10s. Sólo puede tenerse una bonificación de daño a un elemento obtenida de esta manera a la vez."
                }
            ]
        },
        {
            "key": "Retracing Bolide",
            "name": "Retroceso del Meteorito",
            "bonus": [
                {
                    "key": "b1",
                    "bonus": "Aumenta la fuerza del escudo un 35%."
                },
                {
                    "key": "b2",
                    "bonus": "Al estar protegido por un escudo, gana 40% de daño para el ataque normal y cargado."
                }
            ]
        },
        {
            "key": "Crimson Witch of Flames",
            "name": "Bruja Carmesí en Llamas",
            "bonus": [
                {
                    "key": "b1",
                    "bonus": "Bonificación de daño Pyro +15%."
                },
                {
                    "key": "b2",
                    "bonus": "Aumenta el daño de Sobrecargado y En llamas un 40%. Aumenta el daño de Vaporizar y Derretir un 15%. Usar una habilidad elemental potencia los efectos de conjuntos de 2 piezas un 50% durante 10s. Se puede acumular hasta 3 veces."
                }
            ]
        },
        {
            "key": "Lavawalker",
            "name": "Virtuoso Corredor de Lava",
            "bonus": [
                {
                    "key": "b1",
                    "bonus": "Aumenta la Resistencia Pyro un 40%."
                },
                {
                    "key": "b2",
                    "bonus": "Aumenta el daño contra enemigos afectados por Pyro un 35%."
                }
            ]
        },
        {
            "key": "Bloodstained Chivalry",
            "name": "Caballería Sanguinaria",
            "bonus": [
                {
                    "key": "b1",
                    "bonus": "Daño físico +25%."
                },
                {
                    "key": "b2",
                    "bonus": "Tras derrotar a un oponente, aumenta el daño del ataque cargado un 50% y reduce su costo a 0 durante 10s."
                }
            ]
        },
        {
            "key": "Noblesse Oblige",
            "name": "Ritual Antiguo de la Nobleza",
            "bonus": [
                {
                    "key": "b1",
                    "bonus": "Daño de la habilidad definitiva +20%."
                },
                {
                    "key": "b2",
                    "bonus": "Usar una habilidad definitiva aumenta el ataque de los miembros del equipo un 20% durante 12s. Este efecto no es acumulable."
                }
            ]
        },
        {
            "key": "Gladiator’s Finale",
            "name": "Final del Gladiador",
            "bonus": [
                {
                    "key": "b1",
                    "bonus": "ATQ +18%."
                },
                {
                    "key": "b2",
                    "bonus": "Si el portador usa una espada, mandoble o lanza, incrementa el daño de su ataque normal un 35%."
                }
            ]
        },
        {
            "key": "Wanderer’s Troupe",
            "name": "Orquesta del Errante",
            "bonus": [
                {
                    "key": "b1",
                    "bonus": "Maestría Elemental +80."
                },
                {
                    "key": "b2",
                    "bonus": "Aumenta el daño del ataque cargado un 35% si el personaje usa un catalizador o arco."
                }
            ]
        },
        {
            "key": "Prayers for Illumination",
            "name": "Ritual de la Iluminación",
            "bonus": [
                {
                    "key": "b1",
                    "bonus": "Reduce el tiempo afectado por Pyro un 40%."
                }
            ]
        },
        {
            "key": "Prayers for Destiny",
            "name": "Ritual del Destino",
            "bonus": [
                {
                    "key": "b1",
                    "bonus": "Reduce el tiempo afectado por Hydro un 40%."
                }
            ]
        },
        {
            "key": "Prayers for Wisdom",
            "name": "Ritual de la Sabiduría",
            "bonus": [
                {
                    "key": "b1",
                    "bonus": "Reduce el tiempo afectado por Electro un 40%."
                }
            ]
        },
        {
            "key": "Prayers to Springtime",
            "name": "Ritual de la Primavera",
            "bonus": [
                {
                    "key": "b1",
                    "bonus": "Reduce el tiempo afectado por Cryo un 40%."
                }
            ]
        },
        {
            "key": "Blizzard Strayer",
            "name": "Nómada del Invierno",
            "bonus": [
                {
                    "key": "b1",
                    "bonus": "Bono de Daño Cryo +15%."
                },
                {
                    "key": "b2",
                    "bonus": "Aumenta en un 20% la Prob. CRIT contra los enemigos afectados por Cryo. Si el enemigo está Congelado, la Prob. CRIT aumentará en un 20% adicional."
                }
            ]
        },
        {
            "key": "Heart of Depth",
            "name": "Corazon de las Profundidades",
            "bonus": [
                {
                    "key": "b1",
                    "bonus": "Bono de Daño Hydro +15%."
                },
                {
                    "key": "b2",
                    "bonus": "Tras usar la Habilidad Elemental, aumenta el Daño de Ataque Normal y Ataque Cargado en un 30% durante 15s."
                }
            ]
        },
        {
            "key": "Glacier and Snowfield",
            "name": "Glacier and Snowfield",
            "bonus": [
                {
                    "key": "b1",
                    "bonus": "Cryo DMG Bonus +15%."
                },
                {
                    "key": "b2",
                    "bonus": "Increases Superconduct DMG by 100%. Increases Melt DMG by 15%. Using an Elemental Burst increases Cryo DMG Bonus by 30% for 10s."
                }
            ]
        },
        {
            "key": "Prayers to the Firmament",
            "name": "Ritual del Firmamento",
            "bonus": [
                {
                    "key": "b1",
                    "bonus": "Reduce el tiempo afectado por Anemo un 40%."
                }
            ]
        }
    ],
    "materials": [
        {
            "key": "FreedomA",
            "name": "Enseñanzas de la Libertad"
        },
        {
            "key": "FreedomB",
            "name": "Guía de la Libertad"
        },
        {
            "key": "FreedomC",
            "name": "Filosofía de la Libertad"
        },
        {
            "key": "ProsperityA",
            "name": "Enseñanzas de la Prosperidad"
        },
        {
            "key": "ProsperityB",
            "name": "Guía de la Prosperidad"
        },
        {
            "key": "ProsperityC",
            "name": "Filosofía de la Prosperidad"
        },
        {
            "key": "DilligenceA",
            "name": "Enseñanzas del Esfuerzo"
        },
        {
            "key": "DilligenceB",
            "name": "Guía del Esfuerzo"
        },
        {
            "key": "DilligenceC",
            "name": "Filosofía del Esfuerzo"
        },
        {
            "key": "ResistanceA",
            "name": "Enseñanzas de la Resistencia"
        },
        {
            "key": "ResistanceB",
            "name": "Guía de la Resistencia"
        },
        {
            "key": "ResistanceC",
            "name": "Filosofía de la Resistencia"
        },
        {
            "key": "BalladA",
            "name": "Enseñanzas de la Poesía"
        },
        {
            "key": "BalladB",
            "name": "Guía de la Poesía"
        },
        {
            "key": "BalladC",
            "name": "Filosofía de la Poesía"
        },
        {
            "key": "GoldA",
            "name": "Enseñanzas del Oro"
        },
        {
            "key": "GoldB",
            "name": "Guía del Oro"
        },
        {
            "key": "GoldC",
            "name": "Filosofía del Oro"
        },
        {
            "key": "Tail of Boreas",
            "name": "Cola de Boreas",
            "bossName": "Andrius"
        },
        {
            "key": "Ring of Boreas",
            "name": "Anillo de Boreas",
            "bossName": "Andrius"
        },
        {
            "key": "Spirit Locket of Boreas",
            "name": "Alma de  Boreas",
            "bossName": "Andrius"
        },
        {
            "key": "Dvalin's Plume",
            "name": "Pluma de Stormterror",
            "bossName": "Dvalin"
        },
        {
            "key": "Dvalin's Claw",
            "name": "Garra de Stormterror",
            "bossName": "Dvalin"
        },
        {
            "key": "Dvalin's Sigh",
            "name": "Suspiro de Stormterror",
            "bossName": "Dvalin"
        },
        {
            "key": "Tusk of Monoceros Caeli",
            "name": "Cuerno de Monoceros",
            "bossName": "Tartaglia"
        },
        {
            "key": "Shard of a Foul Legacy",
            "name": "Fragmento de Espada de Legado del mal",
            "bossName": "Tartaglia"
        },
        {
            "key": "Shadow of the Warrior",
            "name": "Sombra del guerrero",
            "bossName": "Tartaglia"
        },
        {
            "key": "DecarabianA",
            "name": "Fragmento de azulejo de Decarabian"
        },
        {
            "key": "DecarabianB",
            "name": "Escombro de la ciudad de Decarabian"
        },
        {
            "key": "DecarabianC",
            "name": "Fragmento de epopeya de Decarabian"
        },
        {
            "key": "DecarabianD",
            "name": "Fragmento de sueño de Decarabian"
        },
        {
            "key": "GuyunA",
            "name": "Arena brillante de Guyun"
        },
        {
            "key": "GuyunB",
            "name": "Piedra reluciente de Guyun"
        },
        {
            "key": "GuyunC",
            "name": "Reliquia de Guyun"
        },
        {
            "key": "GuyunD",
            "name": "Cuerpo divino de Guyun"
        },
        {
            "key": "ElixirA",
            "name": "Perdigones de plomo de la niebla marina"
        },
        {
            "key": "ElixirB",
            "name": "Perdigones de mercurio de la niebla marina"
        },
        {
            "key": "ElixirC",
            "name": "Perdigones de oro de la niebla marina"
        },
        {
            "key": "ElixirD",
            "name": "Perdigones primordiales de la niebla marina"
        },
        {
            "key": "BorealWolfA",
            "name": "Diente de leche de lobo boreal"
        },
        {
            "key": "BorealWolfB",
            "name": "Diente roto de lobo boreal"
        },
        {
            "key": "BorealWolfC",
            "name": "Colmillo roto de lobo boreal"
        },
        {
            "key": "BorealWolfD",
            "name": "Nostalgia del lobo boreal"
        },
        {
            "key": "AerosideriteA",
            "name": "Grano de siderita oscura"
        },
        {
            "key": "AerosideriteB",
            "name": "Lámina de siderita oscura"
        },
        {
            "key": "AerosideriteC",
            "name": "Fragmento de siderita oscura"
        },
        {
            "key": "AerosideriteD",
            "name": "Trozo de siderita oscura"
        },
        {
            "key": "GladiatorA",
            "name": "Grilletes de Diente de León"
        },
        {
            "key": "GladiatorB",
            "name": "Cadena de Diente de León"
        },
        {
            "key": "GladiatorC",
            "name": "Esposas de Diente de León"
        },
        {
            "key": "GladiatorD",
            "name": "Ideales de Diente de León"
        },
        {
            "key": "Crown of Insight",
            "name": "Corona de la Sabiduría"
        },
        {
            "key": "SacrificialKnifeA",
            "name": "Daga de cacería"
        },
        {
            "key": "SacrificialKnifeB",
            "name": "Daga del Agente"
        },
        {
            "key": "SacrificialKnifeC",
            "name": "Daga larga del Inspector"
        },
        {
            "key": "HornA",
            "name": "Cuerno pesado"
        },
        {
            "key": "HornB",
            "name": "Cuerno de bronce negro"
        },
        {
            "key": "HornC",
            "name": "Cuerno con cristal negro"
        },
        {
            "key": "ChaosA",
            "name": "Dispositivo del caos"
        },
        {
            "key": "ChaosB",
            "name": "Circuito del caos"
        },
        {
            "key": "ChaosC",
            "name": "Caldera del caos"
        },
        {
            "key": "LeyLineA",
            "name": "Ramas secas de líneas ley"
        },
        {
            "key": "LeyLineB",
            "name": "Hojas secas de líneas ley"
        },
        {
            "key": "LeyLineC",
            "name": "Brotes de líneas ley"
        },
        {
            "key": "MistGrassA",
            "name": "Polen de neblina"
        },
        {
            "key": "MistGrassB",
            "name": "Hierba brumosa"
        },
        {
            "key": "MistGrassC",
            "name": "Estambre de hierba brumosa"
        },
        {
            "key": "BoneShardA",
            "name": "Fragmento de hueso frágil"
        },
        {
            "key": "BoneShardB",
            "name": "Fragmento de hueso sólido"
        },
        {
            "key": "BoneShardC",
            "name": "Fragmento de hueso fosilizado"
        },
        {
            "key": "MaskA",
            "name": "Máscara dañada"
        },
        {
            "key": "MaskB",
            "name": "Máscara sucia"
        },
        {
            "key": "MaskC",
            "name": "Máscara amenazante"
        },
        {
            "key": "StatuetteA",
            "name": "Gloomy Statuette"
        },
        {
            "key": "StatuetteB",
            "name": "Dark Statuette"
        },
        {
            "key": "StatuetteC",
            "name": "Deathly Statuette"
        },
        {
            "key": "ScrollA",
            "name": "Pergamino guía"
        },
        {
            "key": "ScrollB",
            "name": "Pergamino hechizado"
        },
        {
            "key": "ScrollC",
            "name": "Pergamino maldito"
        },
        {
            "key": "NectarA",
            "name": "Néctar de Megaflora"
        },
        {
            "key": "NectarB",
            "name": "Néctar brillante"
        },
        {
            "key": "NectarC",
            "name": "Néctar energético"
        },
        {
            "key": "ArrowHeadA",
            "name": "Flecha robusta"
        },
        {
            "key": "ArrowHeadB",
            "name": "Flecha afilada"
        },
        {
            "key": "ArrowHeadC",
            "name": "Flecha veterana"
        },
        {
            "key": "CircularInsigniaA",
            "name": "Insignia de cuervo novato"
        },
        {
            "key": "CircularInsigniaB",
            "name": "Insignia de cuervo plateada"
        },
        {
            "key": "CircularInsigniaC",
            "name": "Insignia de cuervo dorada"
        },
        {
            "key": "InsigniaA",
            "name": "Insignia del recluta"
        },
        {
            "key": "InsigniaB",
            "name": "Insignia del sargento"
        },
        {
            "key": "InsigniaC",
            "name": "Insignia del oficial"
        },
        {
            "key": "SlimeA",
            "name": "Condensado de Slime"
        },
        {
            "key": "SlimeB",
            "name": "Babas de Slime"
        },
        {
            "key": "SlimeC",
            "name": "Esencia de Slime"
        },
        {
            "key": "Mora",
            "name": "Mora"
        },
        {
            "key": "BasaltPillar",
            "name": "Pilar de basalto"
        },
        {
            "key": "CleansingHeart",
            "name": "Corazón purificador"
        },
        {
            "key": "EverflameSeed",
            "name": "Semilla de fuego eterno"
        },
        {
            "key": "HoarfrostCore",
            "name": "Núcleo de escarcha"
        },
        {
            "key": "HurricaneSeed",
            "name": "Semilla de Huracán"
        },
        {
            "key": "LightningPrism",
            "name": "Prisma de Relámpago"
        },
        {
            "key": "AgateA",
            "name": "Pedacito de ágata agnidus"
        },
        {
            "key": "AgateB",
            "name": "Fragmento de ágata agnidus"
        },
        {
            "key": "AgateC",
            "name": "Trozo de ágata agnidus"
        },
        {
            "key": "AgateD",
            "name": "Ágata agnidus"
        },
        {
            "key": "DiamondA",
            "name": "Pedacito de diamante brillante"
        },
        {
            "key": "DiamondB",
            "name": "Fragmento de diamante brillante"
        },
        {
            "key": "DiamondC",
            "name": "Trozo de diamante brillante"
        },
        {
            "key": "DiamondD",
            "name": "Diamante brillante"
        },
        {
            "key": "EmeraldA",
            "name": "Nagadus Emerald Sliver"
        },
        {
            "key": "EmeraldB",
            "name": "Nagadus Emerald Fragment"
        },
        {
            "key": "EmeraldC",
            "name": "Nagadus Emerald Chunk"
        },
        {
            "key": "EmeraldD",
            "name": "Nagadus Emerald Gemstone"
        },
        {
            "key": "TopazA",
            "name": "Pedacito de topacio prithiva"
        },
        {
            "key": "TopazB",
            "name": "Fragmento de topacio prithiva"
        },
        {
            "key": "TopazC",
            "name": "Trozo de topacio prithiva"
        },
        {
            "key": "TopazD",
            "name": "Topacio prithiva"
        },
        {
            "key": "JadeA",
            "name": "Pedacito de jade shivada"
        },
        {
            "key": "JadeB",
            "name": "Fragmento de jade shivada"
        },
        {
            "key": "JadeC",
            "name": "Trozo de jade shivada"
        },
        {
            "key": "JadeD",
            "name": "Jade shivada"
        },
        {
            "key": "AmethystA",
            "name": "Pedacito de amatista vajrada"
        },
        {
            "key": "AmethystB",
            "name": "Fragmento de amatista vajrada"
        },
        {
            "key": "AmethystC",
            "name": "Trozo de amatista vajrada"
        },
        {
            "key": "AmethystD",
            "name": "Amatista vajrada"
        },
        {
            "key": "LazuriteA",
            "name": "Pedacito de lazurita varunada"
        },
        {
            "key": "LazuriteB",
            "name": "Fragmento de lazurita varunada"
        },
        {
            "key": "LazuriteC",
            "name": "Trozo de lazurita varunada"
        },
        {
            "key": "LazuriteD",
            "name": "Lazurita varunada"
        },
        {
            "key": "TurquoiseA",
            "name": "Pedacito de turquesa vayuda"
        },
        {
            "key": "TurquoiseB",
            "name": "Fragment de turquesa vayuda"
        },
        {
            "key": "TurquoiseC",
            "name": "Trozo de turquesa vayuda"
        },
        {
            "key": "TurquoiseD",
            "name": "Turquesa vayuda"
        },
        {
            "key": "CallaLily",
            "name": "Lirio cala"
        },
        {
            "key": "Cecilia",
            "name": "Cecilia"
        },
        {
            "key": "CorLapis",
            "name": "Cor Lapis"
        },
        {
            "key": "DandelionSeed",
            "name": "Semilla de diente de léon"
        },
        {
            "key": "GlazeLily",
            "name": "Lirio de cristal"
        },
        {
            "key": "JueyunChili",
            "name": "Chile de Jueyun"
        },
        {
            "key": "NoctilousJade",
            "name": "Jade noctilucoso"
        },
        {
            "key": "PhilanemoMushroom",
            "name": "Seta filanemo"
        },
        {
            "key": "Qingxin",
            "name": "Flor chingxin"
        },
        {
            "key": "SilkFlower",
            "name": "Flor de seda"
        },
        {
            "key": "SmallLampGrass",
            "name": "Lucetta"
        },
        {
            "key": "Starconch",
            "name": "Caracola estelar"
        },
        {
            "key": "Valberry",
            "name": "Valbaya"
        },
        {
            "key": "Violetgrass",
            "name": "Campanita de cristal"
        },
        {
            "key": "WindwheelAster",
            "name": "Margarita voladora"
        },
        {
            "key": "Wolfhook",
            "name": "Gancho de lobo"
        }
    ],
    "debuffs": [
        {
            "key": "Engulfing Storm",
            "name": "Tormenta Envolvente",
            "effect": "Drena continuamente la recarga de energía del personaje."
        },
        {
            "key": "Slowing Water",
            "name": "Agua Ralentizadora",
            "effect": "Aumenta la duración del CD de habilidades del personaje."
        },
        {
            "key": "Smoldering Flames",
            "name": "Llamas Humeantes",
            "effect": "Continuamente inflige daño Pyro al personaje."
        },
        {
            "key": "Condensed Ice",
            "name": "Hielo Condensado",
            "effect": "Aumenta el consumo de «Estamina | Resistencia» del personaje."
        }
    ],
    "reactions": [
        {
            "key": "Burning",
            "name": "Quemadura",
            "effect": "Inflige daño Pyro continuo durante un tiempo."
        },
        {
            "key": "Crystalize",
            "name": "Cristalizar",
            "effect": "Genera fragmentos elementales correspondientes, que proporcionan escudos elementales."
        },
        {
            "key": "Electro-Charged",
            "name": "Electrocargado",
            "effect": "Inflige daño Electro continuo durante un periodo tiempo."
        },
        {
            "key": "Frozen",
            "name": "Congelado",
            "effect": "Congela el objetivo."
        },
        {
            "key": "Melt",
            "name": "Derretir",
            "effect": "Inflige daño extra."
        },
        {
            "key": "Overloaded",
            "name": "Sobrecargado",
            "effect": "Crea una explosión que inflige daño Pyro en área."
        },
        {
            "key": "Superconduct",
            "name": "Superconductor",
            "effect": "Inflige daño Cryo en area y reduce la defensa del objetivo en un 50%"
        },
        {
            "key": "Swirl",
            "name": "Torbellino",
            "effect": "Absorbe el primer elemento con el cual entra en contacto y inflige daño extra elemental y genera mas reacciones elementales."
        },
        {
            "key": "Vaporize",
            "name": "Vaporizar",
            "effect": "Inflige daño elemental adicional."
        }
    ],
    "resonance": [
        {
            "key": "Enduring Rock",
            "name": "Roca Resistente",
            "effect": "La Protección de Escudo aumenta en un 15%. Cuando un personaje está protegido por un escudo, inflige un 15% mas de daño. Al causar daño contra un enemigo, la RES Geo de dicho enemigo se reduce en un 20% durante 15s."
        },
        {
            "key": "Fervent Flames",
            "name": "Llamas Fervientes",
            "effect": "Reduce la duración de efectos con Cryo en 40%. Aumenta ATQ en 25%."
        },
        {
            "key": "Soothing Waters",
            "name": "Agua Medicinal",
            "effect": "Reduce en un 40% la duración de los efectos Pyro sobre ti. Aumenta en un 30% la curación recibida."
        },
        {
            "key": "Impetuous Winds",
            "name": "Vientos Impetuosos",
            "effect": "Disminuye el Coste de Aguante en 15%. Aumenta Vel. de Movimiento en 10%. Reduce el TdE en 5%."
        },
        {
            "key": "High Voltage",
            "name": "Alto Voltaje",
            "effect": "Reduce la duración de efectos con Hydro en 40%. Superconductor, Sobrecarga y Electrocargado tienen 100% de generar una Particula Elemental Electro (TdE 5 s.)."
        },
        {
            "key": "Shattering Ice",
            "name": "Hielo Fragmentado",
            "effect": "Reduce la duración de efectos con Electro en 40%. Aumenta la Prob. CRIT contra oponentes afectados por Cryo o enemigos congelados en un 15%."
        },
        {
            "key": "Protective Canopy",
            "name": "Cubierta Protectora",
            "effect": "Todas las RES elementales + 15%, RES Física + 15%.",
            "description": "Cualquiera de los 4 elementos únicos"
        }
    ]
}