{
    "characters": [
        {
            "key": "Albedo",
            "name": "Albedo",
            "description": "Alquimista en Jefe de los Caballeros de Favonius y Capitán del equipo de investigación. Lo llaman el \"Principe de la Roca Caliza\"",
            "skills": [
                {
                    "key": "s1",
                    "title": "Técnica de espada Favonius - Albor",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Realiza hasta 5 ataques rápidos.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Consume una cierta cantidad de Aguante para lanzar un golpe de espada cruzado.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": "Se lanza desde el aire para golpear el suelo, dañando a los enemigos cercanos e infligiendo Daño en el AdE en el momento del impacto.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Abiogénesis: Isotoma Solar",
                    "description": null,
                    "abilities": [
                        {
                            "name": "Isotoma Solar",
                            "description": "Crea una isotoma solar que inflige Daño Geo en el AdE.",
                            "descriptions": [
                                "Cuando los enemigos situados en el centro del área de la isotoma solar reciben daño, esta se convertirá en una flor fugaz, abriéndose e infligiendo Daño Geo en el AdE proporcional a la DEF de Albedo.",
                                "Solo puede crearse una flor fugaz cada 2 s.",
                                "Cuando un personaje se sitúa sobre la isotoma solar, el poder de Geo se concentrará para formar una plataforma cristalizada de cierta altura sobre la que se podrán mantener los personajes.",
                                "Solo puede existir a la vez una isotoma creada por Albedo. La isotoma solar se considera una creación Geo."
                            ]
                        },
                        {
                            "key": "a2",
                            "description": "Controla la ubicación sobre la que tiene lugar la habilidad.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s3",
                    "title": "Creación: Marea tectónica",
                    "description": "Albedo ordena a sus cristales Geo que exploten, lanzándolos al frente e infligiendo Daño Geo en el AdE. Si en el campo de batalla ya hay una isotoma solar creada por Albedo. creará 7 flores de la muerte dentro del área de la isotoma, provocando una violenta explosión que inflige Daño Geo en el ME.",
                    "abilities": []
                }
            ],
            "passives": [
                {
                    "key": "p1",
                    "title": "Genio de la alquimia",
                    "description": "Al crear materiales de ascensión de arma, hay una probabilidad del 10% de recibir el doble.",
                    "descriptions": []
                },
                {
                    "key": "p2",
                    "title": "Fuerza caliza",
                    "description": "Creación: Marea tectónica aumenta en 125 pts. la Maestría Elemental de los personajes del equipo cercanos durante 10 s.",
                    "descriptions": []
                },
                {
                    "key": "p3",
                    "title": "Sabiduría del homúnculo",
                    "description": "Aumenta en un 25% el daño infligido por la flor fugaz de Abiogénesis: Isotoma solar contra los enemigos con menos del 50% de Vida.",
                    "descriptions": []
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "Flor del Edén",
                    "description": "Cuando explota una flor fugaz de Abiogénesis: Isotoma solar creara por Albedo, este recupera 1.2 pts. de Energía Elemental.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c2",
                    "title": "Eón Fanerozoico",
                    "description": "Al explotar, las flores fugaces de Abiogénesis: Isotoma solar otorgan a Albedo aritmética fatídica durante 30 s:",
                    "secondDescription": "Creacón: Marea tectónica consume la aritmética fatídica, eliminando todas sus acumulaciones y aumentando el daño infligido por las explosiones de Creación: Marea tectónica y de las flores de la muerte.",
                    "descriptions": [
                        "Cada acumulación de aritmética fatídica aumenta el daño de Albedo en una cantidad igual al 30% de su DEF.",
                        "Puede acumularse un máximo de 4 veces."
                    ]
                },
                {
                    "key": "c3",
                    "title": "Gracia de Helios",
                    "description": "Aumenta el nivel de habilidad de Abiogénesis: Isotoma solar +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "Caída divina",
                    "description": "Si los personajes en uso están en el área de la isotoma solar, aumenta en un 30% el daño de sus Ataques Descendientes.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "Marea del Hádico",
                    "description": "Aumenta el nivel de habilidad de Creación: Marea tectónica +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "Tierra purificadora",
                    "description": "Aumenta en un 17% el daño de los personajes si estos están en el área de la isotoma solar y bajo la protección de un escudo creado mediante Cristalización.",
                    "secondDescription": null,
                    "descriptions": []
                }
            ]
        },
        {
            "key": "Amber",
            "name": "Amber",
            "description": "Siempre enérgica y llena de vida, Amber es la mejor exploradora de los Caballeros de Favonius, aunque también es la única...",
            "skills": [
                {
                    "key": "s1",
                    "title": "Arquero divino",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Realiza hasta 5 disparos consecutivos con arco.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": " Dispara un Tiro preciso que inflige mayor daño. Al apuntar, se acumularán llamas en la punta de flecha. Una flecha en llamas totalmente cargada infligirá Daño Pyro.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": "Dispara una lluvia de flechas desde el aire y desciende rápidamente, causando daño a distancia al impactar en el suelo.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Marioneta explosiva",
                    "description": null,
                    "abilities": [
                        {
                            "name": "Baron Bunny",
                            "description": null,
                            "descriptions": [
                                "Se burla de los enemigos cercanos para atraer su atención.",
                                "La Vida Máx. de Barón Bunny aumenta en proporción a la Vida de Amber.",
                                "Cuando es destruido o su temporizador llega a cero, Barón Bunny explota, infligiendo Daño Pyro de Área."
                            ]
                        },
                        {
                            "key": "a2",
                            "description": "Ajusta la dirección de lanzamiento de Barón Bunny. Cuanto más tiempo se mantenga apretado el botón, más lejos se lanzará.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s3",
                    "title": "Lluvia ardiente",
                    "description": "Dispara una lluvia de flechas, infligiendo Daño Pyro de Área continuo.",
                    "abilities": []
                }
            ],
            "passives": [
                {
                    "key": "p1",
                    "title": "Campeona de Vuelo",
                    "description": "Disminuye el consumo de Aguante al planear en un 20%.",
                    "descriptions": []
                },
                {
                    "key": "p2",
                    "title": "¡Puntería final!",
                    "description": "Lluvia ardiente aumenta un 10% de Prob. CRIT y el AdE se expande un 30%.",
                    "descriptions": []
                },
                {
                    "key": "p3",
                    "title": "Disparo preciso",
                    "description": "Al infligir daño en los puntos débiles del enemigo usando Tiro preciso, el ATQ Básico aumenta un 15% durante 10 s.",
                    "descriptions": []
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "¡Una Flecha para Gobernarlos a Todos!",
                    "description": "Lanza 2 flechas por cada Tiro preciso. La segunda flecha inflige 20% del daño de la primera flecha.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c2",
                    "title": "Lanzamiento de Barón Bunny",
                    "description": "¡Un nuevo y mejorado Barón Bunny! Golpear su pie con un Tiro preciso cargado detona inmediatamente a Barón Bunny. Explotarlo manualmente infligirá un 200% de Daño adicional.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c3",
                    "title": "¡Quémalo todo!",
                    "description": "Aumenta el nivel de habilidad de Lluvia ardiente +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "No es una muñeca cualquiera...",
                    "description": "Reduce el TdE de Marioneta explosiva en un 20%, y puede ser utilizada 1 vez más.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "¡Es Barón Bunny!",
                    "description": "Aumenta el nivel de habilidad de marioneta explosiva +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "Fuego Salvaje",
                    "description": "Lluvia ardiente aumenta la Vel. Movimiento y el ATQ Básico de todos los miembros del equipo en un 15% durante 10 s.",
                    "secondDescription": null,
                    "descriptions": []
                }
            ]
        },
        {
            "key": "Ayaka",
            "pending": true,
            "name": "Ayaka",
            "description": "The secretary at Yuehai Pavilion. The blood of the qilin, an illuminated beast, flows within her veins.",
            "skills": [],
            "passives": [],
            "constellations": []
        },
        {
            "key": "Barbara",
            "name": "Bárbara",
            "description": "Todos los habitantes de Mondstadt adoran a Barbara. Ella vio por primera vez la palabra \"ídolo\" en una revista.",
            "skills": [
                {
                    "key": "s1",
                    "title": "Murmullo del agua",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Realiza hasta 4 ataques de salpicaduras de agua que infligen Daño Hydro.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Consume una cierta cantidad de Aguante para inflgir Daño Hydro de Área después de un corto lanzamiento.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": "El poder Hydro se concentra y desciende hacia el suelo, dañando a todos los enemigos en su camino. A su vez, inflige Daño de Área Hydro.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Que empiece el concierto ♪",
                    "description": "Invoca gotas de agua que se asemejan a notas musicales que forman círculos melódicos. Estas infligen Daño Hydro a los enemigos alrededor y los afecta con el estado Mojado.",
                    "abilities": [
                        {
                            "name": "Círculos melódicos",
                            "description": null,
                            "descriptions": [
                                "Los Ataques Normales de Bárbara curan a todos los miembros del grupo y a los personajes aliados cercanos una cierta cantidad de Vida, que aumenta con la Vida Máx. de Bárbara.",
                                "Su Ataque Cargado puede generar 4 veces la cantidad de curación.",
                                "Regenera una cierta cantidad de Vida del personaje actual a intervalos regulares.",
                                "Aplica el estado Mojado al personaje y a los enemigos que entren e ncontacto con él."
                            ]
                        }
                    ]
                },
                {
                    "key": "s3",
                    "title": "Milagro brillante ♪",
                    "description": "Cura una cantidad considerable de Vida a las fuerzas aliadas y a todos los personajes del equipo. La curación aumenta en proporción a la Vida Máx. de Bárbara.",
                    "abilities": []
                }
            ],
            "passives": [
                {
                    "key": "p1",
                    "title": "Con todo mi corazón",
                    "description": "Cuando se logra un \"Perfecto\" en un plato con efectos reconstituyentes, hay un 12% de posibilidades de obtener el doble de cantidad del producto.",
                    "descriptions": []
                },
                {
                    "key": "p2",
                    "title": "Momento de gloria",
                    "description": "Reduce el Coste de Aguante del personaje en un 12% cuando está dentro de los círculos melódicos de Que empiece el concierto ♪.",
                    "descriptions": []
                },
                {
                    "key": "p3",
                    "title": "Bis",
                    "description": "Cuando el personaje recoja un Orbe o una Partícula Elemental, extienede la duración de los círculos metódicos de Que empiece el concierto ♪ en 1 s. Puede extenderse un máximo de 5 s de esta forma.",
                    "descriptions": []
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "Canción de júbilo",
                    "description": "Bárbara obtiene 1 de Energía cada 10 s.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c2",
                    "title": "Explosión de vitalidad",
                    "description": "Reduce el TdE de Que empiece el concierto en 15%; Mientras esté activa la habilidad, el personaje actual obtiene 15% de Bono de Daño Hydro.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c3",
                    "title": "Estrella del Mañana",
                    "description": "Aumenta el nivel de habilidad de Milagro brillante +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "El esfuerzo será mi magia",
                    "description": "Por cada enemigo que Bárbara golpee con su Ataque Cargado, regenera 1 punto de energía. Se puede regenerar un máximo de 5 pts. de energía de esta manera con cualquier Ataque Cargado.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "Vínculo de inocencia",
                    "description": "Aumenta el nivel de habilidad de Que empiece el concierto +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c1",
                    "title": "Dedicándote Todo",
                    "description": "Cuando Bárbara está fuera de escena, si un miembro del equipo ha sido derrotado:",
                    "secondDescription": "Solo puede ocurrir una vez cada 15 min.",
                    "descriptions": [
                        "El personaje revive automáticamente.",
                        "Su vida se restaura en un 100%."
                    ]
                }
            ]
        },
        {
            "key": "Beidou",
            "name": "Beidou",
            "description": "Lider de la Flota Crux Meridianam. Es una jefa bastante desenfadada y franca.",
            "skills": [
                {
                    "key": "s1",
                    "title": "Conquista del océano",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Realiza hasta 5 tajos rápidos.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Sigue consumiendo Aguante para realizar golpes de espada continuos. Cuando termina el Ataque Cargado, hará un movimiento final de dos cortes con fuerza añadida.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": "Se lanza desde el aire para golpear el suelo, dañando a los enemigos a lo largo del camino e infligiendo Daño de Área en el momento del impacto.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Invocadora de mareas",
                    "description": "No hay de qué preocuparse. Si alguien levanta una mano contra ella o sus hombres, ella se vengará diez veces con la espada y el trueno.",
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Acumulando el poder del rayo, Beidou blande su espada hacia delante con fiereza, infligiendo Daño Electro.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Levanta su arma como un escudo, y la absorción máxima de daño se reduce proporcionalmente con la Vida Máx. de Beidou. Cuando la habilidad haya sido liberada o termine su duración, contraatacará con la energía almacenada dentro de la gran espada, infligiendo Daño Electro. Ataca usando la energía almacenada dentro de la gran espada tras su lanzamiento o una vez que expira la duración de esta habilidad, infligiendo Daño Electro, El Daño infligido aumenta con el número de veces que Beidou es atacada mientras dure la habilidad. La mayor bonificación de Daño se obtendrá una vez que este efecto se active dos veces.",
                            "descriptions": [
                                "Tiene 250% de Daño Electro.",
                                "Aplica el Elemento Electro a Beidou tras su activación."
                            ]
                        }
                    ]
                },
                {
                    "key": "s3",
                    "title": "Quiebrantatormentas",
                    "description": "Recalling her slaying of the great beast Haishan. Beidou calls upon that monstrous strength and the lightning to create a Thunderbeast’s Targe around herself, dealing Electro DMG to nearby opponents.",
                    "abilities": [
                        {
                            "name": "Escudo del trueno",
                            "description": null,
                            "descriptions": [
                                "Al golpear con Ataques Normales y Ataques Cargados, crean una descarga de rayo que puede saltar entre enemigos, infligiendo Daño Electro.",
                                "Aumenta la RES a interrupción del personaje y reduce el Daño recibido.",
                                "Dispara un máximo de 1 descarga de rayo por segundo."
                            ]
                        }
                    ]
                }
            ],
            "passives": [
                {
                    "key": "p1",
                    "title": "Conquistador de mareas",
                    "description": "Disminuye el consumo de Aguante al nadar en un 20%.",
                    "descriptions": []
                },
                {
                    "key": "p2",
                    "title": "Castigo divino",
                    "description": "Contraatacar con Invocadora de mareas en el momento preciso de ser golpeado le otorga el Máx. Bono de Daño.",
                    "descriptions": []
                },
                {
                    "key": "p3",
                    "title": "Tormenta eléctrica",
                    "description": "Al lanzar el máximo Bono de Daño con Invocadora de mareas, en los 10s posteriores obtendrás los siguientes efectos:",
                    "descriptions": [
                        "Aumenta el Daño por Ataque Normal y Ataque Cargado en 15%. Vel. de Ataque Normal y Ataque Cargado +15%.",
                        "Reduce drásticamente el tiempo de preparación para Ataques Cargados."
                    ]
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "Cazador de ictiosaurios",
                    "description": "Al activar Quebrantatormentas:",
                    "secondDescription": null,
                    "descriptions": [
                        "Crea un escudo que absorbe el equivalente al 16% de la Vida Máx. en Daño durante 15 s.",
                        "El escudo tiene un 250% de absorción de Daño Electro."
                    ]
                },
                {
                    "key": "c2",
                    "title": "Tormenta sobre el mar turbulento",
                    "description": "Los rayos de Quebrantatormentas rebotan a 2 objetivos adicionales.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c3",
                    "title": "Invocadora de la tormenta",
                    "description": "Aumenta el nivel de habilidad de Invocadora de mareas +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "Venganza súbita",
                    "description": "Durante los siguiente 10 s de ser atacada, el Ataque Normal de Beidou obtiene 20% de Daño electro adicional.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "Caminante de mareas carmesí",
                    "description": "Aumenta el nivel de habilidad de Quebrantatormentas +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "Flagelo del mal",
                    "description": "Mientras esté activa la habilidad de Quebrantatormentas, la RES Electro de los enemigos alrededor se reduce en un 15%.",
                    "secondDescription": null,
                    "descriptions": []
                }
            ]
        },
        {
            "key": "Bennett",
            "name": "Bennett",
            "description": "El chico aventurero de Mondstadt. Su naturaleza amable no va acorde con su mala suerte.",
            "skills": [
                {
                    "key": "s1",
                    "title": "Espada de la suerte",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Realiza hasta 5 ataques rápidos.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Consume una cierta cantidad de Aguante para lanzar un golpe de espada cruzado.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": "Se lanza desde el aire para golpear el suelo, dañando a los enemigos a lo largo del camino e infligiendo Daño de Área en el momento del impacto.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Sobrecarga de pasión",
                    "description": "Bennett concentra el espíritu aventurero y la energía Pyro en su espada. Dependiendo del tiempo de carga, se producen diferentes efectos.",
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Realiza un rápido y ardiente movimiento con su espada, infligiendo Daño Pyro.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Dependiendo de la duración, lanza una habilidad distinta basada en en nivel de carga.",
                            "secondDescription": "Bennett no resulta herido por esta explosión.",
                            "descriptions": [
                                "Nivel 1: Golpea dos veces, infligiendo Daño Pyro y lanzando a los enemigos por los aires.",
                                "Lanza 3 ataques consecutivos que infligen una cantidad significativa de Daño Pyro. El último ataque causa una explosión que lanza tanto a los enemigos como a Bennett por los aires."
                            ]
                        }
                    ]
                },
                {
                    "key": "s3",
                    "title": "Aventura maravillosa",
                    "description": "Bennett salta hacia el enemigo y ataca, infligiendo Daño Pyro y creando un círculo de apoyo moral.",
                    "abilities": [
                        {
                            "name": "Círculo de apoyo moral:",
                            "description": null,
                            "descriptions": [
                                "Si la Vida de un personaje dentro del círculo es igual o inferior al 70%, su vida se regenerará continuamente.",
                                "Si al vida de un personaje dentro del círculo es mayor a 70%, obtendrán un Bono de ATQ igual a un porcentaje del ATQ Básico de Bennett.",
                                "Los personajes dentro del círculo obtendrán el efecto Pyro."
                            ]
                        }
                    ]
                }
            ],
            "passives": [
                {
                    "key": "p1",
                    "title": "Supuestamente seguro",
                    "description": "Reduce en un 25% el tiempo necesario para completar una expedición en Mondstadt.",
                    "descriptions": []
                },
                {
                    "key": "p2",
                    "title": "Resurgimiento de la pasión",
                    "description": "Reduce el TdE de Sobrecarga de pasión en 20%.",
                    "descriptions": []
                },
                {
                    "key": "p3",
                    "title": "Fervor intrépido",
                    "description": "Dentro del área de Aventura maravillosa, Sobrecarga de pasión tiene los siguientes efectos:",
                    "descriptions": [
                        "Su TdE se reduce en un 50%.",
                        "Bennett no será lanzado por los aires con la Carga 2."
                    ]
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "Visión de aventura",
                    "description": "El efecto de aumento de ATQ de Aventura maravillosa ya no tiene restricción de Vida, y el personaje gana un 20% adicional de ATQ Básico.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c2",
                    "title": "Huida desesperada",
                    "description": "Aumenta la Recarga de Energía de Bennett en un 30% cuando la Vida es menor al 70%.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c3",
                    "title": "Pasión ardiente",
                    "description": "Aumenta el nivel de habilidad de Sobrecarga de pasión +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "Calidez inagotable",
                    "description": "Usar un ATQ Normal al ejecutar el segundo ataque del nivel 1 de carga de Sobrecarga de pasión permite realizar un ataque adicional. Este ataque adicional es equivalente al 135% del Daño del segundo ataque.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "Explorador verdadero",
                    "description": "Aumenta el nivel de habilidad de Aventura maravillosa +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "Fuego y coraje",
                    "description": "Si los personaje en uso utilizan espada ligera, mandoble o lanza y se encuentran en el AdE de Aventura maravillosa, dichos personajes obtendrán un 15% de Bono de Daño Pyro. Además, serán imbuidos del Elemento Pyro.",
                    "secondDescription": null,
                    "descriptions": []
                }
            ]
        },
        {
            "key": "Chongyun",
            "name": "Chongyun",
            "description": "Un joven exorcista procedente de una familia de exorcistas. Hace todo lo que puede para reprimir su propia \"positividad congénita\".",
            "skills": [
                {
                    "key": "s1",
                    "title": "Desgracia de los demonios",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Realiza hasta 4 tajos rápidos.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Sigue consumiendo Aguante para realizar golpes de espada giratorios contra los enemigos cercanos. Al final del Ataque Cargado, realizará un golpe de espada más poderoso.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": "Se lanza desde el aire para golpear el suelo, dañando a los enemigos a lo largo del camino e infligiendo Daño de Área en el momento del impacto.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Filo espiritual: Estratos de escarcha Chonghua",
                    "description": "Chongyun golpea el suelo con su gran espada, causando una explosión Cryo en un AdE circular frente a él que inflige daño Cryo. Después de un breve periodo de tiempo, el aire frío creado por la explosión Cryo se concentra en un campo de estratos de escarcha, dentro del cual se imbuye del Elemento Cryo a los personajes que usan espadas ligeras, mandobles y lanzas.",
                    "abilities": []
                },
                {
                    "key": "s3",
                    "title": "Filo espiritual: Estrella cortanubes",
                    "description": "Al crear sellos de mano secretos, Chongyun invoca tres Hojas del espíritu gigantes que caen a la tierra, una tras otra, explotando al golpear el suelo. Cuando las Hojas del espíritu gigantes impactan, infligen Daño Cryo en el AdE.",
                    "abilities": []
                }
            ],
            "passives": [
                {
                    "key": "p1",
                    "title": "Viaje por las nubes",
                    "description": "Reduce en un 25% el tiempo necesario para completar una expedición en Liyue.",
                    "descriptions": []
                },
                {
                    "key": "p2",
                    "title": "Respiración inalterable",
                    "description": "Aumenta un 8% la Vel. de ATQ Normal de los personajes con espadas ligeras, espadas Mandoble o lanzas dentro del campo creado por Filo espiritual: Estratos de escarcha.",
                    "descriptions": []
                },
                {
                    "key": "p3",
                    "title": "Hoja cazaescarcha",
                    "description": "Cuando el campo creado por Filo espiritual: Estratos de escarcha desaparece, invoca otro Filo espiritual para atacar a los enemigos cercanos, infligiendo el 100% del Daño de habilidad de Estratos de escarcha como Daño Cryo AdE. La Res Cryo de los enemigos a los que ataque disminuirá en un 10% durante 8 s.",
                    "descriptions": []
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "Ventisca desatada",
                    "description": "El último Ataque Normal de la secuencia de Chongyun lanza 3 cuchillas de hielo. Cada cuchilla inflige el 50% del ATQ de Chongyun como Daño Cryo a todos los enemigos que se atraviesen.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c2",
                    "title": "Revolución atmosférica",
                    "description": "El TdE de las Hab. Elementales y Definitivas lanzadas dentro del área de escarcha creado por Filo espiritual: Estratos de escarcha se reduce en un 15%.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c3",
                    "title": "Cirro-explosión",
                    "description": "Aumenta el nivel de habilidad de Filo espiritual: Estrella cortanubes +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "Cielos congelados",
                    "description": "Chongyun regenera 1 punto de Energía cada vez que golpea a un enemigo afectado por Cryo. Este efecto solo puede ocurrir una vez cada 2 s.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "El verdadero camino",
                    "description": "Aumenta el nivel de habilidad de Filo espiritual: Estratos de escarcha +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "Ofrenda de las Cuatro Divinidades",
                    "description": "Filo espiritual: Estrella cortanubes inflige un 15% más de Daño a los enemigos con un porcentaje de Vida más bajo que el de Chongyun. Esta habilidad también invocará un Filo espiritual adicional.",
                    "secondDescription": null,
                    "descriptions": []
                }
            ]
        },
        {
            "key": "Diluc",
            "name": "Diluc",
            "description": "El magnate del imperio vinícola de Mondstadt, inigualable en todos los sentidos.",
            "skills": [
                {
                    "key": "s1",
                    "title": "Espada templada",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Realiza hasta 4 tajos rápidos.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Sigue consumiendo Aguante para realizar golpes de espada continuos. Cuando termina el Ataque Cargado, hará un movimiento final de dos cortes con fuerza añadida.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": "Se lanza desde el aire para golpear el suelo, dañando a los enemigos a lo largo del camino e infligiendo Daño de Área en el momento del impacto.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Filo ardiente",
                    "description": "Da un golpe de espada hacia enfrente que inflige Daño Pyro. Esta habilidad puede utilizarse 3 veces consecutivas. Entra en TdE si no se activa después de un periodo corto.",
                    "abilities": []
                },
                {
                    "key": "s3",
                    "title": "Amanecer",
                    "description": "Unas llamas emergen de la espada de Diluc, las cuales derriban a los enemigos cercanos e infligen Daño Pyro. Las llamas convergen en la espada, invocando un fénix que vuela hacia adelante e infligiendo daño Pyro a todos los enemigos en su camino. El fénix explota al llegar a su destino, infligiendo una cantidad significativa de daño Pyro en el AdE. Las llamas que quedan en el arma de Diluc la imbuyen del Elemento Pyro.",
                    "abilities": []
                }
            ],
            "passives": [
                {
                    "key": "p1",
                    "title": "Tradición del Caballero del Amanecer",
                    "description": "Recupera el 15% de los minerales utilizados en la fabricación de espadas Mandoble.",
                    "descriptions": []
                },
                {
                    "key": "p2",
                    "title": "Implacable",
                    "description": "Reduce el Coste de Aguante del Ataque Cargado de Diluc en 50%, y la duración del Ataque Cargado aumenta en 3s.",
                    "descriptions": []
                },
                {
                    "key": "p3",
                    "title": "Bendición del fénix",
                    "description": "El Encantamiento Pyro proporcionado por Amanecer se extiende 4s más. Además, Diluc gana un 20% de Bono de Daño Pyro durante la duración de este efecto.",
                    "descriptions": []
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "Condena",
                    "description": "Aumenta el Daño de Diluc en un 15% contra enemigos con más del 50% de Vida.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c2",
                    "title": "Ardor incesante",
                    "description": "Al recibir daño, Diluc aumenta su ATQ Básico en un 10% y la Vel. ATQ en un 5% durante 10 s. Puede acumularse un máximo de 3 veces, y solo puede ocurrir una vez cada 1.5 s.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c3",
                    "title": "Fuego y acero",
                    "description": "Aumenta el nivel de habilidad de Filo ardiente +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "Flujo llameante",
                    "description": "Lanzar Filo ardiente siguiendo la secuencia aumenta considerablemente el daño infligido. 2s después de lanzar Filo ardiente, aumenta el Daño del siguiente Filo ardiente en un 40% durante 2 s.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "Fénix, heraldo del amanecer",
                    "description": "Aumenta el nivel de habilidad de Amanecer + 3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "Espada llameante, némesis de la oscuridad",
                    "description": "Después de lanzar Filo ardiente, aumenta el Daño y la Vel. de ATQ Normal de los siguientes 2 ataques dentro de los próximos 6 s en 30%. Además, Filo ardiente no interrumpe la secuencia de ataque.",
                    "secondDescription": null,
                    "descriptions": []
                }
            ]
        },
        {
            "key": "Diona",
            "name": "Diona",
            "description": "Una joven cuya sangre no es humana por completo. Es la popular cantinera de la Taberna Cola de Gato.",
            "skills": [
                {
                    "key": "s1",
                    "title": "Puntería de cazador",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Realiza hasta 5 disparos consecutivos con arco.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Dispara un Disparo Preciso que inflige mayor daño. Al apuntar, crea una escarcha que acumula Frío en la punta de la flecha, infligiendo Daño Cryo al liberarlo.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": "Dispara una lluvia de flechas desde el aire y desciende rápidamente, causando daño a distancia al impactar en el suelo.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Zarpazo helado",
                    "description": "Dispara unas garras heladas, infligiendo Daño Cryo a los enemigos y creando un escudo es proporcional a la Vida Máx. De Diona, y su duración depende del número de garras que golpeen a su objetivo.",
                    "abilities": [
                        {
                            "key":"a1",
                            "description": "Dispara 2 veloces garras heladas.",
                            "descriptions": []
                        },
                        {
                            "key":"a2",
                            "description": "Mantener presionado Retrocede rápidamente y dispara 5 garras heladas. Además, genera un escudo que gana un 75% de bono de absorción de Daño.Este escudo tiene un 250% de bono de absorción de Daño Cryo sobre el personaje actual.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s3",
                    "title": "Cóctel Asesino",
                    "description": "Lanza un cóctel helado especial que inflige Daño Cryo en el adE y crea una Bruma embriagadora en un área.",
                    "abilities": [
                        {
                            "name": "Bruma embriagadora",
                            "description": null,
                            "descriptions": [
                                "Inflige Daño Cryo continuo a los enemigos que están en el área.",
                                "La Vida de los personajes que están en el área se regenera continuamente."
                            ]
                        }
                    ]
                }
            ],
            "passives": [
                {
                    "key": "p1",
                    "title": "Refrigerio gratis",
                    "description": "Cuando se logra un \"Perfecto\" en un plato con efectos reconstituyentes, hay un 12% de posibilidades de obtener el doble de cantidad del producto.",
                    "descriptions": []
                },
                {
                    "key": "p2",
                    "title": "Menú secreto de Cola de Gato",
                    "description": "Aumenta en un 10% la Vel. Movimiento y redce en un 10% el Coste de Aguante de los personajes bajo la protección del escudo creado por Zarpazo Helado.",
                    "descriptions": []
                },
                {
                    "key": "p3",
                    "title": "Diversión de los borrachos",
                    "description": "Disminuye en un 10% el ATQ infligido por los enemigos que entran en el área de Cóctel asesino durante 15 s.",
                    "descriptions": []
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "Cóctel de la casa",
                    "description": "Cuando termina el efecto de Cóctel asesino, Diona recupera 15 pts. de Energía Elemental.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c2",
                    "title": "Ronroneo Glacial",
                    "description": "Aumenta en un 15% el Daño de Zarpazo helado y 15% de la absorción de Daño de escudo. Además, al golpear a un enemigo, crea para el resto de personajes cercanos un escudo que absorbe hasta un 50% del Daño de Zarpazo helado durante 5 s.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c3",
                    "title": "¿O-otra copa más?",
                    "description": "Aumenta el nivel de habilidad de Cóctel asesino +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "Asesina de la industria del vino",
                    "description": "Dentro del área de Cóctel asesino, el tiempo de carga de Disparo Preciso de Diona se reduce en un 60%.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "¡Doble de hielo!",
                    "description": "Aumenta el nivel de habilidad de Zarpazo helado +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "Hora de cerrar",
                    "description": "Los personajes que estén dentro del área de Cóctel asesino obtienen uno de los siguientes efectos dependiendo de su Vida:",
                    "secondDescription": null,
                    "descriptions": [
                        "Si su Vida es igual o inferior al 50%, aumenta su Bono de Curación recibida en un 30%",
                        "Si su vida es superior al 50% aumenta la Maestría Elemental en 200 pts."
                    ]
                }
            ]
        },
        {
            "key": "Fischl",
            "name": "Fischl",
            "description": "Una chica misteriosa que se hace llamar \"Princesa del Juicio\". Siempre camina junto a un cuervo oscuro llamado Oz.",
            "skills": [
                {
                    "key": "s1",
                    "title": "Flechas del juicio",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Realiza hasta 5 disparos consecutivos con arco",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Realiza un Tiro Preciso más preciso con daño aumentado. Al apuntar, los espíritus oscuros del Reino de la Noche Eterna atenderán al llamado de su Princesa y se acumularán en la punta de flecha encantada. Cuando esté completamente habitado, el Relámpago del juicio inflige una cantidad considerable de Daño Electro.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": "Dispara una lluvia de flechas al aire antes de caer y golpear el suelo, infligiendo Daño de Área en el momento del impacto.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Vigía de la noche",
                    "description": "Invoca a Oz. El cuervo nocturno compuesto de oscuridad y truenos desciende sobre la tierra, infligiendo Daño Electro en una pequeña AdE. Mientras dure la habilidad, Oz atacará continuamente a los enemigos cercanos con Balas Electro. Mantén presionado para ajustar la ubicación en la que se invocará a Oz. Pulsa de nuevo cuando Oz esté presente para invocarlo al lado de Fischl.",
                    "abilities": []
                },
                {
                    "key": "s3",
                    "title": "Ilusión nocturna",
                    "description": "Invoca a Oz para extender sus alas del crepúsculo y proteger a Fischl. Durante la habilidad, tiene las siguiente propiedades:",
                    "abilities": [
                        {
                            "name": "",
                            "description": null,
                            "descriptions": [
                                "Fischl adquiere la forma de Oz, lo que aumenta considerablemente su Velocidad de Movimiento.Cada enemigo puede ser golpeado solo una vez.",
                                "Inflige Daño Electro a los enemigos cercanos.",
                                "Una vez que finalice la habilidad, Oz permanecerá en el campo de batalla atacando a los enemigos de la Princesa. Si Oz ya está en el campo de batalla, reiniciará su duración."
                            ]
                        }
                    ]
                }
            ],
            "passives": [
                {
                    "key": "p1",
                    "title": "Mi jardín secreto",
                    "description": "Reduce en un 25% el tiempo necesario para completar una expedición en Mondstadt.",
                    "descriptions": []
                },
                {
                    "key": "p2",
                    "title": "Cuervo devoraestrellas",
                    "description": "Cuando Fischl golpea a Oz con una carga completa de Tiro preciso, Oz lanza una Retribución del trueno a los enemigos cercanos, causando Daño Electro de Área igual al 152.7% del daño de la flecha.",
                    "descriptions": []
                },
                {
                    "key": "p3",
                    "title": "Juicio de los pecadores",
                    "description": "Si un personaje desencadena una Reacción Elemental relacionada con Electro cuando Oz está en combate, el enemigo será golpeado con Retribución del trueno, infligiendo Daño Electro igual al 80% del ATQ de Fischl.",
                    "descriptions": []
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "Ojo de cuervo penetrante",
                    "description": "Cuando Oz no está en el campo de batalla, también mira a Fischl a través del Ojo de cuervo. Cuando Fischl daña al enemigo con Ataque Normal, Oz atacará simultáneamente con el Ojo de cuervo e infligirá un 22% de daño.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c2",
                    "title": "Devoradora de pecados",
                    "description": "Vigía de la noche inflige un 200% de daño adicional, y su AdE aumenta en un 50%.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c3",
                    "title": "Alas sombrías",
                    "description": "Aumenta el nivel de habilidad de Alas de vigilancia nocturna +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "Fantasía de la reina",
                    "description": "Al lanzar Ilusión nocturna, inflige un 222% de daño de ATQ de Daño Electro a los enemigos cercanos. Cuando la habilidad termina, Fischl recupera el 20% de su Vida.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "Noche silenciosa",
                    "description": "Aumenta el nivel de habilidad de Ilusión nocturna +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "Ave de la noche eterna",
                    "description": "Aumenta la duración de la invocación de Oz en 2 s. Mientras Oz esté presente, atacará con el personaje actual, e infligirá el 30% del ATQ de Fischl como Daño Electro.",
                    "secondDescription": null,
                    "descriptions": []
                }
            ]
        },
        {
            "key": "Ganyu",
            "pending": true,
            "name": "Ganyu",
            "description": "The secretary at Yuehai Pavilion. The blood of the qilin, an illuminated beast, flows within her veins.",
            "skills": [],
            "passives": [],
            "constellations": []
        },
        {
            "key": "Jean",
            "name": "Jean",
            "description": "La justa y rigurosa Caballera de Dandelion, y Gran Maestra Intendente de los Caballeros de Favonius de Mondstadt.",
            "skills": [
                {
                    "key": "s1",
                    "title": "Técnica de espada Favonius",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Realiza hasta 5 ataques rápidos.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Consume una cierta cantidad de Aguante para desatar un ataque que contiene fuerza Anemo.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": "Se lanza desde el aire para golpear el suelo, dañando a los enemigos a lo largo del camino e infligiendo Daño de Área en el momento del impacto.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Filo de ventisca",
                    "description": "Concentrando el poder del viento en su espada, Jean canaliza una minitormenta, lanzando a los enemigos que se encuentran en la dirección que apunta e infligiendo una gran cantidad de Daño Anemo.",
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Aguante para ordenar al torbellino que atraiga a los enemigos cercanos frente a ella. La dirección de atracción puede ajustarse. El personaje quedará inmóvil mientras dure la habilidad.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s3",
                    "title": "Brisa de Dandelion",
                    "description": "Invoca la protección del viento para crear un Campo de diente de león, empujando a los enemigos cercanos e infligiendo Daño Anemo. Al mismo tiempo, cura de inmediato una gran cantidad de Vida a todos los aliados y miembros del equipo. La cantidad restaurada varía según el ATQ de Jean.",
                    "abilities": [
                        {
                            "name": "Campo de dientes de león",
                            "description": null,
                            "descriptions": [
                                "Regenera continuamente la Vida de un aliado y continuamente otorga a dicho aliado afinidad Anemo.",
                                "Inflige Daño Anemo a los enemigos que entran o salen del Campo."
                            ]
                        }
                    ]
                }
            ],
            "passives": [
                {
                    "key": "p1",
                    "title": "Viento guía",
                    "description": "Cuando se logra un \"Perfecto\" en un plato con efectos reconstituyentes, hay un 12% de posibilidades de obtener el doble de cantidad del producto.",
                    "descriptions": []
                },
                {
                    "key": "p2",
                    "title": "Compañero del viento",
                    "description": "Al golpear, los Ataques Normales tienen un 50% de probabilidad de curar a todos los miembros del grupo un 15% del ATQ de Jean.",
                    "descriptions": []
                },
                {
                    "key": "p3",
                    "title": "Que el viento nos guie",
                    "description": "Después de usar la Brisa de Dandelion regenera el 20% de la Energía elemental.",
                    "descriptions": []
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "Espiral de tempestad",
                    "description": "Al presionar Filo de ventisca por más de 1 s., aumenta la velocidad de atracción e inflige un 40% de Daño adicional.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c2",
                    "title": "Escudo del pueblo",
                    "description": "Cuando Jean recoge un Orbe Elemental o Partícula Elemental, aumenta la Vel. ATQ y la Vel. Movimiento de todos los miembros del equipo en un 15% durante 15 s.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c3",
                    "title": "Cuando sopla el viento del oeste",
                    "description": "Aumenta el nivel de habilidad de Brisa de Dandelion +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "Reino de Dandelion",
                    "description": "La RES Anemo de todos los enemigos dentro del campo de Brisa de Dandelion disminuye en un 40%.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "Ráfaga explosiva",
                    "description": "Aumenta el nivel de habilidad de Filo de ventisca +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "Diente de león, fiel protectora de Mondstadt",
                    "description": "Dentro del campo de Brisa de Dandelion, disminuye el Daño entrante en un 35%. Al salir de él, el efecto dura 3 ataques más o 10s.",
                    "secondDescription": null,
                    "descriptions": []
                }
            ]
        },
        {
            "key": "Kaeya",
            "name": "Kaeya",
            "description": "El gran estratega de los Caballeros de Favonius, con una apariencia algo excéntrica...",
            "skills": [
                {
                    "key": "s1",
                    "title": "Técnica de espada ceremonial",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Realiza hasta 5 ataques rápidos.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Consume una cierta cantidad de Aguante para lanzar un golpe de espada cruzado.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": "Se lanza desde el aire para golpear el suelo, dañando a los enemigos a lo largo del camino e infligiendo Daño de Área en el momento del impacto.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Golpe de escarcha",
                    "description": "Lanza una ráfaga gélida que inflige Daño Cryo a los enemigos frente a Kaeya.",
                    "abilities": []
                },
                {
                    "key": "s3",
                    "title": "Vals gélido",
                    "description": "Al condensar la escarcha en el aire, Kaeya invoca 3 carámbanos que giran a su alrededor. Estos carámbanos seguirán al personaje e infligirán Daño Cryo a los enemigos que se atraviesen.",
                    "abilities": []
                }
            ],
            "passives": [
                {
                    "key": "p1",
                    "title": "Fuerza subyacente",
                    "description": "Disminuye el consumo de Aguante de todos los miembros del equipo al esprintar en un 20%.",
                    "descriptions": []
                },
                {
                    "key": "p2",
                    "title": "Espada de sangre fría",
                    "description": "Al golpear a un enemigo con Golpe de escarcha, Kaeya restaura Vida equivalente al 15% del ATQ.",
                    "descriptions": []
                },
                {
                    "key": "p3",
                    "title": "Corazón glacial",
                    "description": "Cuando Golpe de escarcha congela a un enemigo, el enemigo congelado dejará caer Partículas Elementales adicionales. Cada golpe dará un máximo de 2 Partículas Elementales adicionales.",
                    "descriptions": []
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "Sangre Excelente",
                    "description": "La Prob. CRIT del ATQ Normal y Cargado de Kaeya aumentan en un 15% contra enemigos afectados por Cryo.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c2",
                    "title": "Actuación eterna",
                    "description": "Al derrotar a un enemigo con Vals gélido, aumenta su duración en 2.5 s hasta un máximo de 15 s.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c3",
                    "title": "Baile de escarcha",
                    "description": "Aumenta el nivel de habilidad de Golpe de escarcha + 3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "Beso Congelado",
                    "description": "Cuando la Vida de Kaeya cae por debajo del 20%:",
                    "secondDescription": null,
                    "descriptions": [
                        "Genera un escudo que absorbe Daño igual al 30% de su Vida Máx. durante 20 s.",
                        "El escudo absorberá un 250% del Daño Cryo recibido. Solo puede ocurrir una vez cada 60 s."
                    ]
                },
                {
                    "key": "c5",
                    "title": "Abrazo helado",
                    "description": "Aumenta el nivel de habilidad de Vals gélido +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "Torbellino helado",
                    "description": "Vals gélido produce 1 carámbano adicional y regenera 15 pts. de Energía al ser lanzado.",
                    "secondDescription": null,
                    "descriptions": []
                }
            ]
        },
        {
            "key": "Keqing",
            "name": "Keching",
            "description": "El Equilibrio Terrenal de las Siete Estrellas de Liyue. Tiene su opinión sobre el gobierno de Rex Lapis en Liyue, pero, en verdad, a los dioses les gustan bastante los escépticos como ella.",
            "skills": [
                {
                    "key": "s1",
                    "title": "Estilo Yunlai",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Realiza hasta 5 ataques rápidos.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Consume una cierta cantidad de Aguante para lanzar un golpe de espada cruzado.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": "Se lanza desde el aire para golpear el suelo, dañando a los enemigos a lo largo del camino e infligiendo Daño de Área en el momento del impacto.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Retorno estelar",
                    "description": "Lanza una Cuña relámpago que aniquila a sus enemigos como un rayo veloz.\nCuando la cuña golpea a su objetivo, inflige Daño Electro a los enemigos en un AdE pequeña, y añade una Marca de Cuña en el lugar donde golpea.",
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Mantén pulsado para ajustar la dirección en la que se lanzará la cuña. Las cuñas lanzadas al mantener presionado pueden suspenderse en el aire, permitiendo que Keching salte hacia ellas al usar Retorno estelar por segunda vez.",
                            "descriptions": []
                        },
                        {
                            "name": "Lightning Stiletto",
                            "description": "Si Keching usa Retorno estelar de nuevo o hace un Ataque Cargado durante la habilidad, borrará la Marca de Cuña y producirá diferentes efectos:",
                            "descriptions": [
                                "Si vuelve a usar Retorno Estelar, se teletransportará hasta la ubicación de la marca y desatará un ataque cortante que inflige Daño Electro en el AdE. Al teletransportarse a una cuña lanzada al mantener presionado, Keching ignora los obstáculos del terreno.",
                                "Si Keching usa un Ataque Cargado, desencadenará una serie de cortes de tormenta en la Marca de Cuña, infligiendo Daño Electro en el AdE"
                            ]
                        }
                    ]
                },
                {
                    "key": "s3",
                    "title": "Paseo celestial",
                    "description": "Keching desata el poder del rayo, infligiendo Daño Electro en el AdE. Después, se funde en la sombra de su espada y ataca con una serie de golpes relámpago a los enemigos infligiendo, al mismo tiempo, Daño Electro. El ataque final inflige una gran cantidad de Daño Electro en el AdE.",
                    "abilities": []
                }
            ],
            "passives": [
                {
                    "key": "p1",
                    "title": "Supervisora de la tierra",
                    "description": "Reduce en un 25% el tiempo necesario para completar una expedición en Liyue.",
                    "descriptions": []
                },
                {
                    "key": "p2",
                    "title": "Penitencia del trueno",
                    "description": "Al utilizar Retorno estelar mientras esté presente una cuña relámpago, Keching se imbuye del Elemento Electro durante 5 s.",
                    "descriptions": []
                },
                {
                    "key": "p3",
                    "title": "Dignidad aristocrática",
                    "description": "Al lanzar Paseo celestial, la Prob. CRIT y la Recarga de Energía de Keching incrementan en un 15%. Este efecto dura 8 s.",
                    "descriptions": []
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "Fuerza atronadora",
                    "description": "Volver a lanzar Retorno estelar mientras está presente una Cuña relámpago hace que Keching inflija 50% de su ATQ como Daño Electro en el AdE en el punto de inicio y final al teletransportarse.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c2",
                    "title": "Impuestos desorbitantes",
                    "description": "Cuando los ATQ Normal y Cargado de Keching golpean a los enemigos afectados por Electro, tienen un 50% de probabilidad de producir una Partícula Elemental. Este efecto solo puede ocurrir una vez cada 5 segundos.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c3",
                    "title": "Reforma anticipada",
                    "description": "Aumenta el nivel de habilidad de Paseo celestial +3. Puede ser aumentado hasta Niv. 15",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "Sintonización",
                    "description": "10 s después de que Keching lance una Reacción Elemental relacionada con Electro, aumenta su ATQ en un 25%.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "Luces viajeras",
                    "description": "Aumenta el nivel de habilidad de Retorno estelar +3. Puede ser aumentado hasta Niv. 15",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "Estrella tenaz",
                    "description": "Al hacer un Ataque Normal, un Ataque Cargado, una Habilidad Elemental o una Habilidad Definitiva, Keching obtiene un 6% de Bono de Daño Electro durante 8 s. Los efectos activados por Ataques Normales, Ataques Cargados, Habilidades Elementales y Habilidades Definitivas no se incluirán en dicho bono.",
                    "secondDescription": null,
                    "descriptions": []
                }
            ]
        },
        {
            "key": "Klee",
            "name": "Klee",
            "description": "Una visitante frecuente de los calabozos de los Caballeros de Favonius, la maestra de explosiones de Mondstadt. La llaman \"el Sol Fugitivo\"",
            "skills": [
                {
                    "key": "s1",
                    "title": "¡Buuum!",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Realiza hasta 3 ataques explosivos que infligen Daño Pyro.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Consume una cierta cantidad de Aguante para infligir Daño Pyro en el AdE después de un corto tiempo de lanzamiento.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": "Al acumular poder Pyro, Klee se lanza hacia el suelo desde el aire, dañando a todos los enemigos en su camino. A su vez, inflige Daño Pyro en el AdE.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Bomba saltarina",
                    "description": "¡La Bomba saltarina es un montón de diversión!\nArroja una Bomba saltarina poderosa que puede rebotar hasta tres veces. Cada vez que rebota genera una explosión con Daño Pyro en el AdE.\nDespués de rebotar tres veces, se dividirá en varias Trampas cazabobos. Al tocar al enemigo, las ráfagas explotarán, causando Daño Pyro en el AdE.\nPuede ser usado 2 veces consecutivas.",
                    "abilities": []
                },
                {
                    "key": "s3",
                    "title": "Chispas explosivas",
                    "description": "¡Klee a la carga! Mientras dure la Habilidad, no para de invocar Chispas explosivas que hacen daño a los enemigos cercanos, infligiendo Daño Pyro en el AdE.",
                    "abilities": []
                }
            ],
            "passives": [
                {
                    "key": "p1",
                    "title": "Todos mis tesoros",
                    "description": "Muestra la ubicación de las especialidades de Mondstadt cercanas en el Mini-mapa.",
                    "descriptions": []
                },
                {
                    "key": "p2",
                    "title": "Regalo explosivo",
                    "description": "Cuando Bomba saltarina inflige daño junto con un ATQ Normal, hay un 50% de posibilidades de que Klee obtenga una Flor explosiva. El siguiente ATQ Cargado consumirá esta Flor explosiva sin consumir Aguante. El daño infligido aumentará en un 50%.",
                    "descriptions": []
                },
                {
                    "key": "p3",
                    "title": "Estallido incesante",
                    "description": "Después de asestar un golpe CRIT. con el Ataque Cargado, todos los miembros del equipo reciben 2 pts. de Energía Elemental.",
                    "descriptions": []
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "Explosión en cadena",
                    "description": "Al atacar o usar una habilidad, hay una probabilidad de invocar chispas que atacan al enemigo, las cuales infligen Daño equivalente a 120% del Daño de Chispas explosivas.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c2",
                    "title": "Fragmentos de metralla",
                    "description": "Las trampas cazabobos de Bomba saltarina reducen la DEF de los enemigos en 23% por 10 s.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c3",
                    "title": "Mezcla especial de Klee",
                    "description": "Aumenta el nivel de habilidad de Bomba saltarina +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "¡Bomba va!",
                    "description": "Si el personaje se retira mientras la habilidad Chispas explosivas está activa, creará una explosión que inflige 555% de Daño Pyro de Área.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "Estrella de los bombardeos",
                    "description": "Aumenta el nivel de habilidad de Chispas explosivas +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "¡A la carga!",
                    "description": "Mientras las Chispas explosivas estén activas, los miembros del equipo recuperarán energía elemental; después de activar Chispas explosivas, y por 25 s todos los miembros del equipo reciben 10% de Bono de Daño Pyro.",
                    "secondDescription": null,
                    "descriptions": []
                }
            ]
        },
        {
            "key": "Lisa",
            "name": "Lisa",
            "description": "La perezosa pero sabia bibliotecaria de los Caballeros de Favonius. En realidad, fue considerada por la Academia de Sumeru como su graduada mas sobresaliente en los últimos dos siglos",
            "skills": [
                {
                    "key": "s1",
                    "title": "Toque de relámpago",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Realiza hasta 4 ataques relámpago que infligen Daño Electro.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Consume una cierta cantidad de Aguante para infligir Daño Electro de Área después de un corto tiempo de lanzamiento.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": "El poder Electro se concentra y desciende hacia el suelo, dañando a todos los enemigos en su camino. A su vez, inflige Daño de Área Electro.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Arco violeta",
                    "description": "Canaliza el poder del rayo para eliminar las cosas molestas.",
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Lanza un Orbe del rayo con destino a la Tierra. En el momento del impacto, inflige Daño Electro y acumula una pila de estado conductor (Máx. 3 pilas) a los enemigos en una área pequeña.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Después de un largo tiempo de lanzamiento, llama a la luz de los cielos, infligiendo una gran cantidad de Daño Electro a los enemigos cercanos. Inflige grandes cantidades de daño extra a los enemigos basado en el número de pilas conductoras acumuladas sobre ellos, y elimina el efecto de Conductor.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s3",
                    "title": "Rayo de la rosa",
                    "description": "Invoca una Rosa devastadora que libera un inmenso poder de relámpago y golpea a los oponentes cercanos mientras inflige Daño Electro. Durante su efecto, Rosa devastadora chispea periódicamente relámpagos para atacar a los oponentes cercanos infligiendo Daño Electro.",
                    "abilities": []
                }
            ],
            "passives": [
                {
                    "key": "p1",
                    "title": "Conocimientos farmacéuticos",
                    "description": "Al fabricar una Poción, hay un 20% de probabilidad de recuperar los materiales usados.",
                    "descriptions": []
                },
                {
                    "key": "p2",
                    "title": "Réplica eléctrica",
                    "description": "Al hacer un ATQ cargado, Arco violeta aplica Conductor sobre los enemigos.",
                    "descriptions": []
                },
                {
                    "key": "p3",
                    "title": "Campo de electricidad estática",
                    "description": "Rayo de la rosa reduce la DEF del enemigo en un 15% durante 10 s",
                    "descriptions": []
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "Circuito Infinito",
                    "description": "Al mantener pulsado Arco violeta, Lisa recupera 2 puntos de Energía por cada enemigo golpeado. Se puede regenerar un máximo de 10 pts. de energía de esta manera a la vez.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c2",
                    "title": "Campo Electromagnético",
                    "description": "Al mantener pulsado, Arco violeta tiene los siguiente efectos:",
                    "secondDescription": null,
                    "descriptions": [
                        "Aumenta la DEF en 25%.",
                        "Aumenta la RES a interrupción de Lisa."
                    ]
                },
                {
                    "key": "c3",
                    "title": "Trueno Resonante",
                    "description": "Aumenta el nivel de habilidad de Rayo de la rosa +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "Erupción de Plasma",
                    "description": "Aumenta el número de rayos lanzados por Rayo de la rosa de 1 a 3.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "Electrocución",
                    "description": "Aumenta el nivel de habilidad de Arco violeta +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "Bruja Palpitante",
                    "description": "Al cambiar a Lisa, los enemigos cercanos acumulan 3 cargas de Conductor de Arco violeta. El efecto ocurre una vez cada 5 s.",
                    "secondDescription": null,
                    "descriptions": []
                }
            ]
        },
        {
            "key": "Mona",
            "name": "Mona",
            "description": "Una misteriosa y joven astróloga que se hace llamar \"Astróloga Mona Megistus\". Está convencida de que posee las habilidades para estar a la altura del título. Erudita y orgullosa.",
            "skills": [
                {
                    "key": "s1",
                    "title": "Destino revelado",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Realiza hasta 4 ataques de salpicaduras de agua que infligen Daño Hydro.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Consume una cierta cantidad de Aguante para inflgir Daño Hydro de Área después de un corto lanzamiento.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": "El poder Hydro se concentra y desciende hacia el suelo, dañando a todos los enemigos en su camino. A su vez, inflige Daño de Área Hydro.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Espejismo del agua",
                    "description": "Acumula chorros de agua para crear una Ilusión del Destino.",
                    "abilities": [
                        {
                            "name": "",
                            "description": "La Ilusión tiene las siguientes propiedades especiales:",
                            "descriptions": [
                                "Provoca continuamente de los enemigos cercanos, atrayendo sus ataques.",
                                "Continuamente inflige Daño Hydro a los enemigos cercanos.",
                                "Al terminar su efecto, la Ilusión explota e inflige Daño Hydro en el AdE."
                            ]
                        },
                        {
                            "key": "a2",
                            "description": "Utiliza las corrientes de agua para impulsarse hacia atrás rápidamente antes de conjurar una Ilusión.Solo puede existir una Ilusión creada por Aguas Ilusorias a la vez.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s3",
                    "title": "Órbita divina",
                    "description": "Mona invoca unas olas cristalinas para crear un reflejo del cielo estrellado, aplicando el estado burbuja ilusoria sobre los enemigos en una gran AdE.",
                    "abilities": [
                        {
                            "name": "Búrbuja ilusoria",
                            "description": "Invoca una burbuja estrellada que envuelve a sus enemigos, aplicando el efecto Mojado sobre ellos. La búrbuja inmoviliza a los enemigos más débiles, los cuales no podran moverse. Cuando un enemigo que está bajo los efectos de la burbuja ilusoria recibe daño, se producen los siguientes efectos:",
                            "descriptions": [
                                "Coloca un presagio sobre el enemigo, lo que otorga un bono de daño y tambien aumenta el daño del ataque que lo causa.",
                                "Elimina la burbuja ilusoria, inflingiendo Daño Hydro adicional."
                            ]
                        },
                        {
                            "name": "Presagio",
                            "description": "Mientras dura la habilidad, aumenta el daño que reciben los enemigos",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s4",
                    "title": "Torrente ilusorio",
                    "description": null,
                    "abilities": [
                        {
                            "name": "Reemplazo de Esprintar",
                            "description": "Cuando está bajo el efecto del Torrente ilusorio, Mona puede moverse a gran velocidad sobre el agua. Aplica el estado de Mojado a los enemigos cercanos cuando reaparece.",
                            "descriptions": []
                        }
                    ]
                }
            ],
            "passives": [
                {
                    "key": "p1",
                    "title": "Principio de astrología",
                    "description": "Al fabricar materiales de ascensión de Arma, hay un 25% de probabilidad de recuperar los materiales usados.",
                    "descriptions": []
                },
                {
                    "key": "p2",
                    "title": "¡Atrápame si puedes!",
                    "description": "Tras haber usado Torrente ilusorio durante 2 s, si hay algún enemigo cerca, Mona creará automáticamente un fantasma. Un fantasma creado de esta manera durará 2 s, y su daño de explosión será igual al 50% del daño de Espejismo del agua.",
                    "descriptions": []
                },
                {
                    "key": "p3",
                    "title": "¡Que el destino decida!",
                    "description": "Incrementa adicionalmente el Bono de Daño Hydro de Mona. Aumenta el equivalente al 20% de su tasa de Recarga de Energía.",
                    "descriptions": []
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "Profecía de sumersión",
                    "description": "Los efectos de reacciones elementales relacionadas con Hydro se mejoran durante 8 s después de que un personaje golpee a un enemigo afectado por Presagio:",
                    "secondDescription": null,
                    "descriptions": [
                        "El Daño por Electrocargado aumenta en un 15%.",
                        "El Daño por Vaporización aumenta en un 15%.",
                        "El Daño por Torbellino Hydro aumenta en un 15%.",
                        "La duración del efecto Congelado en enemigos aumenta en un 15%."
                    ]
                },
                {
                    "key": "c2",
                    "title": "Cadena lunar",
                    "description": "Al golpear con un ATQ normal, hay un 20% de probabilidad de que vaya seguido automáticamente por un Ataque Cargado. Este efecto solo puede ocurrir una vez cada 5 segundos.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c3",
                    "title": "Revolución incesante",
                    "description": "Aumenta el nivel de habilidad de Órbita divina +3. Puede ser aumentada hasta Niv. 15",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "Profecía del fin",
                    "description": "Cuando un personaje ataca a un enemigo afectado por un Presagio, la Prob. CRIT del personaje aumenta en un 15%.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "Burla del destino",
                    "description": "Aumenta el nivel de habilidad de Aguas ilusorias +3. Puede ser aumentada hasta Niv. 15",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "Retórica de la calamidad",
                    "description": "Al ingresar en Torrente Ilusorio, Mona obtiene un aumento del 60% de Daño en su próximo Ataque Cargado por cada segundo que se mueve. Se puede lograr un máximo de 180% de Bono de Daño de esta manera. El efecto dura menos de 8 s.",
                    "secondDescription": null,
                    "descriptions": []
                }
            ]
        },
        {
            "key": "Ningguang",
            "name": "Ninguang",
            "description": "Ninguang es conocida como el \"Equilibrio Celestial\", es miembro de las \"Siete Estrellas de Liyue\". Su riquza es insuperable en todo Teyvat",
            "skills": [
                {
                    "key": "s1",
                    "title": "Lanzamiento centelleante",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Dispara gemas que infligen Daño Geo. Al golpear, eso le otorga a Ninguang un jade estelar",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Consume una cierta cantidad de Aguante para disparar una gema gigante que inflige Daño Geo. Si Ninguang tiene algún jade estelar, lanzar un Ataque Cargado también disparará el jade estelar contra el enemigo, causando Daño adicional",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": "Al acumular poder Geo, Ninguang se lanza hacia el suelo desde el aire, dañando a todos los enemigos en su camino. Inflige Daño Geo en el AdE en el momento del impacto.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Pantalla de jade",
                    "description": "Ninguang crea una Pantalla de jade de oro y obsidiana de gran opulencia, infligiendo Daño Geo en el AdE.",
                    "abilities": [
                        {
                            "name": "Pantalla de jade",
                            "description": "La Pantalla de jade se considera una creación Geo y puede ser usada para bloquear ciertos ataques, pero no se puede escalar. Solo puede existir una Pantalla de jade a la vez.",
                            "descriptions": [
                                "Bloquea los proyectiles enemigos.",
                                "La duración de la pantalla es proporcional a la Vida Máx de Ninguang."
                            ]
                        }
                    ]
                },
                {
                    "key": "s3",
                    "title": "Devastaestrellas",
                    "description": "Ninguang reúne piedras preciosas a su alrededor y las destruye a la vez, repartiéndolas entre todos los enemigos cercanos e infligiendo Daño Geo masivo. Si Devastaestrellas se lanza cuando una Pantalla de jade está cerca, la Pantalla de jade disparará proyectiles de gemas adicionales al mismo tiempo.",
                    "abilities": []
                }
            ],
            "passives": [
                {
                    "key": "p1",
                    "title": "Registro de tesoros maravillosos",
                    "description": "Muestra la ubicación de los minerales cercanos en el Mini-mapa (hierro, hierro blanco, cristal, cristal mágico y argento estelar).",
                    "descriptions": []
                },
                {
                    "key": "p2",
                    "title": "Plan B",
                    "description": "Cuando está en posesión de jades estelares, el Ataque Cargado de Ninguang no consume Aguante.",
                    "descriptions": []
                },
                {
                    "key": "p3",
                    "title": "Reserva estratégica",
                    "description": "Los personajes que pasen a través de la Pantalla de jade obtienen un 12% de Bono de Daño Geo por 10 s.",
                    "descriptions": []
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "Fragmentos perforadores",
                    "description": "Los Ataques Normales infligen daño de área.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c2",
                    "title": "Efecto choque",
                    "description": "Al desintegrarse la Pantalla de jade, se elimina el TdE. Solo puede ocurrir una vez cada 6 segundos.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c3",
                    "title": "Su Majestad, el Equilibrio Celestial",
                    "description": "Aumenta el nivel de habilidad de Devastaestrellas +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "Excelente sea el jade, que eclipsa todo a sus pies",
                    "description": "Pantalla de jade aumenta la RES elemental de los personajes cercanos en un 10%.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "Invencible sea la pantalla de jade",
                    "description": "Aumenta el nivel de habilidad de Pantalla de jade +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "Grandiosas sean las Siete Estrellas",
                    "description": "Al lanzar Devastaestrellas, Ninguang obtiene 7 jades estelares.",
                    "secondDescription": null,
                    "descriptions": []
                }
            ]
        },
        {
            "key": "Noelle",
            "name": "Noelle",
            "description": "La criada de confianza de los Caballeros de Favonius, sueña con convertirse algún dia en caballera de la orden.",
            "skills": [
                {
                    "key": "s1",
                    "title": "Técnica de espada Favonius - Criada",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Realiza hasta 4 tajos rápidos.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Sigue consumiendo Aguante para realizar golpes de espada giratorios contra los enemigos cercanos. Al final del Ataque Cargado, realizará un golpe de espada más poderoso.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": "Se lanza desde el aire para golpear el suelo, dañando a los enemigos a lo largo del camino e infligiendo Daño de Área en el momento del impacto.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Guardiana del corazón",
                    "description": "Invoca una armadura de roca la cual inflige Daño Geo en los oponentes alrededor y absorbe el daño. El Daño absorbido aumenta en proporción a la DEF de Noelle.",
                    "abilities": [
                        {
                            "name": "",
                            "description": "El Escudo tiene los siguientes efectos:",
                            "descriptions": [
                                "Cuando los Ataques Normales y Ataques Cargados de Noelle golpean un objetivo, hay una posibilidad de regenerar Vida a todos los miembros del equipo. La cantidad de Vida curada es proporcional a la DEF de Noelle.",
                                "Aplica el elemento Geo al personaje.",
                                "Posee un 250% de eficiencia de absorción contra Daño Geo."
                            ]
                        }
                    ]
                },
                {
                    "key": "s3",
                    "title": "Hora de limpiar",
                    "description": "Al reunir el poder de la roca alrededor de su arma, Noelle golpea a los enemigos que la rodean dentro de un AdE de gran tamaño e inflige Daño Geo.",
                    "abilities": [
                        {
                            "name": "",
                            "description": "Después, Noelle obtiene los siguientes efectos:",
                            "descriptions": [
                                "Ataque con mayor AdE.",
                                "Convierte el Daño de ataque en Daño Geo.",
                                "El incremento del ATQ es proporcional a su DEF."
                            ]
                        }
                    ]
                }
            ],
            "passives": [
                {
                    "key": "p1",
                    "title": "Dedicación de la criada",
                    "description": "Cuando se logra un \"Perfecto\" en un plato con efectos de defensa, hay un 12% de posibilidades de obtener el doble de cantidad del producto.",
                    "descriptions": []
                },
                {
                    "key": "p2",
                    "title": "De todo corazón",
                    "description": "Cuando Noelle está fuera de escena, si la Vida del personaje activo es inferior al 30%, ocurrirán automáticamente los siguientes efectos: El personaje recibirá inmediatamente un escudo que absorbe el daño equivalente al 400% de DEF de Noelle. Este escudo puede durar hasta 20 s y se puede activar una vez cada 60 s.",
                    "descriptions": []
                },
                {
                    "key": "p3",
                    "title": "Pulcra y eficaz",
                    "description": "Cuando Noelle inflige daño a los enemigos con ATQ Normal o Cargado, el TdE de Guardiana del corazón se reducirá 1 s cada 4 golpes. Infligir daño a varios enemigos al mismo tiempo se considera un solo movimiento de ataque.",
                    "descriptions": []
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "Yo te cubro",
                    "description": "Al atacar estando en los estados de Hora de limpiar y Guardiana del corazón, el efecto de restauración de Vida de Guardiana del corazón será del 100%.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c2",
                    "title": "Torbellino de la criada",
                    "description": "Reduce el coste de Aguante del ATQ Cargado de Noelle un 20%, aumentando el daño infligido un 15%.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c3",
                    "title": "Sin un rasguño",
                    "description": "Aumenta el nivel de habilidad de Guardiana del corazón +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "Limpieza obligada",
                    "description": "Cuando Guardiana del corazón termina o se rompe debido al daño, inflige un 400% de Daño Geo a los enemigos cercanos.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "Experta en limpieza",
                    "description": "Aumenta el nivel de habilidad de Hora de limpiar +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "Debe quedar impoluto",
                    "description": "Hora de limpiar aumenta la DEF de Noelle un 50%; Además, durante la duración de la habilidad, la duración se extendrá en 1 s por cada enemigo noqueado (máx. 10 s).",
                    "secondDescription": null,
                    "descriptions": []
                }
            ]
        },
        {
            "key": "Qiqi",
            "name": "Qiqi",
            "description": "Una aprendiz y recolectora de hierbas en la Farmacia Bubu. Una zombi con una tez blanca como el hueso, de pocas palabras y emociones.",
            "skills": [
                {
                    "key": "s1",
                    "title": "Técnica de espada antigua",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Realiza hasta 5 ataques rápidos.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Consume cierta cantidad de Aguante para lanzarse al frente, infligiendo daño a los enemigos en el camino.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": "Se lanza desde el aire para golpear el suelo, dañando a los enemigos a lo largo del camino e infligiendo Daño de Área en el momento del impacto.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Magia Adeptus: Heraldo de la escarcha",
                    "description": "Usando el Talismán de sangre helada, Qiqi invoca al Heraldo de la escarcha, infligiendo Daño Cryo a todos los enemigos cercanos.",
                    "abilities": [
                        {
                            "name": "Heraldo de la escarcha:",
                            "description": "",
                            "descriptions": [
                                "Cuando Qiqi golpea a un objetivo con sus Ataques Normales o Cargados, regenera Vida para todos los miembros del equipo y todos los personajes aliados cercanos. La cantidad de Vida regenerada dependerá del ATQ de Qiqi.",
                                "Regenera una cierta cantidad de Vida del personaje actual a intervalos regulares.",
                                "Sigue al personaje actual para infligir Daño Cryo a todos los enemigos que se encuentre a su paso."
                            ]
                        }
                    ]
                },
                {
                    "key": "s3",
                    "title": "Magia Adeptus: Preservadora de la fortuna",
                    "description": "Qiqi libera el poder Adeptus sellado dentro de su cuerpo, marcando a los enemigos cercanos con un Talismán de conservación de la fortuna que inflige Daño Cryo",
                    "abilities": [
                        {
                            "name": " Talismán de conservación de la fortuna",
                            "description": "Cuando los enemigos marcados con el Talismán reciben Daño, el personaje que infligió el daño regenera Vida.",
                            "descriptions": []
                        }
                    ]
                }
            ],
            "passives": [
                {
                    "key": "p1",
                    "title": "Elixir de vida",
                    "description": "Cuando un personaje bajo el efecto de Arte de Adeptus: Heraldo de la escarcha activa una Reacción Elemental, aumenta su Bono de Curación recibida en un 20% durante 8 s.",
                    "descriptions": []
                },
                {
                    "key": "p2",
                    "title": "Un vistazo al arcano",
                    "description": "Cuando Qiqi golpea a enemigos con Ataque Normal o Ataque Cargado, tiene un 50% de posibilidad de ponerles un Talismán de conservación de la fortuna durante 6 s. Este efecto solo puede activarse una vez cada 30 s.",
                    "descriptions": []
                },
                {
                    "key": "p3",
                    "title": "Recuerdos de una vida pasada",
                    "description": "Muestra la ubicación de las especialidades de Liyue cercanas en el Mini-mapa.",
                    "descriptions": []
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "Ascetismo de la escarcha",
                    "description": "Qiqi regenera 2 pts. de Energía cuando el Heraldo de la escarcha golpea a un enemigo marcado por un Talismán de conservación de la fortuna.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c2",
                    "title": "Frío Polar",
                    "description": "El Daño del ATQ Normal y Cargado de Qiqi aumentan en un 15% contra enemigos afectados por Cryo.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c3",
                    "title": "Mandato celestial",
                    "description": "Aumenta el nivel de habilidad de Arte de Adeptus: Preservadora de la fortuna +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "Supresión Divina",
                    "description": "Reduce en un 20% el ATQ de los objetivos marcados por el talismán de conservación de la fortuna.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "Flor de Loto Carmesí",
                    "description": "Aumenta el nivel de habilidad de Arte de Adeptus: Heraldo de la escarcha +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "Rito de la resurrección",
                    "description": "Al lanzar la habilidad de Arte de Adeptus: Preservadora de la fortuna, revive a todos los personajes derrotados y regenera un 50% de Vida. Solo puede ocurrir una vez cada 15 min.",
                    "secondDescription": null,
                    "descriptions": []
                }
            ]
        },
        {
            "key": "Razor",
            "name": "Razor",
            "description": "Un niño que vive entre los lobos en el Reino de los Lobos de Mondstadt, lejos de la civilización. Es ágil como un relámpago.",
            "skills": [
                {
                    "key": "s1",
                    "title": "Colmillo de acero",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Realiza hasta 4 tajos rápidos.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Sigue consumiendo Aguante para realizar golpes de espada giratorios contra los enemigos cercanos. Al final del Ataque Cargado, realizará un golpe de espada más poderoso.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": "Se lanza desde el aire para golpear el suelo, dañando a los enemigos a lo largo del camino e infligiendo Daño de Área en el momento del impacto.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Garra y trueno",
                    "description": "Caza su presa usando las técnicas que le enseñó su maestro y su Lupical.",
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Mueve la Garra del lobo del trueno, infligiendo Daño Electro a los enemigos frente a Razor. Al golpear a un enemigo, Razor ganará una Insignia Electro, que aumentará su Recarga de Energía. Razor puede tener hasta 3 Insignias Electro simultáneamente. Ganar una nueva Insignia Electro refrescará su duración.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Reúne energía eléctrica para desatar una tormenta de rayos sobre una pequeña área, infligiendo una gran cantidad de Daño Electro, y elimina todas las Insignias Electro de Razor. Cada Insignia Electro eliminada de esta manera se convertirá en Energía Elemental de Razor.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s3",
                    "title": "Colmillo de relámpago",
                    "description": "Invoca al Lobo interior, infligiendo Daño Electro a todos los oponentes cercanos. Esto elimina todas las Insignias Electro de Razor, que se convertirán en energía elemental. El Lobo interior luchará junto a Razor mientras dure la habilidad.",
                    "abilities": [
                        {
                            "name": "Lobo interior",
                            "description": "Estos efectos terminan cuando Razor abandona el campo de batalla. Al hacerlo, obtendrá de vuelta 10 pts. de Energía de acuerdo con la duración restante de la habilidad.",
                            "descriptions": [
                                "Golpea junto con los Ataques Normales de Razor, infligiendo Daño Electro.",
                                "Aumenta la Vel. ATQ de Razor y su RES Electro.",
                                "Hace que Razor sea inmune al Daño infligido por el estado Electrocargado.",
                                "Desactiva los ataques cargados de Razor.",
                                "Aumenta la RES a interrupción de Razor."
                            ]
                        }
                    ]
                }
            ],
            "passives": [
                {
                    "key": "p1",
                    "title": "Velocidad de lobo",
                    "description": "Disminuye el consumo de Aguante de todos los miembros del equipo al esprintar en un 20%.",
                    "descriptions": []
                },
                {
                    "key": "p2",
                    "title": "Despertar",
                    "description": "Reduce el TdE en Garra y trueno un 18%. Al lanzar Colmillo de relámpago reiniciará automáticamente el TdE de Garra y trueno.",
                    "descriptions": []
                },
                {
                    "key": "p3",
                    "title": "Hambre",
                    "description": "Cuando la Energía Elemental de Razor es inferior al 50%, la Recarga de Energía aumenta un 30%.",
                    "descriptions": []
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "Naturaleza del Lobo",
                    "description": "Recoger un Orbe o Partícula Elemental incrementa el daño de Razor un 10% durante 8 segundos.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c2",
                    "title": "Supresión",
                    "description": "Incrementa la tasa crítica contra enemigos con menos del 30% de su PS en un 10%.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c3",
                    "title": "Compañía del Alma",
                    "description": "Incrementa el nivel de Colmillo de relámpago por 3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "Mordisco",
                    "description": "Al invocar Garra y trueno, los enemigos golpeados verán su defensa disminuida un 15% durante 7 segundos.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "Garras afiladas",
                    "description": "Incrementa el nivel de Garra y trueno por 3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "Lupus Fulguris",
                    "description": "Cada 10 segundos, el ataque de espada de Razor se carga, causando que el siguiente ataque normal libere un relámpago que inflige 100% del ataque de Razor como daño Electro. Cuando Razor no está usando Colmillo de relámpago, un golpe de rayo sobre un enemigo hará que Razor gane Sigilo Electro para Garra y trueno.",
                    "secondDescription": null,
                    "descriptions": []
                }
            ]
        },
        {
            "key": "Sucrose",
            "name": "Sacarosa",
            "description": "Una alquimista e investigadora de la escuela de bioalquimia que siente curiosidad por todo.",
            "skills": [
                {
                    "key": "s1",
                    "title": "Creación del Espíritu del Viento",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Realiza hasta 4 ataques usando Espíritus del Viento, que infligen Daño Anemo.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Consume una cierta cantidad de Aguante e inflige Daño Anemo en el AdE después de un corto tiempo de lanzamiento.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": "Al llamar a los Espíritus del Viento, Sacarosa se lanza hacia el suelo desde el aire, dañando a todos los enemigos en su camino. Inflige Daño Anemo en el AdE al impactar con el suelo.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Creación del espíritu del viento: Experimento 6308",
                    "description": "Invoca un pequeño Espíritu del Viento que inflige Daño Anemo a los enemigos en un AdE, arrastrándolos hacia la ubicación del Espíritu del Viento antes de lanzarlos por los aires.",
                    "abilities": []
                },
                {
                    "key": "s3",
                    "title": "Creación del espíritu del viento prohibida: Isomorfo 75 tipo II",
                    "description": "Sacarosa arroja un brebaje inestable que crea un Gran Espíritu del Viento. Durante la habilidad, el Gran Espíritu del Viento atrae y arroja a los enemigos cercanos, infligiendo Daño Anemo en el AdE",
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Si el espíritu del Viento entra en contacto con Hydro/Pyro/Cryo/Electro, infligirá Daño elemental adicional de ese tipo. El cambio elemental solo puede ocurrir una vez por uso.",
                            "descriptions": []
                        }
                    ]
                }
            ],
            "passives": [
                {
                    "key": "p1",
                    "title": "Invención inestable",
                    "description": "Al crear materiales para personaje y armas, hay un 10% de probabilidad de recibir el doble",
                    "descriptions": []
                },
                {
                    "key": "p2",
                    "title": "Conversión de catalizador",
                    "description": "Cuando Sacarosa active un Torbellino, aumentará la Maestría Elemental de todos los miembros del equipo con el elemento correspondiente en 50 pts. por los próximos 8 s.",
                    "descriptions": []
                },
                {
                    "key": "p3",
                    "title": "Mollis Favonius",
                    "description": "Cuando Creación del espíritu del viento: Experimento 6308 o Creación del espíritu del viento prohibida: Isomorfo 75 tipo II golpee a un enemigo, aumenta la Maestría Elemental de otros miembros del equipo con base en el 20% de Maestría Elemental de Sacarosa durante 8 s.",
                    "descriptions": []
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "Cúmulo de campo de vacío",
                    "description": "Aumenta las cargas de Creación del espíritu del viento: Experimento 6308 en 1.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c2",
                    "title": "Bett - Forma no consolidada",
                    "description": "Aumenta en 2 s la duración de Creación del espíritu del viento prohibida: Isomorfo 75 tipo II.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c3",
                    "title": "Alquimista infalible",
                    "description": "Aumenta el nivel de habilidad de Creación del espíritu del viento: Experimento 6308 +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "Alquemanía",
                    "description": "Por cada 7 Ataques Normales y Cargados de Sacarosa, el TdE de Creación del espíritu del viento: Experimento 6308 se reduce de 1 a 7 s.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "Precaución: frasco ordinario",
                    "description": "Aumenta el nivel de habilidad de Creación del espíritu del viento prohibida: Isomorfo 75 tipo II +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "Entropía caótica",
                    "description": "Si Creación del espíritu del viento prohibida: Isomorfo 75 tipo II desencadena un cambio elemental, todos los miembros del equipo obtienen un 20% de Bono de Daño Elemental del elemento absorbido correspondiente mientras dure la habilidad.",
                    "secondDescription": null,
                    "descriptions": []
                }
            ]
        },
        {
            "key": "Tartaglia",
            "name": "Tartaglia",
            "description": "El undécimo de los Once, llamado \"Nobile\". Famoso por ganar miles de peleas.",
            "skills": [
                {
                    "key": "s1",
                    "title": "Torrente cortante",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": " Realiza hasta 6 disparos consecutivos con arco.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Realiza un ataque más preciso, infligiendo más daño con Disparo Preciso. Mientras se apunta, el poder de Hydro se acumulará en la punta de la flecha. Una flecha totalmente cargada con un torrente infligirá Daño Hydro al golpear, y aplicará el estado de Obstrucción del flujo.",
                            "descriptions": []
                        },
                        {
                            "name": "Obstrucción del flujo",
                            "description": "Inflige Daño Hydro en el AdE cuando Tartaglia ataca a un objetivo afectado por Obstrucción del flujo. El daño infligido por este estado se considera daño de Ataque Normal.",
                            "descriptions": [
                                "Obstrucción del flujo Destello: cuando se dispara un Disparo Preciso totalmente cargado contra un enemigo bajo los efectos de Obstrucción del flujo, inflige daño continuo en el AdE. La Obstrucción del flujo: Destello solo podrá activarse una vez cada 0.7 s.",
                                "Obstrucción del flujo Explosión: al derrotar a un enemigo bajo los efectos de Obstrucción del flujo, se provocará una explosión Hydro que aplicará dicho efecto sobre los enemigos cercanos."
                            ]
                        },
                        {
                            "key": "a4",
                            "description": "Desciende rápidamente desde el aire y dispara una lluvia de flechas, infligiendo Daño en el AdE al impactar contra el suelo. No es posible activar el Ataque descendiente cuando Tartaglia se encuentra en posición de combate cuerpo a cuerpo de Legado del mal: Olas furiosas.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Legado del mal: Olas furiosas",
                    "description": "Lanza un arsenal hecho de agua pura que inflige Daño Hydro a los enemigos cercanos y entra en posición de combate cuerpo a cuerpo.\nEn esta posición, los ataques Normales y Cargados de Tartaglia se convierten en Daño Hydro, el cual no puede ser sustituido imbuyéndolo de otro elemento, y cambian:",
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Realiza hasta 6 tajos Hydro consecutivos.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Al consumir una cierta cantidad de Aguante, lanza un golpe de espada cruzado que inflige Daño Hydro.",
                            "descriptions": []
                        },
                        {
                            "name": "Obstrucción del flujo Corte",
                            "description": "Al golpear con un ataque cuerpo a cuerpo a un enemigo bajo los efectos de Obstrucción del flujo, Tartaglia realiza Obstrucción del flujo: Corte, infligiendo Daño Hydro en el AdE. Este daño es considerado como daño de Habilidad Elemental, y solo se puede activar una vez cada 1.5 s.\nDespués de 30 s, o una vez que los efectos de la habilidad se hayan disipado tras lanzarla, Tartaglia regresa a su posición de combate a distancia, y esta habilidad entra en TdE. Cuanto más tiempo permanezca Tartaglia en su posición de combate cuerpo a cuerpo, más durará el TdE.\nSi el retorno a la posición de combate a distancia se produce automáticamente después de 30 s, el TdE será aún más largo.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s3",
                    "title": "Caos: Obliteración",
                    "description": "Realiza diferentes ataques dependiendo de la posición de Tartaglia.",
                    "abilities": [
                        {
                            "name": "Combate a distancia: Flecha del caos",
                            "description": "Dispara rápidamente una flecha mágica Hydro, infligiendo Daño Hydro en el AdE y aplicando el estado de Obstrucción del flujo. Tras lanzar la habilidad, devuelve una parte de su costo de Energía Elemental.",
                            "descriptions": []
                        },
                        {
                            "name": "Combate cuerpo a cuerpo: Luz de obliteración",
                            "description": "Realiza un corte con una gran AdE, infligiendo una gran cantidad de Daño Hydro a todos los enemigos cercanos y provocando Obstrucción del flujo Estallido.",
                            "descriptions": []
                        },
                        {
                            "name": "Obstrucción del flujo: Estallido",
                            "description": "Al atacar con Luz de obliteración a un enemigo afectado por Obstrucción del flujo, consumirá dicho efecto y creará una hidroexplosión, infligiendo Daño Hydro en el AdE.",
                            "descriptions": []
                        }
                    ]
                }
            ],
            "passives": [
                {
                    "key": "p1",
                    "title": "Maestro de armas",
                    "description": "Aumenta en 1 el nivel del ATQ normal de todos los miembros de tu equipo.",
                    "descriptions": []
                },
                {
                    "key": "p2",
                    "title": "Infinito sinfín",
                    "description": "Aumenta en 8 s la duración de Obstrucción del flujo.",
                    "descriptions": []
                },
                {
                    "key": "p3",
                    "title": "Espada hidromorfa",
                    "description": "Cuando Tartaglia está en la posición de combate cuerpo a cuerpo de Legado del mal: Olas furiosas, si los Ataques Normales o Cargados hacen Daño CRIT, el enemigo golpeado será afectado por Obstrucción del flujo.",
                    "descriptions": []
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "Legado del mal: Retención de la marea",
                    "description": "El TdE de Legado del mal: Olas furiosas se reduce un 20%.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c2",
                    "title": "Legado del mal: Transfondo",
                    "description": "Cuando los enemigos afectados por Obstrucción del flujo son derrotados, Tartaglia restaura 4 pts. de Energía Elemental.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c3",
                    "title": "Calamidad del Abismo: Fuente del conflicto",
                    "description": "Aumenta el nivel de habilidad de Legado del mal: Olas furiosas + 3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "Calamidad del Abismo: Hidrocontención",
                    "description": "Si Tartaglia está en la posición de combate cuerpo a cuerpo de Legado del mal: Olas furiosas, realizará Obstrucción del flujo: Corte cada 4 s contra los enemigos afectados por Obstrucción del flujo. Si está en posición de combate a distancia, en su lugar, realizará Obstrucción del flujo: Destello. La Obstrucción del flujo Corte y Obstrucción del flujo: Destello desencadenadas mediante el efecto de esta constelación no están sujetas a los intervalos de tiempo que se les aplicaría normalmente, ni tampoco afectarán a los tiempos de dichas habilidades.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "Caos: Corte líquido",
                    "description": "Aumenta el nivel de habilidad de Caos: Obliteración +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "Caos: Extinción del ánge",
                    "description": "En combate cuerpo a cuerpo, al lanzar Caos: Obliteración, el TdE de Legado del Mal: Olas furiosas termina inmediatamente. El efecto tiene lugar una vez que Tartaglia vuelve a la posición de combate a distancia.",
                    "secondDescription": null,
                    "descriptions": []
                }
            ]
        },
        {
            "key": "Traveler (Anemo)",
            "name": "Traveler (Anemo)",
            "description": "Una viajera de otro mundo a quien arrebataron a su único familiar, y que se vio obligada a embarcarse en un viaje en busca de los Siete.",
            "skills": [
                {
                    "key": "s1",
                    "title": "Viento metálico extranjero",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Realiza hasta 5 ataques rápidos.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Consume una cierta cantidad de Aguante para lanzar un golpe de espada cruzado.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": "Se lanza desde el aire para golpear el suelo, dañando a los enemigos a lo largo del camino e infligiendo Daño de Área en el momento del impacto.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Espada de vórtice",
                    "description": "Toma el poder del viento para formar un vórtice de vacio en la palma de la mano, infligiendo Daño Anemo continuo a los enemigos que haya enfrente.\nEl vórtice de vacio explota cuando termina la duración de la habilidad, infligiendo aún más cantidad de Daño Anemo en un área más grande.",
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "El Daño y el AdE aumentarán progresivamente.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Si el vórtice de vacio entra en contacto con Hydro/Pyro/Cryo/Electro, infligirá un bono de Daño Elemental adicional de ese tipo. El cambio elemental solo puede ocurrir una vez durante la habilidad.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s3",
                    "title": "Oleada de ráfagas",
                    "description": "Guía al viento para invocar un tornado que avanza y atrae a los objetos y oponentes hacia ella, infligiendo Daño Anemo continuo",
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Si el tornado entra en contacto con Hydro/Pyro/Cryo/Electro, infligirá un bono de Daño Elemental adicional de ese tipo. El cambio elemental solo puede ocurrir una vez durante la habilidad.",
                            "descriptions": []
                        }
                    ]
                }
            ],
            "passives": [
                {
                    "key": "p2",
                    "title": "Viento del cielo quebrado",
                    "description": "Después del último golpe de Ataque Normal, se lanzará una hoja afilada de viento, causando un 60% de Daño Anemo a los enemigos que estén alrededor.",
                    "descriptions": []
                },
                {
                    "key": "p3",
                    "title": "Viento de la resurrección",
                    "description": "Después de derrotar al enemigo, Espada de vórtice regenera un 2% de Vida cada 5 s. Solo puede ocurrir una vez cada 5 s.",
                    "descriptions": []
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "Torbellino furioso",
                    "description": "Espada de vórtice atrae a los enemigos en un radio de 5 m.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c2",
                    "title": "Torbellino ascendiente",
                    "description": "Recarga de energía + 16%.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c3",
                    "title": "Torbellino arrebatador",
                    "description": "Aumenta el nivel de habilidad de Oleada de ráfagas +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "Brisa protectora",
                    "description": "Mientras Espada de vórtice, esté activa, el daño entrante se reduce en 10%.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "Vórtice Stellaris",
                    "description": "Aumenta el nivel de habilidad de Espada de vórtice +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "Vientos entrelazados",
                    "description": "El objetivo que reciba daño de Oleada de ráfagas reduce su RES Anemo en 20%. Si ocurre un cambio elemental, la RES elemental del nuevo atributo se reducirá en un 20%.",
                    "secondDescription": null,
                    "descriptions": []
                }
            ]
        },
        {
            "key": "Traveler (Geo)",
            "name": "Traveler (Geo)",
            "description": "Una viajero de otro mundo a quien arrebataron a su único familiar, y que se vio obligada a embarcarse en un viaje en busca de los Siete.",
            "skills": [
                {
                    "key": "s1",
                    "title": "Espada de piedra extranjera",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Realiza hasta 5 ataques rápidos.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Consume una cierta cantidad de Aguante para lanzar un golpe de espada cruzado.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": "Se lanza desde el aire para golpear el suelo, dañando a los enemigos a lo largo del camino e infligiendo Daño de Área en el momento del impacto.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Espada estrellacaída",
                    "description": "Toma un meteorito de las profundidades de la tierra, infligiendo Daño Geo de Área. El meteorito es considerado un objeto Geo, puede ser escalado o usado para bloquear ataques.",
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Puede ajustar la posición de efecto de esta habilidad.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s3",
                    "title": "Despertar de la Tierra",
                    "description": "Inflige Daño Geo de Área a todos los enemigos a los que alcanza. Tras ello, crea una columna de piedra que se levanta abruptamente en el límite de la onda. La columna de piedra se considera un objeto Geo, por lo que puede escalarse o usarse para bloquear ataques.",
                    "abilities": []
                }
            ],
            "passives": [
                {
                    "key": "p2",
                    "title": "Roca quebrada",
                    "description": "Disminuye el TdE de Espada estrellacaída -2 s.",
                    "descriptions": []
                },
                {
                    "key": "p3",
                    "title": "Roca turbulenta",
                    "description": "El último golpe del Ataque Normal provoca una destrucción, infligiendo un 60% de Daño Geo a los enemigos dentro del área.",
                    "descriptions": []
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "Muro inquebrantable",
                    "description": "Aumenta la Prob. CRIT de todos los aliados dentro del radio de Despertar de la Tierra en 10%, y aumenta su RES a interrupción.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c2",
                    "title": "Fusión de lava",
                    "description": "El meteorito de Espada estrellacaída explota de nuevo cuando es destruido, causando Daño Geo de Área adicional equivalente al daño de Espada estrellacaída.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c3",
                    "title": "Voluntad pétrea",
                    "description": "Aumenta el nivel de habilidad de Despertar de la Tierra +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "Fuerza de reacción",
                    "description": "Al golpear al enemigo con una onda expansiva de Despertar de la Tierra, recuperas 5 de Energía. Puedes recuperar hasta 25 puntos de energía de esta forma.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "Impacto meteórico",
                    "description": "Aumenta el nivel de habilidad de Espada estrellacaída +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "Bloque eterno",
                    "description": "Extiende la duración del muro de piedra de Despertar de la Tierra en 5s.; Extiende la duración del meteorito de Espada estrellacaída en 10 s.",
                    "secondDescription": null,
                    "descriptions": []
                }
            ]
        },
        {
            "key": "Venti",
            "name": "Venti",
            "description": "Uno de los muchos bardos de Mondstadt que deambula libremente por las calles y callejones de la ciudad.",
            "skills": [
                {
                    "key": "s1",
                    "title": "Puntería divina",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Realiza hasta 6 disparos consecutivos con arco.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Dispara un Tiro preciso que inflige mayor daño. Al apuntar, se acumularán vientos favorables en la punta de flecha. Una flecha con fuerza del viento totalmente cargada infligirá Daño Anemo.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": "Dispara una lluvia de flechas desde el aire y desciende rápidamente, causando daño a distancia al impactar en el suelo",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Sonata celestial",
                    "description": "¡Oh viento sobre el que vuelan todos los himnos y cantos, lleva a estos caminantes de la tierra hacia los cielos!",
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Invoca un campo de viento en la ubicación del enemigo, infligiendo Daño Anemo de Área y lanzando a los enemigos por el aire.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Invoca un campo de viento aún más grande con Venti como epicentro, infligiendo Daño Anemo de Área y lanzando a los enemigos afectados al aire. Después de soltar esta habilidad, Venti cabalga el viento en el aire.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s3",
                    "title": "Gran Oda del Viento",
                    "description": "Dispara una flecha hecha de innumerables vientos fusionados, creando un enorme Ojo de la Tormenta que absorbe objetos y enemigos a su paso e inflige Daño Anemo.",
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Si el Ojo de la tormenta entra en contacto con Hydro/Pyro/Cryo/Electro, inflige Daño elemental adicional de ese tipo. El cambio elemental solo puede ocurrir una vez por uso.",
                            "descriptions": []
                        }
                    ]
                }
            ],
            "passives": [
                {
                    "key": "p1",
                    "title": "Jinete del viento",
                    "description": "Disminuye el consumo de Aguante al planear en un 20%.",
                    "descriptions": []
                },
                {
                    "key": "p2",
                    "title": "Abraza los vientos",
                    "description": "Mantener pulsado la Sonata celestial genera corrientes de viento ascendentes con una duración de 20 s.",
                    "descriptions": []
                },
                {
                    "key": "p3",
                    "title": "Ojo del huracán",
                    "description": "Después de que termine el efecto de Gran Oda del Viento, Venti restaurará 15 puntos de Energía Elemental. Si ocurre un cambio elemental, también restaurará 15 pts. de Energía Elemental a todos los personajes con los elementos correspondientes.",
                    "descriptions": []
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "Vendaval feroz",
                    "description": "Dispara 2 flechas adicionales por cada Tiro preciso, infligiendo cada uno 33% del Daño de la flecha original.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c2",
                    "title": "Brisa de reminiscencia",
                    "description": "Sonata celestial reduce la RES Anemo del enemigo en un 12% durante 10 s. Los enemigos lanzados al aire por Sonata celestial sufren una reducción adicional del 12% de RES Anemo y de RES física.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c3",
                    "title": "Oda a los Mil Vientos",
                    "description": "Aumenta el nivel de habilidad de Gran Oda del Viento +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "Huracán de la libertad",
                    "description": "Venti obtiene un 25% de Bono de Daño Anemo durante 10 s tras recoger un Orbe Elemental o una Partícula Elemental.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "Concierto celestial",
                    "description": "Aumenta el nivel de habilidad de Sonata celestial +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "Tormenta de desafío",
                    "description": "Gran Oda del Viento reduce la RES Anemo del enemigo en un 20%. Si ocurriera un cambio elemental durante Gran Oda del Viento, la RES Elemental del nuevo atributo se reducirá un 20%.",
                    "secondDescription": null,
                    "descriptions": []
                }
            ]
        },
        {
            "key": "Xiangling",
            "name": "Xiangling",
            "description": "Una reconida chef de Liyue. Le aposiona la cocina y sobresale al hacer sus platos calientes y picantes.",
            "skills": [
                {
                    "key": "s1",
                    "title": "Kung-Fu pasta",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Realiza hasta 5 ataques rápidos.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Consume cierta cantidad de Aguante para lanzarse al frente, infligiendo daño a los enemigos en el camino.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": "Se lanza desde el aire para golpear el suelo, dañando a los enemigos a lo largo del camino e infligiendo Daño de Área en el momento del impacto.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Ataque de Guoba",
                    "description": "Invoca al Panda Guoba. Guoba escupe fuego continuamente hacia el enemigo, infligiendo Daño Pyro de Área.",
                    "abilities": []
                },
                {
                    "key": "s3",
                    "title": "Pyronado",
                    "description": "Haciendo muestra de su dominio sobre el fuego y las lanzas, Xiangling provoca un Torbellino de llamas a su alrededor. El torbellino se mueve con el personaje durante su efecto, infligiendo Daño Pyro a todos los enemigos en su camino.",
                    "abilities": []
                }
            ],
            "passives": [
                {
                    "key": "p1",
                    "title": "Chef de cocina",
                    "description": "Cuando se logra un \"Perfecto\" en un plato con efectos de ataque, hay un 12% de posibilidades de obtener el doble de cantidad del producto.",
                    "descriptions": []
                },
                {
                    "key": "p2",
                    "title": "Fuego cruzado",
                    "description": "El alcance del lanzallamas de Guoba aumenta un 20%.",
                    "descriptions": []
                },
                {
                    "key": "p3",
                    "title": "¡Cuidado, que pica!",
                    "description": "Cuando termina el Ataque de guoba, Guoba deja chiles en el lugar donde desaparece. Obtén los chiles para aumentar el ATQ un 10% durante 10 s.",
                    "descriptions": []
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "Crujiente por fuera, tierno por dentro",
                    "description": "Reduce la RES Pyro de los oponentes atacados por Guoba en un 15% durante 6 s.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c2",
                    "title": "Aceite y fuego",
                    "description": "El último golpe del Ataque Normal hace que el enemigo implote durante 2 s. Después de eso, el enemigo explotará, produciendo un 75% de Daño Pyro de Área.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c3",
                    "title": "Que quede bien frito",
                    "description": "Aumenta el nivel de habilidad de Torbellino de llamas +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "A fuego lento",
                    "description": "Aumenta en un 40% el tiempo de duración de Torbellino de llamas.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "Guoba furioso",
                    "description": "Aumenta el nivel de habilidad de Ataque de Guoba +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "Pyronado condensado",
                    "description": "Mientras esté activa la habilidad de Torbellino de llamas, todos los personajes del equipo obtienen un 15% de Bono de Daño Pyro.",
                    "secondDescription": null,
                    "descriptions": []
                }
            ]
        },
        {
            "key": "Xiao",
            "name": "Xiao",
            "description": "A yaksha adeptus that defends Liyue. Also heralded as the \"Conqueror of Demons\" or \"Vigilant Yaksha.\"",
            "skills": [
                {
                    "key": "s1",
                    "title": "Whirlwind Thrust",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Perform up to 6 rapid strikes.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Consumes a certain amount of Stamina to perform an upward thrust.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": " Plunges from mid-air to strike the ground below, damaging enemies along the path and dealing AoE DMG upon impact.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Lemniscatic Wind Cycling",
                    "description": "He lunges forward, dealing Anemo DMG to enemies along the path. Can be used in mid-air. Has 2 charges to begin with.",
                    "abilities": []
                },
                {
                    "key": "s3",
                    "title": "Bane of All Evil",
                    "description": "Takes on the form of the yaksha that terrified both demons and archons alike millennia ago. For its duration, increases Xiao’s attack range and DMG, while converting damage type to Anemo and enhancing Xiao’s jumping ability. Maintaining this form continuously drains Xiao’s HP.",
                    "abilities": []
                }
            ],
            "passives": [
                {
                    "key": "p1",
                    "title": "Transcension - Gravity Defier",
                    "description": "Decreases all party member’s falling DMG by 30%. The greatest effect out of all Talents of the same type prevails.",
                    "descriptions": []
                },
                {
                    "key": "p2",
                    "title": "Evil Conqueror - Tamer of Demons",
                    "description": "Starting Bane of All Evil increases Xiao’s DMG by 5%. After this, Xiao’s DMG continues to increase by 5% every 3s until the skill ends. Max 25% increase.",
                    "descriptions": []
                },
                {
                    "key": "p3",
                    "title": "Dissolution Eon - Heaven Fall",
                    "description": "When Lemniscatic Wind Cycling is used, increases all subsequent Lemniscatic Wind Cycling’s DMG by 10% for 6s. Max 3 stacks. Duration refreshes with new stacks.",
                    "descriptions": []
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "Dissolution Eon - Destroyer of Worlds",
                    "description": "Increases Lemniscatic Wind Cycling’s charges by 1.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c2",
                    "title": "Annihilation Eon - Blossom of Kaleidos",
                    "description": "When in party but not the currently active character, Xiao’s Energy Recharge is increased by 25%.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c3",
                    "title": "Evil Conqueror - Wrath Deity",
                    "description": "Increases the Level of Lemniscatic Wind Cycling by 3. Maximum upgrade level is 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "Transcension - Extinction of Suffering",
                    "description": "When Xiao’s HP falls below 50%, gains a 100% DEF Bonus.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "Evolution Eon - Origin of Ignorance",
                    "description": "Increase the Level of Bane of All Evil by 3. Maximum upgrade level is 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "Evil Conqueror - Vigilant Yaksha",
                    "description": "During Bane of All Evil, hitting 2 or more enemies with a Charged Attack grants Lemniscatic Wind Cycling 1 additional charge and reduces Lemniscatic Wind Cycling’s CD by 1s.",
                    "secondDescription": null,
                    "descriptions": []
                }
            ]
        },
        {
            "key": "Xingqiu",
            "name": "Xingqiu",
            "description": "Un joven con una espada larga al que puede verse frecuentemente en las librerías. Tiene un corazón de oro y anhela la justicia y la igualdad para todos.",
            "skills": [
                {
                    "key": "s1",
                    "title": "Técnica de espada Guhua",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Realiza 5 ataques rápidos.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Consume una cierta cantidad de Aguante para lanzar un golpe de espada cruzado.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": "Se lanza desde el aire para golpear el suelo, dañando a los enemigos a lo largo del camino e infligiendo Daño de Área en el momento del impacto.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Guhua Sword - Fatal Rainscreen",
                    "description": "Xingqiu performs twin strikes with his sword, dealing Hydro DMG. At the same time, this ability creates the maximum number of Rain Swords, which will orbit the character. 20% of Xingqiu’s Hydro DMG Bonus will be converted to additional DMG Reduction for the Rain Swords. The maximum amount of additional DMG Reduction that can be gained this way is 24%. The initial maximum number of Rain Swords is 3. Using this ability applies the Wet status onto the character.",
                    "abilities": [
                        {
                            "name": "",
                            "description": "The Rain Swords have the following properties:",
                            "descriptions": [
                                "When a character takes DMG, the Rain Sword will shatter, reducing the amount of DMG taken.",
                                "Increases the character’s resistance to interruption."
                            ]
                        }
                    ]
                },
                {
                    "key": "s3",
                    "title": "Espada Guhua: Lluvia torrencial mortal",
                    "description": "Xingchiu realiza golpes gemelos con su espada, infligiendo Daño Hydro. Al mismo tiempo, esta habilidad crea la cantidad máxima de Espadas de lluvia, que orbitarán alrededor del personaje.",
                    "abilities": [
                        {
                            "name": "Espada arcoiris",
                            "description": "Estos efectos se aplican a otros personajes.",
                            "descriptions": [
                                "Los Ataques Normales de tu personaje en uso desencadenarán una lluvia de espadas consecutivas que infligen Daño Hydro",
                                "Durante el efecto de ésta habilidad, se mantendrá en todo momento el máximo numero posible de espadas de lluvia."
                            ]
                        }
                    ]
                }
            ],
            "passives": [
                {
                    "key": "p1",
                    "title": "Destello repentino",
                    "description": "Al fabricar Materiales de talento del personaje, hay un 25% de probabilidad de recuperar los materiales usados.",
                    "descriptions": []
                },
                {
                    "key": "p2",
                    "title": "Secretos del agua",
                    "description": "Cuando Espadas de lluvia se interrumpe o termina su duración, el personaje actual recibe el 6% de la Vida Máx. de Xingchiu.",
                    "descriptions": []
                },
                {
                    "key": "p3",
                    "title": "Cuchillas a cántaros",
                    "description": "Xingchiu recibe un Bono de Daño Hydro de 20%.",
                    "descriptions": []
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "Lluvia sobre mojado",
                    "description": "Máx. de cargas de Espadas de Lluvia +1.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c2",
                    "title": "Arcoíris brillante",
                    "description": "Extiende la duración de Espada Guhua: Sable de lluvia en 3 s y reduce la RES Hydro de los enemigos golpeados por Lluvia de espadas un 15% de manera continua por 4 s.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c3",
                    "title": "Tejedor de versos",
                    "description": "Aumenta el nivel de habilidad de Espada Guhua: Sable de lluvia +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "Pacificador del mal",
                    "description": "A lo largo de la duración de Espada Guhua: Sable de lluvia, el Daño infligido por Espada Guhua: Lluvia torrencial mortal aumenta en un 50%.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "Baile bajo la lluvia",
                    "description": "Aumenta el nivel de habilidad de Espada Guhua: Lluvia torrencial mortal +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "Colección de poesía",
                    "description": "Cada 2 ataques de Espada Guhua: Sable de lluvia, aumentará considerablemente el Daño de Lluvia de espadas. Al ser golpeado, Xingchiu recupera 3 de Energía.",
                    "secondDescription": null,
                    "descriptions": []
                }
            ]
        },
        {
            "key": "Xinyan",
            "name": "Xinyan",
            "description": "La única rockera de Liyue. A través de la música y la pasión de sus canciones, hace una crítica de los prejuicios de la sociedad.",
            "skills": [
                {
                    "key": "s1",
                    "title": "Baile ardiente",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Realiza hasta 4 tajos rápidos.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Sigue consumiendo Aguante para realizar golpes de espada giratorios contra los enemigos cercanos. Al final del Ataque Cargado, realizará un golpe de espada más poderoso.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": "Se lanza desde el aire para golpear el suelo, dañando a los enemigos a lo largo del camino e infligiendo Daño en el AdE en el momento del impacto.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Desenfreno",
                    "description": "Xinyan blande su instrumento, infligiendo Daño Pyro a los enemigos cercanos y formando un escudo hecho con el entusiasmo de su audiencia.",
                    "abilities": [
                        {
                            "name": "",
                            "description": "La absorción de daño del escudo es proporcional a la DEF de Xinyan y al número de enemigos alcanzados",
                            "descriptions": [
                                "De 0 a 1 enemigos: otorga un Escudo Niv. 1: Improvisación.",
                                "2 enemigos: otorga un Escudo Niv. 2: Entrada.",
                                "3 o más enemigos: otorga un Escudo Niv. 3: Fiesta que inflige intermitentemente Daño Pyro a los enemigos cercanos."
                            ]
                        },
                        {
                            "name": "",
                            "description": "El escudo tiene las siguientes propiedades:",
                            "descriptions": [
                                "Al activarse, aplica el elemento Pyro sobre Xinyan.",
                                "Tiene un 250% de efectividad de absorción de Daño Pyro."
                            ]
                        }
                    ]
                },
                {
                    "key": "s3",
                    "title": "Melodía de la rebelión",
                    "description": "Tocando su música a toda velocidad, Xinyan lanza por los aires a un enemigo e inflige Daño Físico a los enemigos cercanos, dando ánimos a su público. El fervor del ambiente provocará explosiones que infligen Daño Pyro a los enemigos cercanos.",
                    "abilities": []
                }
            ],
            "passives": [
                {
                    "key": "p1",
                    "title": "Receta rockera",
                    "description": "Cuando se logra un \"Perfecto\" en un plato con efectos de defensa, hay un 12% de posibilidades de obtener el doble de cantidad del producto.",
                    "descriptions": []
                },
                {
                    "key": "p2",
                    "title": "El espectáculo debe continuar",
                    "description": "Reduce la cantidad de enemigos que deben ser golpeados con Desenfreno para crear un escudo:",
                    "descriptions": [
                        "Escudo Niv. 2: Entrada: 1 enemigo.",
                        "Escudo Niv. 3: Fiesta: 2 o más enemigos."
                    ]
                },
                {
                    "key": "p3",
                    "title": "¡Rock and Roll!",
                    "description": "Aumenta en un 15% el Daño Físico de los personajes que se encuentran bajo la protección del escudo de Desenfreno.",
                    "descriptions": []
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "Aceleración letal",
                    "description": "Durante 5 s después de realizar un golpe CRIT, aumenta en un 12% la Vel. ATQ de los Ataques Normales y Cargados. Solo puede ocurrir una vez cada 5 s.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c2",
                    "title": "Comienzo improvisado",
                    "description": "La Prob. CRIT de Daño Físico de Melodía de la revolución aumenta en un 100% y al lanzar la habilidad se creará un Escudo Niv. 3: Fiesta.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c3",
                    "title": "Dobles cuerdas",
                    "description": "Aumenta el nivel de habilidad de Desenfreno +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "Ritmo contagioso",
                    "description": "El Daño de Desenfreno reduce en un 15% la RES Física de los enemigos durante 12 s.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "¡Otra canción!",
                    "description": "Aumenta el nivel de habilidad de Melodía de la rebelión +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "Rockeando en el infierno",
                    "description": "El Coste de Aguante del Ataque Cargado de Xinyan se reduce en un 30%. Además, al realizar un Ataque Cargado, gana un 50% de la DEF como Boño de ATQ.",
                    "secondDescription": null,
                    "descriptions": []
                }
            ]
        },
        {
            "key": "Zhongli",
            "name": "Zhongli",
            "description": "Misterioso invitado de la Funeraria El Camino. Erudito con información sobre todo tipo de cosas",
            "skills": [
                {
                    "key": "s1",
                    "title": "Lluvia pétrea",
                    "description": null,
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Realiza hasta 6 ataques rápidos con lanza.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Consume una cierta cantidad de Aguante para lanzarse al frente, haciendo que caigan lanzas de piedra en su camino.",
                            "descriptions": []
                        },
                        {
                            "key": "a3",
                            "description": "Se lanza desde el aire para golpear el suelo, dañando a los enemigos cercanos e infligiendo Daño en el AdE en el momento del impacto.",
                            "descriptions": []
                        }
                    ]
                },
                {
                    "key": "s2",
                    "title": "Dominus Lapidis",
                    "description": "Cada montaña, roca y centímetro de la tierra contiene poder Geo, pero solo unos pocos pueden usar libremente tal poder.",
                    "abilities": [
                        {
                            "key": "a1",
                            "description": "Controla el poder omnipresente de la tierra para solidificarlo en una Cresta de piedra que inflige Daño Geo en el AdE. La Cresta de piedra resonará con los objetos Geo cercanos, infligiendo Daño Geo a los enemigos de alrededor. La Cresta de piedra es considerada una creación Geo, y puede escalarse y usarse para bloquear ataques. Solo puede existir una al mismo tiempo.",
                            "descriptions": []
                        },
                        {
                            "key": "a2",
                            "description": "Hace que los elementos Geo cercanos exploten, provocando los siguientes efectos:",
                            "descriptions": [
                                "Crea un escudo de jade. La cantidad de absorción de daño del escudo se basa en la Vida Máx. de Zhongli, y dicho escudo tiene un 250% de absorción de Daño Geo.",
                                "Inflige Daño Geo en el AdE.",
                                "Si hay enemigos cercanos afectados por el Elemento Geo, absorberá una gran cantidad de Elemento Geo de un máximo de dos objetivos afectados por dicho elemento. Este efecto no causa daño."
                            ]
                        }
                    ]
                },
                {
                    "key": "s3",
                    "title": "Lluvia estelar",
                    "description": "Atrae un meteorito a la tierra, causando Daño Geo masivo a los enemigos dentro de su AdE y aplicando el efecto de Petrificación.",
                    "abilities": [
                        {
                            "name": "Petrificación",
                            "description": "Los enemigos bajo el efecto de Petrificación no pueden moverse.",
                            "descriptions": []
                        }
                    ]
                }
            ],
            "passives": [
                {
                    "key": "p1",
                    "title": "Cristal del destino",
                    "description": "Recupera el 15% de los minerales utilizados en la fabricación de lanzas.",
                    "descriptions": []
                },
                {
                    "key": "p2",
                    "title": "Ondas resonantes",
                    "description": "Cuando el Escudo de Jade recibe daño, genera un efecto de fortalecimiento:",
                    "descriptions": [
                        "Los personajes con Escudo de Jade aumentan su Protección de Escudo en un 5%.",
                        "Este efecto puede acumularse hasta 5 veces y dura hasta que desaparezca el Escudo de Jade."
                    ]
                },
                {
                    "key": "p3",
                    "title": "Dominio de la Tierra",
                    "description": "Lluvia estelar inflige daño adicional equivalente al 33% de la Vida Máx. de Zhongli.",
                    "descriptions": []
                }
            ],
            "constellations": [
                {
                    "key": "c1",
                    "title": "Roca, el núcleo de la Tierra",
                    "description": "Dominus lapidis puede crear un máximo de 2 Crestas de piedra al mismo tiempo.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c2",
                    "title": "Piedra, el origen del jade",
                    "description": "Al caer Lluvia estelar, otorga un Escudo de jade a los personajes cercanos que están en combate.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c3",
                    "title": "Jade, el brillo del crepúsculo",
                    "description": "Aumenta el nivel de habilidad de Dominus lapidis +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c4",
                    "title": "Topacio, indestructible e intrépido",
                    "description": "Aumenta el AdE de Lluvia estelar en un 20%. Además, aumenta en 2 s la duración de Petrificación de Lluvia estelar.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c5",
                    "title": "Lapislázuli, el heraldo del orden",
                    "description": "Aumenta el nivel de habilidad de Lluvia estelar +3. Puede ser aumentado hasta Niv. 15.",
                    "secondDescription": null,
                    "descriptions": []
                },
                {
                    "key": "c6",
                    "title": "Chrysos, la generosidad del dominador",
                    "description": "Cuando Escudo de Jade recibe daño, el 40% del daño recibido se convierte en Vida para el personaje actual. No se puede recuperar más del 8% de la Vida Máx. del personaje cada vez que se activa el efecto.",
                    "secondDescription": null,
                    "descriptions": []
                }
            ]
        }
    ],
    "weapons": [
        {
            "key": "Hunter’s Bow",
            "name": "Hunter’s Bow",
            "description": "A hunter’s music consists of but two sounds: the twang of the bowstring and the whoosh of soaring arrows.",
            "refinement": null
        },
        {
            "key": "Seasoned Hunter’s Bow",
            "name": "Seasoned Hunter’s Bow",
            "description": "A bow that has been well-polished by time and meticulously cared for by its owner. It feels almost like an extension of the archer’s arm.",
            "refinement": null
        },
        {
            "key": "Ebony Bow",
            "name": "Ebony Bow",
            "description": "A longbow made of ebony wood with stiffer limbs than ordinary bows. It is also a far more powerful weapon.",
            "refinement": "Increases DMG against mechanoid Ruin enemies by {{0}}%"
        },
        {
            "key": "Messenger",
            "name": "Messenger",
            "description": "A basic wooden bow. It is said to have once been used as a tool for long-distance communication.",
            "refinement": "Charged Attack hits on weak points deal an additional {{0}}% ATK DMG as CRIT DMG. Can only occur once every 10s."
        },
        {
            "key": "Raven Bow",
            "name": "Raven Bow",
            "description": "Ravens are known to be the ferrymen of the dead. This bow’s limb is decorated with raven feathers, which forebode the imminent death of its target.",
            "refinement": "Increases DMG against enemies affected by Hydro or Pyro by {{0}}%"
        },
        {
            "key": "Recurve Bow",
            "name": "Recurve Bow",
            "description": "It is said that this bow can shoot down eagles in flight, but ultimately how true that is depends on the skill of the archer.",
            "refinement": "Defeating an opponent restores {{0}}% HP"
        },
        {
            "key": "Sharpshooter’s Oath",
            "name": "Sharpshooter’s Oath",
            "description": "This superior bow once belonged to a master archer. However, it gives off a strong scent, thus making it unsuitable for hunting.",
            "refinement": "Increases DMG against weak spots by {{0}}%"
        },
        {
            "key": "Slingshot",
            "name": "Slingshot",
            "description": "A bow, despite the name. After countless experiments and improvements to the design, the creator of the ultimate slingshot found himself to have made what was actually a bow.",
            "refinement": "If a Normal or Charged Attack hits a target within 0.3s of being fired, increases DMG by {{0}}%. Otherwise, decreases DMG by 10%."
        },
        {
            "key": "The Stringless",
            "name": "The Stringless",
            "description": "A bow that once served as an extraordinary instrument. It is no longer capable of getting people up and dancing.",
            "refinement": "Increases Elemental Skill and Elemental Burst DMG by {{0}}%."
        },
        {
            "key": "Alley Hunter",
            "name": "Alley Hunter",
            "description": "An intricate, opulent longbow. It once belonged to a gentleman thief who was never caught.",
            "refinement": "Every 4s a character is on the field, their ATK increases by {{0}}% and their CRIT DMG increases by {{1}}%. This effect has a maximum of 5 stacks and will not be reset if the character leaves the field, but will be cleared when the character takes DMG."
        },
        {
            "key": "Blackcliff Warbow",
            "name": "Blackcliff Warbow",
            "description": "A bow made of blackcliff that features extremely sturdy bow limbs. It requires an archer with a strong bow arm to use.",
            "refinement": "After defeating an enemy, ATK is increased by {{0}}% for 30s. This effect has a maximum of 3 stacks, and the duration of each stack is independent of the others."
        },
        {
            "key": "Compound Bow",
            "name": "Compound Bow",
            "description": "An exotic metallic bow from a distant land. Though extremely difficult to maintain, it is easy to nock and fires with tremendous force.",
            "refinement": "Normal Attack and Charged Attack hits increase ATK by {{0}}% and Normal ATK SPD by {{1}}% for 6s. Max 4 stacks. Can only occur once every 0.3s."
        },
        {
            "key": "Favonius Warbow",
            "name": "Favonius Warbow",
            "description": "A standard-issue recurve bow of the Knights of Favonius. Only the best archers can unleash its full potential.",
            "refinement": "CRIT Hits have a {{0}}% chance to generate a small amount of Elemental Particles, which will regenerate 6 Energy for the character. Can only occur once every {{1}}s."
        },
        {
            "key": "Prototype Crescent",
            "name": "Prototype Crescent",
            "description": "A prototype longbow discovered in the Blackcliff Forge. The arrow fired from this bow glimmers like a ray of moonlight.",
            "refinement": "Charged Attack hits on weak points increase Movement SPD by 10% and ATK by {{0}}% for 10s."
        },
        {
            "key": "Royal Bow",
            "name": "Royal Bow",
            "description": "An old royal longbow that belonged to the erstwhile rulers of Mondstadt. Countless generations later, the bowstring is still tight and can still fire arrows with great force.",
            "refinement": "Upon damaging an opponent, increases CRIT Rate by {{0}}%. Max 5 stacks. A CRIT hit removes all stacks."
        },
        {
            "key": "Rust",
            "name": "Rust",
            "description": "A completely rusted iron greatbow. The average person would lack the strength to even lift it, let alone fire it.",
            "refinement": "Increases Normal Attack DMG by {{0}}% but decreases Charged Attack DMG by 10%."
        },
        {
            "key": "Sacrificial Bow",
            "name": "Sacrificial Bow",
            "description": "A ceremonial hunting bow that has become petrified over time. The trinkets on it are still visible. It grants the wielder the power to withstand the winds of time.",
            "refinement": "After damaging an opponent with an Elemental Skill, the skill has a {{0}}% chance to end its own CD. Can only occur once every {{1}}s"
        },
        {
            "key": "The Viridescent Hunt",
            "name": "The Viridescent Hunt",
            "description": "A pure green hunting bow. This once belonged to a certain hunter whose home was the forest.",
            "refinement": "Upon hit, Normal and Aimed Shot Attacks have a 50% chance to generate a Cyclone, which will continuously attract surrounding enemies, dealing {{0}}% of ATK as DMG to these enemies every 0.5s for 4s. This effect can only occur once every {{1}}s"
        },
        {
            "key": "Skyward Harp",
            "name": "Skyward Harp",
            "description": "A greatbow that symbolizes Dvalin’s affiliation with the Anemo Archon. The sound of the bow firing is music to the Anemo Archon’s ears. It contains the power of the sky and wind within.",
            "refinement": "Increases CRIT DMG by {{0}}%. Hits have a {{1}}% chance to inflict a small AoE attack, dealing 125% Physical ATK DMG. Can only occur once every {{2}}s."
        },
        {
            "key": "Amos’ Bow",
            "name": "Amos’ Bow",
            "description": "An extremely ancient bow that has retained its power despite its original master being long gone. It draws power from everyone and everything in the world, and the further away you are from that which your heart desires, the more powerful it is.",
            "refinement": "Increases Normal and Charged Attack DMG by {{0}}%. Normal and Charged Attack DMG increases by {{1}}% every 0.1s for up to 5 times."
        },
        {
            "key": "Dreams of Dragonfell",
            "name": "Dreams of Dragonfell",
            "description": "A great bow that once shot clean through a giant dragon. Once released, the impetus of its bowstring resembles a peal of thunder.",
            "refinement": "Increases Shield Strength by {{0}}%. Scoring hits on opponents increases ATK by {{1}}% for 8s. Max 5 stacks. Can only occur once every 0.3s. While protected by a shield, this ATK increase effect is increased by 100%."
        },
        {
            "key": "Dull Blade",
            "name": "Dull Blade",
            "description": "Youthful dreams and the thrill of adventure. If this isn’t enough, then make it up with valiance.",
            "refinement": null
        },
        {
            "key": "Silver Sword",
            "name": "Silver Sword",
            "description": "A sword for exorcising demons. Everyone knows it’s made of a silver alloy, not pure silver.",
            "refinement": null
        },
        {
            "key": "Cool Steel",
            "name": "Cool Steel",
            "description": "A reliable steel-forged weapon that serves as a testament to the great adventures of its old master.",
            "refinement": "Increases DMG against enemies affected by Hydro or Cryo by {{0}}%"
        },
        {
            "key": "Dark Iron Sword",
            "name": "Dark Iron Sword",
            "description": "A perfectly ordinary iron sword, just slightly darker than most.",
            "refinement": "Upon causing an Overloaded, Superconduct, Electro-Charged, or an Electro-infused Swirl reaction, ATK is increased by {{0}}% for 12s."
        },
        {
            "key": "Fillet Blade",
            "name": "Fillet Blade",
            "description": "A sharp filleting knife. The blade is long, thin, and incredibly sharp.",
            "refinement": "On hit, has a 50% chance to deal {{0}}% ATK DMG to a single enemy. Can only occur once every {{1}}s."
        },
        {
            "key": "Harbinger of Dawn",
            "name": "Harbinger of Dawn",
            "description": "A sword that once shone like the sun. The wielder of this sword will be blessed with a \"feel-good\" buff. The reflective material on the blade has long worn off.",
            "refinement": "When HP is above 90%, increases CRIT Rate by {{0}}%."
        },
        {
            "key": "Skyrider Sword",
            "name": "Skyrider Sword",
            "description": "A reliable steel sword. The legendary Skyrider once tried to ride it as a flying sword...",
            "refinement": "Using an Elemental Burst grants a {{0}}% increase in ATK and Movement SPD for 15s."
        },
        {
            "key": "Traveler’s Handy Sword",
            "name": "Traveler’s Handy Sword",
            "description": "A handy steel sword which contains scissors, a magnifying glass, tinder, and other useful items in its sheath.",
            "refinement": "Each Elemental Orb or Particle collected restores {{0}}% HP."
        },
        {
            "key": "Blackcliff Longsword",
            "name": "Blackcliff Longsword",
            "description": "A sword made of a material known as \"blackcliff.\" It has a dark crimson glow on its black blade.",
            "refinement": "After defeating an enemy, ATK is increased by {{0}}% for 30s. This effect has a maximum of 3 stacks, and the duration of each stack is independent of the others."
        },
        {
            "key": "Favonius Sword",
            "name": "Favonius Sword",
            "description": "A standard-issue longsword of the Knights of Favonius. When you’re armed with this agile and sharp weapon, channeling the power of the elements has never been so easy!",
            "refinement": "CRIT Hits have a {{0}}% chance to generate a small amount of Elemental Particles, which will regenerate 6 Energy for the character. Can only occur once every {{1}}s."
        },
        {
            "key": "Iron Sting",
            "name": "Iron Sting",
            "description": "An exotic long-bladed rapier that somehow found its way into Liyue via foreign traders. It is light, agile, and sharp.",
            "refinement": "Dealing Elemental DMG increases all DMG by {{0}}% for 6s. Max 2 stacks. Can occur once every 1s."
        },
        {
            "key": "Lion’s Roar",
            "name": "Lion’s Roar",
            "description": "A sharp blade with extravagant carvings that somehow does not compromise on durability and sharpness. It roars like a lion as it cuts through the air.",
            "refinement": "Increases DMG against enemies affected by Pyro or Electro by {{0}}%"
        },
        {
            "key": "Prototype Rancour",
            "name": "Prototype Rancour",
            "description": "An ancient longsword discovered in the Blackcliff Forge that cuts through rocks like a hot knife through butter.",
            "refinement": "On hit, Normal or Charged Attacks increase ATK and DEF by {{0}}% for 6s. Max 4 stacks. This effect can only occur once every 0.3s."
        },
        {
            "key": "Royal Longsword",
            "name": "Royal Longsword",
            "description": "An old longsword that belonged to the erstwhile rulers of Mondstadt. Exquisitely crafted, the carvings and embellishments testify to the stature of its owner.",
            "refinement": "Upon damaging an opponent, increases CRIT Rate by {{0}}%. Max 5 stacks. A CRIT hit removes all stacks."
        },
        {
            "key": "Sacrificial Sword",
            "name": "Sacrificial Sword",
            "description": "A ceremonial sword that has become petrified over time. The trinkets on it are still visible. It grants the wielder the power to withstand the winds of time.",
            "refinement": "After damaging an opponent with an Elemental Skill, the skill has a {{0}}% chance to end its own CD. Can only occur once every {{1}}s"
        },
        {
            "key": "The Alley Flash",
            "name": "The Alley Flash",
            "description": "A straight sword as black as the night. It once belonged to a thief who roamed the benighted streets.",
            "refinement": "Continuosly sprinting for at least 1s increases ATK by {{0}}% for 6s. This effect cannot stack."
        },
        {
            "key": "The Black Sword",
            "name": "The Black Sword",
            "description": "A pitch-black longsword that thirsts for violence and conflict. It is said that this weapon can cause its user to become drunk on the red wine of slaughter.",
            "refinement": "Increases DMG dealt by Normal and Charged Attacks by {{0}}%. Additionally, regenerates {{1}}% of ATK as HP when Normal and Charged Attacks score a CRIT Hit. This effect can occur once every 5s."
        },
        {
            "key": "The Flute",
            "name": "The Flute",
            "description": "Beneath its rusty exterior is a lavishly decorated thin blade. It swings as swiftly as the wind.",
            "refinement": "Normal or Charged Attacks grant a Harmonic on hits. Gaining 5 Harmonics triggers the power of music and deals {{0}}% ATK DMG to surrounding enemies. Harmonics last up to 30s, and a maximum of 1 can be gained every 0.5s."
        },
        {
            "key": "Sword of Descension",
            "name": "Sword of Descension",
            "description": "A sword of unique craftsmanship. It does not appear to belong to this world.",
            "refinement": "Hitting opponents with Normal and Charged Attacks grants a {{0}}% chance to deal 200% ATK as DMG in a small AoE. This effect can only occur once every 10s. Additionally, if the Traveler equips the Sword of Descension, their ATK is increased by {{1}}."
        },
        {
            "key": "Festering Desire",
            "name": "Festering Desire",
            "description": "A creepy straight sword that almost seems to yearn for life. It drips with a shriveling venom that could even corrupt a mighty dragon.",
            "refinement": "Increases Elemental Skill DMG by {{0}}% and Elemental Skill CRIT Rate by {{1}}%."
        },
        {
            "key": "Aquila Favonia",
            "name": "Aquila Favonia",
            "description": "The soul of the Knights of Favonius. Millennia later, it still calls on the winds of swift justice to vanquish all evil  just like the last heroine who wielded it.",
            "refinement": "ATK is increased by {{0}}%. Triggers on taking DMG: the soul of the Falcon of the West awakens, holding the banner of resistance aloft, regenerating HP equal to {{1}}% of ATK and dealing {{2}}% of ATK as DMG to surrounding enemies. This effect can only occur once every 15s."
        },
        {
            "key": "Skyward Blade",
            "name": "Skyward Blade",
            "description": "The sword of a knight that symbolizes the restored honor of Dvalin. The blessings of the Anemo Archon rest on the fuller of the blade, imbuing the sword with the powers of the sky and the wind.",
            "refinement": "CRIT Rate increased by {{0}}%. Gains Skypiercing Might upon using an Elemental Burst: Increases Movement SPD by 10%, increases ATK SPD by 10%, and increases the DMG of Normal and Charged Attack hits by {{1}}% for 12s."
        },
        {
            "key": "Summit Shaper",
            "name": "Summit Shaper",
            "description": "A symbol of a legendary pact, this sharp blade once cut off the peak of a mountain.",
            "refinement": "Increases Shield Strength by {{0}}%. Scoring hits on opponents increases ATK by {{1}}% for 8s. Max 5 stacks. Can only occur once every 0.3s. While protected by a shield, this ATK increase effect is increased by 100%."
        },
        {
            "key": "Apprentice’s Notes",
            "name": "Apprentice’s Notes",
            "description": "Notes left behind by a top student. Many useful spells are listed, and the handwriting is beautiful.",
            "refinement": null
        },
        {
            "key": "Pocket Grimoire",
            "name": "Pocket Grimoire",
            "description": "A carefully compiled notebook featuring the essentials needed to pass a magic exam.",
            "refinement": null
        },
        {
            "key": "Amber Bead",
            "name": "Amber Bead",
            "description": "A catalyst carved out of amber that gains a warm halo under the sun.",
            "refinement": "Normal Attack hits increase all Elemental DMG by {{0}}% for 6s. Max 2 stacks."
        },
        {
            "key": "Emerald Orb",
            "name": "Emerald Orb",
            "description": "A catalyst carved out of the hard jade from Jueyun Karst north of Liyue. It is small, light, and durable.",
            "refinement": "Upon causing a Vaporize, Electro-Charged, Frozen, or a Hydro-infused Swirl reaction, increases ATK by {{0}}% for 12s."
        },
        {
            "key": "Magic Guide",
            "name": "Magic Guide",
            "description": "Version 12. A reprint featuring corrections to Version 11 and brand-new additions based on recent developments.",
            "refinement": "Increases DMG against enemies affected by Hydro or Electro by {{0}}%."
        },
        {
            "key": "Otherworldly Story",
            "name": "Otherworldly Story",
            "description": "A cheap fantasy novel with no value whatsoever. Any claim that it possesses the power of catalysis is also pure fantasy.",
            "refinement": "Picking up an Elemental Energy Orb/Particle recovers {{0}}% HP."
        },
        {
            "key": "Thrilling Tales of Dragon Slayers",
            "name": "Thrilling Tales of Dragon Slayers",
            "description": "A fictional story of a band of five heroes who go off on a dragon hunt. It is poorly written and structurally incoherent. Its value lies in the many lessons that can be learned from failure.",
            "refinement": "When switching characters, the new character taking the field has their ATK increased by {{0}}% for 10s. This effect can only occur once every 20s."
        },
        {
            "key": "Twin Nephrite",
            "name": "Twin Nephrite",
            "description": "A jade pendant formed by piecing together two jade stones.",
            "refinement": "Defeating an enemy increases Movement SPD and ATK by {{0}}% for 15s."
        },
        {
            "key": "Blackcliff Agate",
            "name": "Blackcliff Agate",
            "description": "A mysterious catalyst made of a material known as \"blackcliff.\" It has an ominous crimson glow that seems to pulse in synchronization with the tremors from deep within the earth.",
            "refinement": "After defeating an enemy, ATK is increased by {{0}}% for 30s. This effect has a maximum of 3 stacks, and the duration of each stack is independent of the others."
        },
        {
            "key": "Favonius Codex",
            "name": "Favonius Codex",
            "description": "A secret tome that belonged to the scholars of the Knights of Favonius. It describes the logic and power of elements and matter.",
            "refinement": "CRIT Hits have a {{0}}% chance to generate a small amount of Elemental Particles, which will regenerate 6 Energy for the character. Can only occur once every {{1}}s."
        },
        {
            "key": "Mappa Mare",
            "name": "Mappa Mare",
            "description": "A nautical chart featuring nearby currents and climates that somehow found its way into Liyue via foreign traders.",
            "refinement": "Triggering an Elemental reaction grants a {{0}}% Elemental DMG Bonus for 10s. Max 2 stacks."
        },
        {
            "key": "Prototype Amber",
            "name": "Prototype Amber",
            "description": "A dully gilded catalyst secretly guarded in the Blackcliff Forge. It seems to glow with the very light from the sky.",
            "refinement": "Using an Elemental Burst regenerates {{0}} Energy every 2s for 6s. All party members will regenerate {{1}}% HP every 2s for this duration."
        },
        {
            "key": "Royal Grimoire",
            "name": "Royal Grimoire",
            "description": "A book that once belonged to a royal mage of Mondstadt. It contains faithful and comprehensive historical accounts as well as magic spells.",
            "refinement": "Upon damaging an opponent, increases CRIT Rate by {{0}}%. Max 5 stacks. A CRIT hit removes all stacks."
        },
        {
            "key": "Sacrificial Fragments",
            "name": "Sacrificial Fragments",
            "description": "A weathered script, the text of which is no longer legible. A cursed item eroded by the winds of time.",
            "refinement": "After damaging an opponent with an Elemental Skill, the skill has a {{0}}% chance to end its own CD. Can only occur once every {{1}}s."
        },
        {
            "key": "Solar Pearl",
            "name": "Solar Pearl",
            "description": "A dull, golden pearl made of an unknown substance that harbors the light of the sun and the moon, and pulses with a warm strength.",
            "refinement": "Normal Attack hits increase Elemental Skill and Elemental Burst DMG by {{0}}% for 6s. Likewise, Elemental Skill or Elemental Burst hits increase Normal Attack DMG by {{1}}% for 6s."
        },
        {
            "key": "The Widsith",
            "name": "The Widsith",
            "description": "A heavy notebook filled with musical scores. Though suffering from moth damage and heavy wear-and-tear, there is still much power to be found among the hand-written words within.",
            "refinement": "When the character takes the field, they will gain a random theme song for 10s. This can only occur once every 30s. Recitative: ATK is increased by {{0}}%. Aria: Increases all Elemental DMG by {{1}}%. Interlude: Elemental Mastery is increased by {{2}}."
        },
        {
            "key": "Wine and Song",
            "name": "Wine and Song",
            "description": "A songbook from the bygone aristocratic era, whose composer has become forgotten. It chronicles the tale of a certain heroic outlaw.",
            "refinement": "For every character in the party who hails from Mondstadt, the character who equips this weapon gains {{0}}% ATK increase and {{1}}% Movement SPD increase."
        },
        {
            "key": "Eye of Perception",
            "name": "Eye of Perception",
            "description": "A dim black glaze pearl that is said to have the power to read the purity of one’s heart.",
            "refinement": "Normal and Charged Attacks have a 50% chance to fire a Bolt of Perception, dealing {{0}}% ATK as DMG. This bolt can bounce between enemies a maximum of 4 times. This effect can occur once every {{1}}s."
        },
        {
            "key": "Frostbearer",
            "name": "Frostbearer",
            "description": "A fruit that possesses a strange, frosty will. A faint sense of agony emanates from it.",
            "refinement": "Hitting an enemy with Normal and Charged Attacks has a {{0}}% chance of forming and dropping an Everfrost Icicle above them, dealing {{1}}% AoE ATK DMG. Can only occur once every 10s. Enemies affected by Cryo are dealt {{2}}% ATK DMG. Can only occur once every 10s."
        },
        {
            "key": "Lost Prayer to the Sacred Winds",
            "name": "Lost Prayer to the Sacred Winds",
            "description": "An educational tome written by anonymous early inhabitants who worshiped the wind. It has been blessed by the wind for its faithfulness and influence over the millennia.",
            "refinement": "Increases Movement SPD by 10%. When in battle, gain an {{0}}% Elemental DMG Bonus every 4s. Max 4 stacks. Lasts until the character falls or leaves combat."
        },
        {
            "key": "Skyward Atlas",
            "name": "Skyward Atlas",
            "description": "A cloud atlas symbolizing Dvalin and its former master, the Anemo Archon. It details the winds and clouds of the northern regions and contains the powers of the sky and wind.",
            "refinement": "Increases Elemental DMG Bonus by {{0}}%. Normal Attack hits have a 50% chance to earn the favor of the clouds, which actively seek out nearby enemies to attack for 15s, dealing {{1}}% ATK DMG. Can only occur once every 30s."
        },
        {
            "key": "Memory of Dust",
            "name": "Memory of Dust",
            "description": "A stone dumbbell containing distant memories. Its endless transformations reveal the power within.",
            "refinement": "Increases Shield Strength by {{0}}%. Scoring hits on opponents increases ATK by {{1}}% for 8s. Max 5 stacks. Can only occur once every 0.3s. While protected by a shield, this ATK increase effect is increased by 100%."
        },
        {
            "key": "Waster Greatsword",
            "name": "Waster Greatsword",
            "description": "A sturdy sheet of iron that may be powerful enough to break apart mountains if wielded with enough willpower.",
            "refinement": null
        },
        {
            "key": "Old Merc’s Pal",
            "name": "Old Merc’s Pal",
            "description": "A battle-tested greatsword that has seen better days and worse.",
            "refinement": null
        },
        {
            "key": "Bloodtainted Greatsword",
            "name": "Bloodtainted Greatsword",
            "description": "A steel sword that is said to have been coated with dragon blood, rendering it invulnerable to damage. This effect is not extended to its wielder, however.",
            "refinement": "Increases DMG dealt against enemies affected by Pyro or Electro by {{0}}%"
        },
        {
            "key": "Debate Club",
            "name": "Debate Club",
            "description": "A handy club made of fine steel. The most persuasive line of reasoning in any debater’s arsenal.",
            "refinement": "After using an Elemental Skill, Normal or Charged Attacks, on hit, deal an additional {{0}}% ATK DMG in a small area. Effect lasts 15s. DMG can only occur once every 3s."
        },
        {
            "key": "Ferrous Shadow",
            "name": "Ferrous Shadow",
            "description": "A replica of the famed sword of Arundolyn, the Lion of Light. Feel the power of a legendary hero as you hold this sword in your hand! Imagine yourself as the great warrior himself! Note: Daydreaming not recommended in live combat.",
            "refinement": "When HP falls below {{0}}%, increases Charged Attack DMG by {{1}}% and Charged Attacks become harder to interrupt."
        },
        {
            "key": "Quartz",
            "name": "Quartz",
            "description": "A simple but heavy greatsword made of polished black quartz with a golden gilt. It has an air of elegance and dignity about it.",
            "refinement": "Upon causing an Overloaded, Melt, Burning, Vaporize, or a Pyro-infused Swirl reaction, ATK is increased by {{0}}% for 12s."
        },
        {
            "key": "Skyrider Greatsword",
            "name": "Skyrider Greatsword",
            "description": "A reliable steel sword. The legendary Skyrider once tried to ride it as a flying sword... for the second time.",
            "refinement": "On hit, Normal or Charged Attacks increase ATK by {{0}}% for 6s. Max 4 stacks. Can occur once every 0.5s."
        },
        {
            "key": "White Iron Greatsword",
            "name": "White Iron Greatsword",
            "description": "A claymore made from white iron. Lightweight without compromising on power. Effective even when wielded by one of average strength, it is extremely deadly in the hands of a physically stronger wielder.",
            "refinement": "Defeating an opponent restores {{0}}% HP."
        },
        {
            "key": "Blackcliff Slasher",
            "name": "Blackcliff Slasher",
            "description": "An extremely sturdy greatsword from the Blackcliff Forge. It has a dark crimson color from the blade to pommel.",
            "refinement": "After defeating an enemy, ATK is increased by {{0}}% for 30s. This effect has a maximum of 3 stacks, and the duration of each stack is independent of the others."
        },
        {
            "key": "Favonius Greatsword",
            "name": "Favonius Greatsword",
            "description": "A heavy ceremonial sword of the Knights of Favonius. It channels elemental power easily and is highly destructive.",
            "refinement": "CRIT Hits have a {{0}}% chance to generate a small amount of Elemental Particles, which will regenerate 6 Energy for the character. Can only occur once every {{1}}s."
        },
        {
            "key": "Lithic Blade",
            "name": "Lithic Blade",
            "description": "A greatsword carved and chiseled from the very bedrock of Liyue.",
            "refinement": "For every character in the party who hails from Liyue, the character who equips this weapon gains {{0}}% ATK increase and {{1}}% CRIT Rate increase."
        },
        {
            "key": "Prototype Archaic",
            "name": "Prototype Archaic",
            "description": "An ancient greatsword discovered in the Blackcliff Forge. It swings with such an immense force that one feels it could cut straight through reality itself.",
            "refinement": "On hit, Normal or Charged Attacks have a 50% chance to deal an additional {{0}}% ATK DMG to enemies within a small AoE. Can only occur once every 15s."
        },
        {
            "key": "Rainslasher",
            "name": "Rainslasher",
            "description": "A fluorescent greatsword with no sharp edge that crushes enemies with brute force and raw power.",
            "refinement": "Increases DMG against enemies affected by Hydro or Electro by {{0}}%"
        },
        {
            "key": "Royal Greatsword",
            "name": "Royal Greatsword",
            "description": "An old greatsword that belonged to the erstwhile rulers of Mondstadt. It is made from the finest-quality materials and has stood the test of time. A weapon for use by royals only.",
            "refinement": "Upon damaging an opponent, increases CRIT Rate by {{0}}%. Max 5 stacks. A CRIT hit removes all stacks."
        },
        {
            "key": "Serpent Spine",
            "name": "Serpent Spine",
            "description": "A rare weapon whose origin is the ancient ocean. One can hear the sound of the ageless waves as one swings it.",
            "refinement": "Every 4s a character is on the field, they will deal {{0}}% more DMG and take {{1}}% more DMG. This effect has a maximum of 5 stacks and will not be reset if the character leaves the field, but will be reduced by 1 stack when the character takes DMG."
        },
        {
            "key": "The Bell",
            "name": "The Bell",
            "description": "A heavy greatsword. A clock is embedded within it, though its internal mechanisms have long been damaged.",
            "refinement": "Taking DMG generates a shield which absorbs DMG up to {{0}}% of Max HP. This shield lasts for 10s or until broken, and can only be triggered once every 45s. While protected by the shield, the character gains {{1}}% increased DMG."
        },
        {
            "key": "Whiteblind",
            "name": "Whiteblind",
            "description": "An exotic sword with one section of the blade left blunt. It made its way into Liyue via the hands of foreign traders. Incredibly powerful in the hands of someone who knows how to use it.",
            "refinement": "On hit, Normal or Charged Attacks increase ATK and DEF by {{0}}% for 6s. Max 4 stacks. This effect can only occur once every 0.5s."
        },
        {
            "key": "Sacrificial Greatsword",
            "name": "Sacrificial Greatsword",
            "description": "A ceremonial greatsword that has become petrified over time. The trinkets on it are still visible. It grants the wielder the power to withstand the winds of time.",
            "refinement": "After damaging an opponent with an Elemental Skill, the skill has a {{0}}% chance to end its own CD. Can only occur once every {{1}}s."
        },
        {
            "key": "Snow-Tombed Starsilver",
            "name": "Snow-Tombed Starsilver",
            "description": "An ancient greatsword that was stored between frescoes. Forged from Starsilver, it has the power to cleave through ice and snow.",
            "refinement": "Hitting an enemy with Normal and Charged Attacks has a {{0}}% chance of forming and dropping an Everfrost Icicle above them, dealing {{1}}% AoE ATK DMG. Can only occur once every 10s. Enemies affected by Cryo are dealt {{2}}% ATK DMG. Can only occur once every 10s."
        },
        {
            "key": "Skyward Pride",
            "name": "Skyward Pride",
            "description": "A claymore that symbolizes the pride of Dvalin soaring through the skies. When swung, it emits a deep hum as the full force of Dvalin’s command of the sky and the wind is unleashed.",
            "refinement": "Increases all DMG by {{0}}%. After using an Elemental Burst, Normal or Charged Attack, on hit, creates a vacuum blade that does {{1}}% of ATK as DMG to enemies along its path. Lasts for 20s or 8 vacuum blades."
        },
        {
            "key": "Wolf’s Gravestone",
            "name": "Wolf’s Gravestone",
            "description": "A longsword used by the Wolf Knight. Originally just a heavy sheet of iron given to the knight by a blacksmith from the city, it became endowed with legendary power owing to his friendship with the wolves.",
            "refinement": "Increases ATK by {{0}}%. On hit, attacks against enemies with less than 30% HP increase all party members’ ATK by {{1}}% for 12s. Can only occur once every 30s."
        },
        {
            "key": "The Unforged",
            "name": "The Unforged",
            "description": "Capable of driving away evil spirits and wicked people alike, this edgeless claymore seems to possess divine might.",
            "refinement": "Increases Shield Strength by {{0}}%. Scoring hits on opponents increases ATK by {{1}}% for 8s. Max 5 stacks. Can only occur once every 0.3s. While protected by a shield, this ATK increase effect is increased by 100%."
        },
        {
            "key": "Beginner’s Protector",
            "name": "Beginner’s Protector",
            "description": "A polearm as straight as a flag pole. Well suited to most combat situations, it has an imposing presence when swung.",
            "refinement": null
        },
        {
            "key": "Iron Point",
            "name": "Iron Point",
            "description": "Sharp and pointy at one end, it is a balanced weapon that is quite popular among travelers.",
            "refinement": null
        },
        {
            "key": "Black Tassel",
            "name": "Black Tassel",
            "description": "An exceptionally powerful polearm that also offers a simple but elegant solution to the issue of the easily stained white tassel.",
            "refinement": "Increases DMG against slimes by {{0}}%"
        },
        {
            "key": "Halberd",
            "name": "Halberd",
            "description": "A polearm with an axe blade mounted on top that can deal quite a lot of damage. It’s favored by the Millelith officers.",
            "refinement": "Normal Attacks deal an additional {{0}}% DMG. Can only occur once every 10s."
        },
        {
            "key": "White Tassel",
            "name": "White Tassel",
            "description": "A standard-issue weapon of the Millelith soldiers. It has a sturdy shaft and sharp spearhead. It’s a reliable weapon.",
            "refinement": "Increases Normal Attack DMG by {{0}}%."
        },
        {
            "key": "Blackcliff Pole",
            "name": "Blackcliff Pole",
            "description": "A weapon made of blackcliff and aerosiderite. There is a dark crimson glow on its cold black sheen.",
            "refinement": "After defeating an enemy, ATK is increased by {{0}}% for 30s. This effect has a maximum of 3 stacks, and the duration of each stack is independent of the others."
        },
        {
            "key": "Crescent Pike",
            "name": "Crescent Pike",
            "description": "An exotic weapon with an extremely long blade on the top and a crescent blade at the bottom. It found its way into Liyue through foreign traders. With practice, it can deal heavy damage.",
            "refinement": "After picking up an Elemental Orb/Particle, Normal and Charged Attacks deal an additional {{0}}% ATK DMG for 5s."
        },
        {
            "key": "Deathmatch",
            "name": "Deathmatch",
            "description": "A sharp crimson polearm that was once a gladiator’s priceless treasure. Its awl has been stained by the blood of countless beasts and men.",
            "refinement": "If are there at least 2 enemies nearby, ATK is increased by {{0}}% and DEF is increased by {{1}}%. If there are less than 2 enemies nearby, ATK is increased by {{2}}%"
        },
        {
            "key": "Dragon’s Bane",
            "name": "Dragon’s Bane",
            "description": "A polearm decorated with an entwining golden dragon. Light and sharp, this weapon may very well kill dragons with ease.",
            "refinement": "Increases DMG against enemies affected by Hydro or Pyro by {{0}}%"
        },
        {
            "key": "Lithic Spear",
            "name": "Lithic Spear",
            "description": "A spear forged from the rocks of the Guyun Stone Forest. Its hardness knows no equal.",
            "refinement": "Normal Attack hits have a {{0}}% chance of causing the next Charged Attack performed in the following 10s to deal {{1}}% increased DMG."
        },
        {
            "key": "Prototype Starglitter",
            "name": "Prototype Starglitter",
            "description": "A grudge discovered in the Blackcliff Forge. The glimmers along the sharp edge are like stars in the night.",
            "refinement": "After using an Elemental Skill, increases Normal and Charged Attack DMG by {{0}}% for 12s. Max 2 stacks."
        },
        {
            "key": "Favonius Lance",
            "name": "Favonius Lance",
            "description": "A polearm made in the style of the Knights of Favonius. Its shaft is straight, and its tip flows lightly like the wind.",
            "refinement": "CRIT Hits have a {{0}}% chance to generate a small amount of Elemental Particles, which will regenerate 6 Energy for the character. Can only occur once every {{1}}s."
        },
        {
            "key": "Royal Spear",
            "name": "Royal Spear",
            "description": "This polearm was once cherished by a member of the old nobility that governed Mondstadt long ago. Although it has never seen the light of day, it is still incomparably sharp.",
            "refinement": "Upon damaging an opponent, increases CRIT Rate by {{0}}%. Max 5 stacks. A CRIT hit removes all stacks."
        },
        {
            "key": "Dragonspine Spear",
            "name": "Dragonspine Spear",
            "description": "A spear created from the fang of a dragon. It is oddly warm to the touch.",
            "refinement": "Hitting an enemy with Normal and Charged Attacks has a {{0}}% chance of forming and dropping an Everfrost Icicle above them, dealing {{1}}% AoE ATK DMG. Can only occur once every 10s. Enemies affected by Cryo are dealt {{2}}% ATK DMG. Can only occur once every 10s."
        },
        {
            "key": "Vortex Vanquisher",
            "name": "Vortex Vanquisher",
            "description": "This sharp polearm can seemingly pierce through anything. When swung, one can almost see the rift it tears in the air.",
            "refinement": "Increases Shield Strength by {{0}}%. Scoring hits on opponents increases ATK by {{1}}% for 8s. Max 5 stacks. Can only occur once every 0.3s. While protected by a shield, this ATK increase effect is increased by 100%."
        },
        {
            "key": "Primordial Jade Winged-Spear",
            "name": "Primordial Jade Winged-Spear",
            "description": "A jade polearm made by the archons, capable of slaying ancient beasts.",
            "refinement": "On hit, increases ATK by {{0}}% for 6s. Max 7 stacks. This effect can only occur once every 0.3s. While in possession of the maximum possible stacks, DMG dealt is increased by {{1}}%."
        },
        {
            "key": "Skyward Spine",
            "name": "Skyward Spine",
            "description": "A polearm that symbolizes Dvalin’s firm resolve. The upright shaft of this weapon points towards the heavens, clad in the might of sky and wind.",
            "refinement": "Increases CRIT Rate by {{0}}% and increases Normal ATK SPD by 12%. Additionally, Normal and Charged Attacks hits on enemies have a 50% chance to trigger a vacuum blade that deals {{1}}% of ATK as DMG in a small AoE. This effect can occur no more than once every 2s."
        }
    ],
    "artifacts": [
        {
            "key": "Adventurer",
            "name": "Adventurer",
            "bonus": [
                "2 Piece: Max HP increased by 1000.",
                "4 Piece: Opening a chest regenerates 30% Max HP over 5s."
            ]
        },
        {
            "key": "Traveling Doctor",
            "name": "Traveling Doctor",
            "bonus": [
                "2 Piece: Increases incoming healing by 20%.",
                "4 Piece: Using Elemental Burst restores 20% HP."
            ]
        },
        {
            "key": "Lucky Dog",
            "name": "Lucky Dog",
            "bonus": [
                "2 Piece: DEF increased by 100.",
                "4 Piece: Picking up Mora restores 300 HP."
            ]
        },
        {
            "key": "Resolution of Sojourner",
            "name": "Resolution of Sojourner",
            "bonus": [
                "2 Piece: ATK +18%.",
                "4 Piece: Increases Charged Attack CRIT Rate by 30%."
            ]
        },
        {
            "key": "Tiny Miracle",
            "name": "Tiny Miracle",
            "bonus": [
                "2 Piece: All Elemental RES increased by 20%.",
                "4 Piece: Incoming elemental DMG increases corresponding Elemental RES by 30% for 10s. Can only occur once every 10s."
            ]
        },
        {
            "key": "Brave Heart",
            "name": "Brave Heart",
            "bonus": [
                "2 Piece: ATK +18%.",
                "4 Piece: Increases DMG by 30% against enemies with more than 50% HP."
            ]
        },
        {
            "key": "Defender’s Will",
            "name": "Defender’s Will",
            "bonus": [
                "2 Piece: DEF +30%",
                "4 Piece: For each different element present in your own party, the wearer’s Elemental RES to that corresponding element is increased by 30%."
            ]
        },
        {
            "key": "Martial Artist",
            "name": "Martial Artist",
            "bonus": [
                "2 Piece: Increases Normal Attack and Charged Attack DMG by 15%.",
                "4 Piece: After using Elemental Skill, increases Normal Attack and Charged Attack DMG by 25% for 8s."
            ]
        },
        {
            "key": "Gambler",
            "name": "Gambler",
            "bonus": [
                "2 Piece: Increases Elemental Skill DMG by 20%.",
                "4 Piece: Defeating an enemy has a 100% chance to remove Elemental Skill CD. Can only occur once every 15s."
            ]
        },
        {
            "key": "Scholar",
            "name": "Scholar",
            "bonus": [
                "2 Piece: Energy Recharge +20%",
                "4 Piece: Gaining Elemental Particles or Orbs gives 3 Energy to all party members who have a bow or a catalyst equipped. Can only occur once every 3s."
            ]
        },
        {
            "key": "Berserker",
            "name": "Berserker",
            "bonus": [
                "2 Piece: CRIT Rate +12%",
                "4 Piece: When HP is below 70%, CRIT Rate increases by an additional 24%."
            ]
        },
        {
            "key": "Instructor",
            "name": "Instructor",
            "bonus": [
                "2 Piece: Increases Elemental Mastery by 80.",
                "4 Piece: Upon triggering an Elemental Reaction, increases all party members’ Elemental Mastery by 120 for 8s."
            ]
        },
        {
            "key": "The Exile",
            "name": "The Exile",
            "bonus": [
                "2 Piece: Energy Recharge +20%",
                "4 Piece: Using an Elemental Burst regenerates 2 Energy for all party members (excluding the wearer) every 2s for 6s. This effect cannot stack."
            ]
        },
        {
            "key": "Thundering Fury",
            "name": "Thundering Fury",
            "bonus": [
                "2 Piece: Electro DMG Bonus +15%",
                "4 Piece: Increases damage caused by Overloaded, Electro-Charged and Superconduct by 40%. Triggering such effects decreases Elemental Skill CD by 1s. Can only occur once every 0.8s."
            ]
        },
        {
            "key": "Thundersoother",
            "name": "Thundersoother",
            "bonus": [
                "2 Piece: Electro RES increased by 40%.",
                "4 Piece: Increases DMG against enemies affected by Electro by 35%."
            ]
        },
        {
            "key": "Viridescent Venerer",
            "name": "Viridescent Venerer",
            "bonus": [
                "2 Piece: Anemo DMG Bonus +15%.",
                "4 Piece: Increases Swirl DMG by 60%. Decreases opponent’s Elemental RES to the element infused in the Swirl by 40% for 10s."
            ]
        },
        {
            "key": "Maiden Beloved",
            "name": "Maiden Beloved",
            "bonus": [
                "2 Piece: Character Healing Effectiveness +15%",
                "4 Piece: Using an Elemental Skill or Burst increases healing received by all party members by 20% for 10s."
            ]
        },
        {
            "key": "Archaic Petra",
            "name": "Archaic Petra",
            "bonus": [
                "2 Piece: Gain a 15% Geo DMG Bonus.",
                "4 Piece: Upon obtaining an Elemental Shard created through a Crystallize Reaction, all party members gain a 35% DMG Bonus for that particular element for 10s. Only one form of Elemental DMG Bonus can be gained in this manner at any one time."
            ]
        },
        {
            "key": "Retracing Bolide",
            "name": "Retracing Bolide",
            "bonus": [
                "2 Piece: Increases Shield Strength by 35%.",
                "4 Piece: While protected by a shield, gain an additional 40% Normal and Charged Attack DMG."
            ]
        },
        {
            "key": "Crimson Witch of Flames",
            "name": "Crimson Witch of Flames",
            "bonus": [
                "2 Piece: Pyro DMG Bonus +15%.",
                "4 Piece: Increases Overloaded and Burning DMG by 40%. Increases Vaporize and Melt DMG by 15%. Using an Elemental Skill increases 2-Piece Set effects by 50% for 10s. Max 3 stacks."
            ]
        },
        {
            "key": "Lavawalker",
            "name": "Lavawalker",
            "bonus": [
                "2 Piece: Pyro RES increased by 40%.",
                "4 Piece: Increases DMG against enemies affected by Pyro by 35%."
            ]
        },
        {
            "key": "Bloodstained Chivalry",
            "name": "Bloodstained Chivalry",
            "bonus": [
                "2 Piece: Physical DMG +25%",
                "4 Piece: After defeating an opponent, increases Charged Attack DMG by 50%, and reduces its Stamina cost to 0 for 10s."
            ]
        },
        {
            "key": "Noblesse Oblige",
            "name": "Noblesse Oblige",
            "bonus": [
                "2 Piece: Elemental Burst DMG +20%",
                "4 Piece: Using an Elemental Burst increases all party members’ ATK by 20% for 12s. This effect cannot stack."
            ]
        },
        {
            "key": "Gladiator’s Finale",
            "name": "Gladiator’s Finale",
            "bonus": [
                "2 Piece: ATK +18%.",
                "4 Piece: If the wielder of this artifact set uses a Sword, Claymore or Polearm, increases their Normal Attack DMG by 35%."
            ]
        },
        {
            "key": "Wanderer’s Troupe",
            "name": "Wanderer’s Troupe",
            "bonus": [
                "2 Piece: Increases Elemental Mastery by 80.",
                "4 Piece: Increases Charged Attack DMG by 35% if the character uses a Catalyst or a Bow."
            ]
        },
        {
            "key": "Prayers for Illumination",
            "name": "Prayers for Illumination",
            "bonus": [
                "1 Piece bonus: Affected by Pyro for 40% less time."
            ]
        },
        {
            "key": "Prayers for Destiny",
            "name": "Prayers for Destiny",
            "bonus": [
                "1 Piece bonus: Affected by Hydro for 40% less time."
            ]
        },
        {
            "key": "Prayers for Wisdom",
            "name": "Prayers for Wisdom",
            "bonus": [
                "1 Piece bonus: Affected by Electro for 40% less time."
            ]
        },
        {
            "key": "Prayers to Springtime",
            "name": "Prayers to Springtime",
            "bonus": [
                "1 Piece bonus: Affected by Cryo for 40% less time."
            ]
        },
        {
            "key": "Blizzard Strayer",
            "name": "Blizzard Strayer",
            "bonus": [
                "2 Piece: Cryo DMG Bonus +15%",
                "4 Piece: When a character attacks an enemy affected by Cryo, their CRIT Rate is increased by 20%. If the enemy is Frozen, CRIT Rate is increased by an additional 20%."
            ]
        },
        {
            "key": "Heart of Depth",
            "name": "Heart of Depth",
            "bonus": [
                "2 Piece: Hydro DMG Bonus +15%",
                "4 Piece: After using Elemental Skill, increases Normal Attack and Charged Attack DMG by 30% for 15s."
            ]
        },
        {
            "key": "Glacier and Snowfield",
            "name": "Glacier and Snowfield",
            "bonus": [
                "2 Piece: Cryo DMG Bonus +15%",
                "4 Piece: Increases Superconduct DMG by 100%. Increases Melt DMG by 15%. Using an Elemental Burst increases Cryo DMG Bonus by 30% for 10s."
            ]
        },
        {
            "key": "Prayers to the Firmament",
            "name": "Prayers to the Firmament",
            "bonus": [
                "1 Piece bonus: Affected by Anemo for 40% less time."
            ]
        }
    ],
    "materials": [
        {
            "key": "Freedom",
            "name": "Freedom"
        },
        {
            "key": "Prosperity",
            "name": "Prosperity"
        },
        {
            "key": "Dilligence",
            "name": "Dilligence"
        },
        {
            "key": "Resistance",
            "name": "Resistance"
        },
        {
            "key": "Ballad",
            "name": "Ballad"
        },
        {
            "key": "Gold",
            "name": "Gold"
        },
        {
            "key": "Tail of Boreas",
            "name": "Tail of Boreas",
            "bossName": "Andrius"
        },
        {
            "key": "Ring of Boreas",
            "name": "Ring of Boreas",
            "bossName": "Andrius"
        },
        {
            "key": "Spirit Locket of Boreas",
            "name": "Spirit Locket of Boreas",
            "bossName": "Andrius"
        },
        {
            "key": "Dvalin's Plume",
            "name": "Dvalin's Plume",
            "bossName": "Dvalin"
        },
        {
            "key": "Dvalin's Claw",
            "name": "Dvalin's Claw",
            "bossName": "Dvalin"
        },
        {
            "key": "Dvalin's Sigh",
            "name": "Dvalin's Sigh",
            "bossName": "Dvalin"
        },
        {
            "key": "Tusk of Monoceros Caeli",
            "name": "Tusk of Monoceros Caeli",
            "bossName": "Tartaglia"
        },
        {
            "key": "Shard of a Foul Legacy",
            "name": "Shard of a Foul Legacy",
            "bossName": "Tartaglia"
        },
        {
            "key": "Shadow of the Warrior",
            "name": "Shadow of the Warrior",
            "bossName": "Tartaglia"
        },
        {
            "key": "Decarabian",
            "name": "Decarabian"
        },
        {
            "key": "Guyun",
            "name": "Guyun"
        },
        {
            "key": "Mist Veiled Elixir",
            "name": "Mist Veiled Elixir"
        },
        {
            "key": "Boreal Wolf",
            "name": "Boreal Wolf"
        },
        {
            "key": "Aerosiderite",
            "name": "Aerosiderite"
        },
        {
            "key": "Dandelion Gladiator",
            "name": "Dandelion Gladiator"
        }
    ],
    "debuffs": [
        {
            "key": "Engulfing Storm",
            "name": "Engulfing Storm",
            "effect": "Continuously drains Energy Recharge."
        },
        {
            "key": "Slowing Water",
            "name": "Slowing Water",
            "effect": "Increases skill CD durations."
        },
        {
            "key": "Smoldering Flames",
            "name": "Smoldering Flames",
            "effect": "Continuously inflicts damage over time."
        },
        {
            "key": "Condensed Ice",
            "name": "Condensed Ice",
            "effect": "Increases stamina consumption."
        }
    ],
    "reactions": [
        {
            "key": "Burning",
            "name": "Burning",
            "effect": "Deals Pyro DMG over time."
        },
        {
            "key": "Crystalize",
            "name": "Crystalize",
            "effect": "Creates a crystal that will provide a shield when picked up."
        },
        {
            "key": "Electro-Charged",
            "name": "Electro-Charged",
            "effect": "Deals Electro DMG over time."
        },
        {
            "key": "Frozen",
            "name": "Frozen",
            "effect": "Freezes the target."
        },
        {
            "key": "Melt",
            "name": "Melt",
            "effect": "Deals extra damage."
        },
        {
            "key": "Overloaded",
            "name": "Overloaded",
            "effect": "Deals AoE Pyro DMG."
        },
        {
            "key": "Superconduct",
            "name": "Superconduct",
            "effect": "Deals AoE Cryo DMG and reduces the target's Physical RES by 50%."
        },
        {
            "key": "Swirl",
            "name": "Swirl",
            "effect": "Deals extra elemental damage and spreads the effect."
        },
        {
            "key": "Vaporize",
            "name": "Vaporize",
            "effect": "Deals extra damage."
        }
    ],
    "resonance": [
        {
            "key": "Enduring Rock",
            "name": "Enduring Rock",
            "effect": "Increases resistance to interruption. When protected by a shield, increases Attack DMG by 15%."
        },
        {
            "key": "Fervent Flames",
            "name": "Fervent Flames",
            "effect": "Affected by Cryo for 40% less time. Increases ATK by 25%."
        },
        {
            "key": "Soothing Waters",
            "name": "Soothing Waters",
            "effect": "Affected by Pyro for 40% less time. Increases incoming healing by 30%."
        },
        {
            "key": "Impetuous Winds",
            "name": "Impetuous Winds",
            "effect": "Decreases Stamina Consumption by 15%. Increases Movement SPD by 10%. Shortens Skill CD by 5%."
        },
        {
            "key": "High Voltage",
            "name": "High Voltage",
            "effect": "Affected by Hydro for 40% less time. Superconduct, Overloaded, and Electro-Charged have a 100% chance to generate an Electro Elemental Particle (CD: 5s)."
        },
        {
            "key": "Shattering Ice",
            "name": "Shattering Ice",
            "effect": "Affected by Electro for 40% less time. Increases CRIT Rate against enemies that are Frozen or affected by Cryo by 15%."
        },
        {
            "key": "Protective Canopy",
            "name": "Protective Canopy",
            "effect": "All Elemental RES by 15%.",
            "description": "Any 4 Unique Elements"
        }
    ]
}