{
  "characters": [
    {
      "key": "Albedo",
      "name": "Albedo",
      "description": "Un genio conosciuto come il Kreideprinz, lui è il Capo Alchimista e il Capitano del Team Investigativo dei Cavalieri di Favonius.",
      "skills": [
        {
          "key": "s1",
          "title": "Tecnica Favonius - Weiss",
          "description": null,
          "abilities": [
            {
              "key": "a1",
              "description": "Esegue 5 attacchi rapidi.",
              "descriptions": []
            },
            {
              "key": "a2",
              "description": "Consuma una certa quantità di Stamina perper scatenare 2 fendenti rapidi.",
              "descriptions": []
            },
            {
              "key": "a3",
              "description": "Si lancia in picchiata da mezz'aria per colpire il terreno sottostante, danneggiando i nemici lungo il percorso e assestando AoE DMG all'impatto.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s2",
          "title": "Abiogenesi: Isotoma Solare",
          "description": null,
          "abilities": [
            {
              "name": "Isotoma Solare",
              "description": "Albedo crea un Isotoma Solare usando l'alchimia, il quale infligge AoE Geo DMG alla comparsa.",
              "descriptions": [
                "Quando i nemici nel raggio d'azione dell'Isotoma Solare vengono colpiti, l'Isotoma Solare creerà un Fiore Momentaneo che infliggerà AoE Geo DMG. Il DMG inflitto scala sulla DEF di Albedo.",
                "Il Fiore Momentaneo può essere generato solo ogni 2s.",
                "Quando un personaggio si trova sull'Isotoma Solare, l'Isotoma Solare accumulerà potere Geo per formare una piattaforma cristallizzata che solleverà il personaggio fino ad una certa altezza. Solo una piattaforma cristallizzata può essere presente al momento.",
                "L'Isotoma Solare è considerato una costruzione Geo ."
              ]
            },
            {
              "key": "a2",
              "description": "Tieni premuto per designare la posizione dell'abilità.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s3",
          "title": "Rito della Progenitura: Marea Tettonica",
          "description": "Sotto il comando di Albedo, cristalli Geo scoppiano e si propagano, causando AoE Geo DMG.\nSe un Isotoma Solare creato da Albedo è in campo, saranno generati 7 Fiori Fatali nel raggio d'azione dell'Isotoma Solare, i quali esploderanno violentemente nella fioritura infliggendo AoE Geo DMG.\nIl DMG della Marea Tettonica e del Fiore Fatale DMG non genereranno Fiori Momentanei.",
          "abilities": []
        }
      ],
      "passives": [
        {
          "key": "p1",
          "title": "Lampo di Genio",
          "description": "Quando Albedo crea Materiale per l'Ascensione, ha il 10% di possibilità di ricevere il doppio del prodotto.",
          "descriptions": []
        },
        {
          "key": "p2",
          "title": "Potenza della Calcite",
          "description": "Il Fiore Momentaneo generato da Abiogenesi: Isotoma Solare infligge 25% di DMG in più ai nemici con HP inferiori al 50%.",
          "descriptions": []
        },
        {
          "key": "p3",
          "title": "Natura Omuncolare",
          "description": "Il Rito della Progenitura: Marea Tettonica aumenta l'Elemental Mastery dei membri del party vicini di 125 per 10s.",
          "descriptions": []
        }
      ],
      "constellations": [
        {
          "key": "c1",
          "title": "Fiore dell'Eden",
          "description": "Il Fiore Momentaneo generato dall'Abiogenesi: Isotoma Solare rigenera 1.2 Energia per Albedo.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c2",
          "title": "Apertura del Fanerozoico",
          "description": "Il Fiore Momentaneo generato dall'Abiogenesi: Isotoma Solare garantisce ad Albedo la Resa dei conti Fatale per 30s:",
          "secondDescription": "Scatenare il Rito della Progenitura: Marea Tettonica consuma tutta la quantità della Resa dei conti Fatale, aumentando il DMG inflitto dalla Marea Tettonica e i Fiori Fatali in base alla quantità dell'abilità consumata.",
          "descriptions": [
            "Ogni quantità della Resa dei conti Fatale aumenta il DMG in base alla DEF di Albedo.",
            "L'effetto si somma fino a 4 volte."
          ]
        },
        {
          "key": "c3",
          "title": "Grazia di Elio",
          "description": "Aumenta di 3 il livello dell'Abiogenesi: Isotoma Solare. Il livello massimo di Il livello massimo di upgrade è 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c4",
          "title": "Discesa della Divinità",
          "description": "L'Isotoma Solare aumenta il DMG dell'Attacco in Picchiata DMG del 30% per i membri del party attivi all'interno dell'AoE.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c5",
          "title": "Marea dell'Adeano",
          "description": "Aumenta di 3 il livello del Rito della Progenitura: Marea Tettonica. Il livello massimo di upgrade è 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c6",
          "title": "Polvere della Purificazione",
          "description": "Se i membri del party attivi all'interno dell'AoE sono protetti da uno scudo creato per cristallizazzione, il DMG dell'Isotoma Solare aumenta del 17%.",
          "secondDescription": null,
          "descriptions": []
        }
      ]
    },
    {
      "key": "Amber",
      "name": "Amber",
      "description": "Esuberante e sempre piena di energia, Amber “non per niente” è la migliore Outrider dei Cavalieri di Favonius.",
      "skills": [
        {
          "key": "s1",
          "title": "Tiratrice scelta",
          "description": null,
          "abilities": [
            {
              "key": "a1",
              "description": "Scocca fino a 5 frecce consecutive con l'arco.",
              "descriptions": []
            },
            {
              "key": "a2",
              "description": "Esegue un colpo mirato più preciso con DMG aumentato. Mentre si mira, fiamme avvolgono la punta della freccia. Una freccia infuocata caricata al massimo infligge Pyro DMG.",
              "descriptions": []
            },
            {
              "key": "a3",
              "description": "Scatena una pioggia di frecce a mezz'aria che infliggono AoE DMG all'impatto con il terreno.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s2",
          "title": "Baron Bunny",
          "description": null,
          "abilities": [
            {
              "name": "Baron Bunny",
              "description": null,
              "descriptions": [
                "Schernisce continuamente il nemico attirandone gli attacchi.",
                "L'HP di Baron Bunny scala sul Max HP di Amber.",
                "Quando viene distrutta o il tempo scade, Baron Bunny esplode provocando AoE Pyro DMG."
              ]
            },
            {
              "key": "a2",
              "description": "Aggiusta la direzione di lancio del Baron Bunny. Più a lungo si tiene premuto il pulsante, più lontano sarà il lancio.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s3",
          "title": "Pioggia Ardente",
          "description": "Scatena una pioggia continua di frecce infuocate che infligge AoE Pyro DMG.",
          "abilities": []
        }
      ],
      "passives": [
        {
          "key": "p1",
          "title": "Campionessa di volo",
          "description": "Riduce del 20% il consumo di Stamina del volo per tutti i membri del party.",
          "descriptions": []
        },
        {
          "key": "p2",
          "title": "Ogni Freccia colpisce il suo Bersaglio",
          "description": "Aumenta il CRIT Rate della Pioggia Ardente del 10% ed espande il suo AoE del 30%.",
          "descriptions": []
        },
        {
          "key": "p3",
          "title": "Colpo Preciso",
          "description": "Colpi mirati nei punti deboli aumenta il Base ATK del 15% per 10s.",
          "descriptions": []
        }
      ],
      "constellations": [
        {
          "key": "c1",
          "title": "Una Freccia per Domarli Tutti",
          "description": "Scocca 2 frecce per ogni colpo caricato. La seconda freccia infligge solo il 20% di DMG della prima freccia.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c2",
          "title": "Bunny Innescato",
          "description": "Baron Bunny, nuovo e migliorato! Detona manualmente Baron Bunny con un Colpo Mirato caricato al massimo ai suoi piedi. Esplosioni per detonazione manuale infliggono il 200% di DMG in più.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c3",
          "title": "Brucia!",
          "description": "Aumenta di 3 il livello della Pioggia Ardente. Il livello massimo di upgrade è 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c4",
          "title": "Non è una Bambola Qualsiasi...",
          "description": "Riduce del 20% il CD del Pupazzo Esplosivo. Aggiunge 1 carica in più.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c5",
          "title": "È Baron Bunny!",
          "description": "Aumenta di 3 il livello del Pupazzo Esplosivo. Il livello massimo di upgrade è 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c6",
          "title": "Incendio Incontrollato",
          "description": "Pioggia Ardente aumenta il Movement SPD e il Base ATK del 15% per 10s.",
          "secondDescription": null,
          "descriptions": []
        }
      ]
    },
    {
      "key": "Ayaka",
      "pending": true,
      "name": "Ayaka",
      "description": "È la segretaria al Yuehai Pavillion. Il sangue del qilin, una creatura illuminata, scorre nelle sue vene.",
      "skills": [],
      "passives": [],
      "constellations": []
    },
    {
      "key": "Barbara",
      "name": "Barbara",
      "description": "Ogni cittadino di Mondstadt adora Barbara. Tuttavia, ha imparato la parola \"idol\" da una rivista.",
      "skills": [
        {
          "key": "s1",
          "title": "Sussurro dell'Acqua",
          "description": null,
          "abilities": [
            {
              "key": "a1",
              "description": "Esegue 4 water splashes che infliggono Hydro DMG.",
              "descriptions": []
            },
            {
              "key": "a2",
              "description": "Consuma una certa quantità di Stamina per per infliggere AoE Hydro DMG dopo un po' di tempo.",
              "descriptions": []
            },
            {
              "key": "a3",
              "description": "Concentrando il potere Hydro, Barbara si lancia in picchiata da mezz'aria verso il terreno, danneggiando i nemici lungo il percorso e assestando AoE Hydro DMG all'impatto.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s2",
          "title": "Che Inizi lo Show",
          "description": "Fa apparire goccioline d’acqua simili a note musicali che intonano un Loop Melodico e infliggono Hydro DMG e Wet status ai nemici vicini.",
          "abilities": [
            {
              "name": "Loop Melodico",
              "description": null,
              "descriptions": [
                "Gli Attacchi Normali di Barbara curano tutti i membri del party e i personaggi alleati vicini con una certa quantità di HP, che scala sul Max HP di Barbara.",
                "L’Attacco Caricato genera 4 volte tanto la quantità di cura.",
                "Rigenera una certa quantità di HP del personaggio a intervalli regolari.",
                "Applica il Wet status al personaggio e ai nemici colpiti."
              ]
            }
          ]
        },
        {
          "key": "s3",
          "title": "Miracolo Splendente",
          "description": "Cura gli alleati e l’intero party con una grande quantità di HP che scala sul Max HP di Barbara.",
          "abilities": []
        }
      ],
      "passives": [
        {
          "key": "p1",
          "title": "Con Tutto il mio Cuore",
          "description": "Quando si ottiene un Perfect Cooking su un piatto con effetti ristorativi, c’è il 12% di possibilità di ottenere il doppio del prodotto.",
          "descriptions": []
        },
        {
          "key": "p2",
          "title": "Stagione Gloriosa",
          "description": "Riduce del 12% il Consumo di Stamina dei personaggi all’interno del Loop Melodioso del Che Inizi lo Show.",
          "descriptions": []
        },
        {
          "key": "p3",
          "title": "Bis!",
          "description": "Quando un personaggio raccoglie un Elemental Orb/Particle, la durata  del Loop Melodioso del Che Inizi lo Show si estende di 1s. L’estensione massima è di 5s.",
          "descriptions": []
        }
      ],
      "constellations": [
        {
          "key": "c1",
          "title": "Canzoni Gioiose",
          "description": "Barbara Rigenera 1 Energia ogni 10s.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c2",
          "title": "Esplosione di Vitalità",
          "description": "Riduce del 15% il CD di Che Inizi lo Show. Durante la sua durata, il personaggio in uso ottiene il 15% di Hydro DMG Bonus.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c3",
          "title": "Stella del Domani",
          "description": "Aumenta di 3 il livello di Miracolo Splendente. Il livello massimo di upgrade è 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c4",
          "title": "Sia l’Attenzione il Mio Potere",
          "description": "Ogni nemico colpito da Attacchi Caricati da Barbara rigenera 1 Energia. Con qualsiasi Attacco Caricato simile si possono generare un massimo di 5 Energia.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c5",
          "title": "La Compagnia più Pura",
          "description": "Aumenta di 3 il livello di Che Inizi lo Show.\nIl livello massimo di upgrade è 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c1",
          "title": "Dedicando Tutto a Te",
          "description": "Quando Barbara non è schierata sul campo e il personaggio in uso muore:",
          "secondDescription": "Questo effetto può avvenire solo una volta ogni 15 mins.",
          "descriptions": [
            "Rianima automaticamente il personaggio.",
            "Rigenera al 100% l’HP del personaggio."
          ]
        }
      ]
    },
    {
      "key": "Beidou",
      "name": "Beidou",
      "description": "Beidou è la leader della Crux, una flotta armata di stanza nel Porto di Liyue. Flotta armata è esattamente quello che sembra: una flotta armata fino ai denti.",
      "skills": [
        {
          "key": "s1",
          "title": "Nata dall’Oceano",
          "description": null,
          "abilities": [
            {
              "key": "a1",
              "description": "Esegue 5 attacchi rapidi.",
              "descriptions": []
            },
            {
              "key": "a2",
              "description": "Consuma Stamina nel tempo per eseguire continui attacchi concatenati. Alla fine della sequenza, infligge un colpo molto più potente.",
              "descriptions": []
            },
            {
              "key": "a3",
              "description": "Si lancia in picchiata da mezz'aria per colpire il terreno sottostante, danneggiando i nemici lungo il percorso e assestando AoE DMG all'impatto.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s2",
          "title": "Chiamamaree",
          "description": "Nulla di cui preoccuparsi. Qualora qualcuno dovesse alzare le mani su di lei o i suoi compagni, Beidou si vendicherà 10 volte tanto con spada e saette.",
          "abilities": [
            {
              "key": "a1",
              "description": "Accumulando il potere dei fulmini, Beidou fende in avanti la sua lama con ferocia, infliggendo Electro DMG.",
              "descriptions": []
            },
            {
              "key": "a2",
              "description": "Solleva la sua arma come uno scudo. Il Max DMG assorbito scala sul Max HP di Beidou. infligge Electro DMG, usando l’energia accumulata nella Claymore finché non viene rilasciata o l’abilità scade. Il DMG inflitto scala con il numero di colpi parati da Beidou mentre l’abilità è attiva. Se si scatena l'effetto per 2 volte, si raggiungerà il più alto DMG Bonus. Lo scudo possiede le seguenti proprietà:",
              "descriptions": [
                "Ha il 250% di Absorption Efficiency dell'Electro DMG.",
                "All'attivazione applica l'elemento Electro a Beidou."
              ]
            }
          ]
        },
        {
          "key": "s3",
          "title": "Stormbreaker",
          "description": "Ricordando la sua battaglia contro la grande bestia Haishan, Beidou richiama a sé quell’antica mostruosa forza e i fulmini per creare un Scudo delle Tempeste attorno a lei che infligge Electro DMG ai nemici vicini.",
          "abilities": [
            {
              "name": "Scudo delle Tempeste",
              "description": null,
              "descriptions": [
                "Attacchi Normali e Caricati che vanno a segno creano una scarica elettrica che passa da un nemico all’altro infliggendo Electro DMG.",
                "All’interruzione aumenta la resistenza del personaggio e riduce il DMG preso.",
                "Si può generare solo 1 scarica elettrica al secondo."
              ]
            }
          ]
        }
      ],
      "passives": [
        {
          "key": "p1",
          "title": "Conquistatrice delle Maree",
          "description": "Riduce del 20% il consumo di Stamina di tutti i membri mentre si nuota.",
          "descriptions": []
        },
        {
          "key": "p2",
          "title": "Retribuzione",
          "description": "Contrattaccare con Chiamamaree nel preciso istante in cui si è colpiti infligge il massimo DMG Bonus possibile.",
          "descriptions": []
        },
        {
          "key": "p3",
          "title": "Protezione del Leviatano",
          "description": "Gain the following effects for 10s after unleashing Chiamamaree with its maximum DMG Bonus:",
          "descriptions": [
            "I DMG e l’ ATK SPD inflitti da Attacchi Normali e Caricati sono aumentati del 15%.",
            "Riduce notevolmente il ritardo degli Attacchi Caricati."
          ]
        }
      ],
      "constellations": [
        {
          "key": "c1",
          "title": "Flagello della Bestia Marina",
          "description": "Quando lo Stormbreaker è attivo:",
          "secondDescription": null,
          "descriptions": [
            "Crea uno scudo che assorbe il 16% della Max HP di Beidou per 15s.",
            "Lo scudo assorbe il 250% di Electro DMG con più efficacia."
          ]
        },
        {
          "key": "c2",
          "title": "Sul Mare Turbolento, il Tuono Sorge",
          "description": "I fulmini dello Stormbreaker possono colpire 2 nemici simultaneamente.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c3",
          "title": "Evocatrice di Tempeste",
          "description": "Aumenta di 3 il livello di Chiamamaree. Il livello massimo di upgrade è 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c4",
          "title": "Vendetta Istantanea",
          "description": "Entro 10 secondi dall’ultimo DMG ricevuto, gli Attacchi Normali di Beidou ricevono un 20% di Electro DMG in più.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c5",
          "title": "Camminatrice delle Maree Cremisi",
          "description": "Aumenta di 3 il livello di Stormbreaker. Il livello massimo di upgrade è 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c6",
          "title": "Rovina del Male",
          "description": "Durante lo Stormbreaker l’ Electro RES dei nemici vicini si riduce del 15%.",
          "secondDescription": null,
          "descriptions": []
        }
      ]
    },
    {
      "key": "Bennett",
      "name": "Bennett",
      "description": "Un avventuriero retto e di buona natura di Mondstadt che è disgraziatamente ed estremamente sfortunato.",
      "skills": [
        {
          "key": "s1",
          "title": "Colpo di Fortuna",
          "description": null,
          "abilities": [
            {
              "key": "a1",
              "description": "Esegue 5 attacchi rapidi.",
              "descriptions": []
            },
            {
              "key": "a2",
              "description": "Consuma una certa quantità di Stamina per scatenare 2 fendenti rapidi.",
              "descriptions": []
            },
            {
              "key": "a3",
              "description": "Si lancia in picchiata da mezz'aria per colpire il terreno sottostante, danneggiando i nemici lungo il percorso e assestando AoE DMG all'impatto.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s2",
          "title": "Sovraccarico di Passione",
          "description": "Bennett mette nella sua spada fuoco e passione per l'avventura. I risultati potrebbero variare in base a quanto è motivato.",
          "abilities": [
            {
              "key": "a1",
              "description": "Una singola e rapida fiamma colpisce infliggendo Pyro DMG.",
              "descriptions": []
            },
            {
              "key": "a2",
              "description": "Quando viene scatenato, produce diversi effetti a seconda del livello di Carica.",
              "secondDescription": "Bennett non subisce danno dall'esplosione.",
              "descriptions": [
                "Livello 1: Colpisce due volte infliggendo Pyro DMG e scaglia via i nemici.",
                "Livello 2: Unleashes 3 consecutive attacks che infligge impressive Pyro DMG, but the last attack innesca an explosion that launches both Bennet and the enemy."
              ]
            }
          ]
        },
        {
          "key": "s3",
          "title": "Fantastic Voyage",
          "description": "Bennett leaps towards the enemy and performs a Attacco in Picchiata, Infliggere Pyro DMG, creating an Inspiration Field.",
          "abilities": [
            {
              "name": "Inspiration Field",
              "description": null,
              "descriptions": [
                "If the health of a character in the circle is equal to or falls below 70%, their health will continuously regenerate. Regeneration scales based on Bennett’s Max HP.",
                "If the health of a character in the circle is higher than 70%, they gain an ATK Bonus that is based on Bennett’s Base ATK.",
                "Applica the Pyro element to characters within the Field."
              ]
            }
          ]
        }
      ],
      "passives": [
        {
          "key": "p1",
          "title": "It Should Be Safe...",
          "description": "Quando viene schierato in una spedizione  in Mondstadt, il tempo di esplorazione si riduce del 25%.",
          "descriptions": []
        },
        {
          "key": "p2",
          "title": "Rekindle",
          "description": "Decreases Passion Overload’s CD by 20%.",
          "descriptions": []
        },
        {
          "key": "p3",
          "title": "Fearnaught",
          "description": "When inside the area created by Fantastic Voyage, Passion Overload takes on the following effects:",
          "descriptions": [
            "CD is reduced by 50%.",
            "Bennett will not be launched by the effects of Charge Level 2."
          ]
        }
      ],
      "constellations": [
        {
          "key": "c1",
          "title": "Grand Expectation",
          "description": "Fantastic Voyage’s ATK increases no longer has an HP restriction, and gains an additional 20% Base ATK.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c2",
          "title": "Impasse Conqueror",
          "description": "When Bennett’s HP falls below 70%, his Energia Recharge is increased by 30%.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c3",
          "title": "Unstoppable Fervor",
          "description": "Aumenta di 3 il livello di Passion Overload by 3. Il livello massimo di upgrade è 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c4",
          "title": "Unexpected Odyssey",
          "description": "Using a Normal Attack when executing the second attack of Passion Overload’s Charge Level 1 allows an additional attack to be performed. This additional attack does 135% of the second attack’s DMG.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c5",
          "title": "True Explorer",
          "description": "Aumenta di 3 il livello di Fantastic Voyage by 3. Il livello massimo di upgrade è 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c6",
          "title": "Fire Ventures with Me",
          "description": "Sword, Claymore, or Polearm-wielding characters inside Fantastic Voyage’s raggio d'azione gain a 15% Pyro DMG Bonus. Normal and Charged Attacks now do Pyro DMG.",
          "secondDescription": null,
          "descriptions": []
        }
      ]
    },
    {
      "key": "Chongyun",
      "name": "Chongyun",
      "description": "AUn giovane esorcista proveniente da una famiglia di esorcisti. Fa di tutto per sopprimere la sua vera e pura energia positiva.",
      "skills": [
        {
          "key": "s1",
          "title": "Tormenta del Demone",
          "description": null,
          "abilities": [
            {
              "key": "a1",
              "description": "Esegue 4 attacchi rapidi.",
              "descriptions": []
            },
            {
              "key": "a2",
              "description": "Consuma Stamina nel tempo per eseguire un continuo attacco vorticoso contro tutti i nemici vicini. Alla fine della sequenza, infligge un colpo molto più potente.",
              "descriptions": []
            },
            {
              "key": "a3",
              "description": "Si lancia in picchiata da mezz'aria per colpire il terreno sottostante, danneggiando i nemici lungo il percorso e assestando AoE DMG all'impatto.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s2",
          "title": "Lama Spiritica - Velo Congelato di Chonghua",
          "description": "Chongyun colpisce il terreno con la Claymore innestando un'esplosione Cryo che infligge AoE Cryo DMG circolare. Dopo un po' di tempo, il gelo dell'esplosione crea un Campo Congelato di Chounghua, all'interno del quale tutti i DMG inflitti da Attacchi Normali e Caricati da Spada, Claymore e Asta saranno convertiti in Cryo DMG.",
          "abilities": []
        },
        {
          "key": "s3",
          "title": "Lama Spiritica - Stella della Nube di Commiato",
          "description": "Eseguendo sigilli segreti con le mani, Chongyun Fa apparire 3 Lame Spiritiche giganti a mezz'aria che precipitano sul suolo uno alla volta ed esplodono all'impatto. Quando una lama spiritica esplode, infligge AoE Cryo DMG e scaglia via i nemici.",
          "abilities": []
        }
      ],
      "passives": [
        {
          "key": "p1",
          "title": "Viaggio Valoroso",
          "description": "Quando viene schierato in una spedizione in Liyue, il tempo di esplorazione si riduce del 25%.",
          "descriptions": []
        },
        {
          "key": "p2",
          "title": "Respiro Controllato",
          "description": "Aumenta dell'8% lo SPD degli Attacchi Normali dei personaggi che usano Spada, Claymore o Asta all'interno del campo creato dalla Lama Spiritica - Velo Gelato di Chounghua.",
          "descriptions": []
        },
        {
          "key": "p3",
          "title": "Lama Rimechaser",
          "description": "Quando il campo generato dalla Lama Spiritica - Velo Gelato di Chonhua scompare, un'altra lama spiritica apparirà per colpire i nemici vicini, infliggendo il 100% di DMG dell'Abilità Velo Gelato di Chonghua come AoE Cryo DMG. I nemici colpiti hanno Cryo RES ridotto del 10% per 8s.",
          "descriptions": []
        }
      ],
      "constellations": [
        {
          "key": "c1",
          "title": "Ghiaccio Scatenato",
          "description": "L’ultimo attacco della combo di Attacchi Normali rilascia 3 lame di ghiaccio, ciascuna delle quali infligge il 50% dell’ATK di Chongyun come Cryo DMG su tutti i nemici che incontra.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c2",
          "title": "Rivoluzione Atmosferica",
          "description": "Il CD dell’Elemental Skills e dell’Elemental Bursts generati all’interno del campo della Lama Spiritica - Velo Gelato di Chongyun si riducono del 15%.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c3",
          "title": "Cloudburst",
          "description": "Aumenta di 3 il livello della Lama Spiritica - Stella della Nube di Commiato. Il livello massimo di upgrade è 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c4",
          "title": "Cieli Ghiacciati",
          "description": "Chongyun Rigenera 1 Energia ogni volta che colpisce un nemico afflitto da Cold o Frozen status. Questo effetto può avvenire solo una volta ogni 2s.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c5",
          "title": "La Retta Via",
          "description": "Aumenta di 3 il livello della Lama Spiritica - Velo di Chonghua. Il livello massimo di upgrade è 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c6",
          "title": "Rally of Four Blades",
          "description": "Lama Spiritica - Stella della Nube di Commiato infligge il 15% di DMG in più ai nemici con un Max HP rimasto inferiore a quello di Chongyun. Questa abilità genera 1 Lama Spiritica in più.",
          "secondDescription": null,
          "descriptions": []
        }
      ]
    },
    {
      "key": "Diluc",
      "name": "Diluc",
      "description": "Magnate di un impero del vino a Monstandt, impareggiabile in ogni modo possibile.",
      "skills": [
        {
          "key": "s1",
          "title": "Spada Temprata",
          "description": null,
          "abilities": [
            {
              "key": "a1",
              "description": "Esegue 4 attacchi rapidi.",
              "descriptions": []
            },
            {
              "key": "a2",
              "description": "Consuma Stamina nel tempo per eseguire continui attacchi concatenati. Alla fine della sequenza, infligge un colpo molto più potente.",
              "descriptions": []
            },
            {
              "key": "a3",
              "description": "Si lancia in picchiata da mezz'aria per colpire il terreno sottostante, danneggiando i nemici lungo il percorso e assestando AoE DMG all'impatto.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s2",
          "title": "Impeto Ustionante",
          "description": "Esegue un fendente frontale che infligge Pyro DMG. Quest'Abilità può essere attivata 3 volte di fila. Se non attivati immediatamente entra in CD.",
          "abilities": []
        },
        {
          "key": "s3",
          "title": "Alba",
          "description": "Rilascia un'intensa fiammata che respinge i nemici vicini, infliggendo Pyro DMG. La fiamma poi converge verso l'arma, e genera una Fenice che vola avanti e infligge notevoli Pyro DMG a tutti i nemici che incontra. Raggiunta la sua destinazione, la Fenice esplode assestando una grande quantità di AoE Pyro DMG. Le fiamme sulla lama di Diluc applicano Pyro DMG agli Attacchi Normali e Caricati per un po' di tempo.",
          "abilities": []
        }
      ],
      "passives": [
        {
          "key": "p1",
          "title": "Tradizione del Cavaliere dell'Alba",
          "description": "Rimborsa il 15% dei minerali usati per la creazione di Claymore.",
          "descriptions": []
        },
        {
          "key": "p2",
          "title": "Senza Sosta",
          "description": "Il costo di Stamina degli Attacchi Caricati di Diluc si riduce del 50%, e la sua durata aumenta di 3s.",
          "descriptions": []
        },
        {
          "key": "p3",
          "title": "Benedizione della Fenice",
          "description": "Il potenziamento Pyro dell'Alba dura 4s in più. Inoltre, Diluc ottiene il 20% di Pyro DMG Bonus per tutta la durata dell'effetto.",
          "descriptions": []
        }
      ],
      "constellations": [
        {
          "key": "c1",
          "title": "Condanna",
          "description": "Diluc infligge il 15% di DMG in più ai nemici con HP inferiore al 50%.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c2",
          "title": "Brace Ustionante",
          "description": "Quando Diluc prende DMG, il Base ATK aumenta del 10% e l'ATK SPD aumenta del 5%. Dura per 10s. L'effetto si può accumulare fino a 3 volte and e può avvenire una volta ogni 1.5s.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c3",
          "title": "A Ferro e Fuoco",
          "description": "Aumenta di 3 il livello di Impeto Ustionante. Il livello massimo di upgrade è 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c4",
          "title": "Flusso Infuocato",
          "description": "Attivare Impeto Ustionante in sequenza aumenta notevolmente i danni inflitti. Attivare entro 2s il successivo Impeto Ustionante in combo infligge il 40% di DMG in più. L'effetto dura per i prossimi 2s.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c5",
          "title": "Fenice, Araldo dell'Alba",
          "description": "Aumenta di 3 il livello dell'Alba. Il livello massimo di upgrade è 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c6",
          "title": "Spada Infuocata, Nemesi dell'Oscurità",
          "description": "Dopo l'attivazione dell'Impeto Ustionante, entro i prossimi 6s il DMG e l'ATK SPD dei 2 Attacchi Normali successivi aumenta del 30%. Inoltre, l'Impeto Ustionante non interrompe la combo degli Attacchi Normali.",
          "secondDescription": null,
          "descriptions": []
        }
      ]
    },
    {
      "key": "Diona",
      "name": "Diona",
      "description": "Una giovane ragazza che ha ereditato tracce di sangue non umano. Lei è l'incredibile e popolare barista della taverna della Coda del Gatto.",
      "skills": [
        {
          "key": "s1",
          "title": "Stile Katzlein",
          "description": null,
          "abilities": [
            {
              "key": "a1",
              "description": "Scocca fino a 5 frecce consecutive con l'arco.",
              "descriptions": []
            },
            {
              "key": "a2",
              "description": "Esegue un colpo mirato più preciso con DMG aumentato. Mentre si mira, ghiaccio pungente avvolge la punta della freccia. Una freccia ghiacciata caricata al massimo infligge Cryo DMG.",
              "descriptions": []
            },
            {
              "key": "a3",
              "description": "Scatena una pioggia di frecce a mezz'aria che infliggono AoE DMG all'impatto con il terreno.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s2",
          "title": "Zampa di Ghiaccio",
          "description": "Scaglia una Zampa di Ghiaccio che infligge Cryo DMG e forma uno scudo. Il DMG Absorption dello scudo scala sul Max HP di Diona e la sua durata sul numero di Zampe di Ghiaccio che colpiscono i nemici.",
          "abilities": [
            {
              "key": "a1",
              "description": "Scaglia rapidamente 2 Zampe di Ghiaccio.",
              "descriptions": []
            },
            {
              "key": "a2",
              "description": "Scivola rapidamente all'indietro prima di scagliare 5 Zampe di Ghiaccio. Lo scudo creato ottiene il 75% di DMG Absorption Bonus, il 250% di Cryo DMG Absorption Bonus e all'attivazione affligge di Cryo il personaggio attivo per un breve periodo.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s3",
          "title": "Cocktail Firmato",
          "description": "Lancia una speciale bevanda fredda che infligge AoE Cryo DMG e crea in un AoE una Foschia Alcolica.",
          "abilities": [
            {
              "name": "Foschia Alcolica",
              "description": null,
              "descriptions": [
                "Infligge continui Cryo DMG ai nemici all'interno dell'AoE.",
                "Rigenera continuamente l'HP dei personaggi all'interno dell'AoE."
              ]
            }
          ]
        }
      ],
      "passives": [
        {
          "key": "p1",
          "title": "Offre la casa",
          "description": "Quando si ottiene un Perfect Cooking su un piatto con effetti ristorativi, c'è il 12% di possibilità di ottenere il doppio del prodotto.",
          "descriptions": []
        },
        {
          "key": "p2",
          "title": "Ricetta Segreta della Coda del Gatto",
          "description": "Aumenta Il Movement SPD del 10% e riduce il consumo di Stamina del 10% ai personaggi protetti dallo scudo creato dalle Zampe di Ghiaccio.",
          "descriptions": []
        },
        {
          "key": "p3",
          "title": "Delirio dell'Alcolizzato",
          "description": "I nemici che entrano nell'AoE del Cocktail Firmato hanno ATK ridotto del 10% per 15s.",
          "descriptions": []
        }
      ],
      "constellations": [
        {
          "key": "c1",
          "title": "Un Sapore Persistente",
          "description": "Rigenera 15 Energia per Diona quando scade Cocktail Firmato.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c2",
          "title": "Agitata, non Fusa",
          "description": "Aumenta del 15% il DMG delle Zampe di Ghiaccio’ e il DMG Absorption dello scudo. Inoltre, quando colpiscono nemici, crea uno scudo per gli altri personaggi vicini sul campo con il 50% di DMG Absorption delle Zampe di Ghiaccio per 5s.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c3",
          "title": "U-Un'altro Giro?",
          "description": "Aumenta di 3 il livello del Cocktail Firmato. Il livello massimo di upgrade è 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c4",
          "title": "Assassina nell'Industria del Vino",
          "description": "All'interno del raggio d'azione del Cocktail Firmato, il tempo di carica del Colpo Mirato di Diona si riduce del 60%.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c5",
          "title": "Doppio giro, Ghiacciato!",
          "description": "Aumenta di 3 il livello delle Zampe di Ghiaccio. Il livello massimo di upgrade è 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c6",
          "title": "Orario di Chiusura",
          "description": "I personaggi all 'interno del raggio d' azione del Cocktail Firmato ottiene i seguenti effetti in base alla quantità di HP",
          "secondDescription": null,
          "descriptions": [
            "Aumenta del 30% l'Incoming Healing Bonus quando l'HP è inferiore o pari al 50%.",
            "L'Elemental Mastery aumenta di 200 quando l'HP supera il 50%."
          ]
        }
      ]
    },
    {
      "key": "Fischl",
      "name": "Fischl",
      "description": "Una ragazza misteriosa che si fa chiamare \"Prinzessia der Verurteilung\" e viaggia con un corvo notturno di norme Oz.",
      "skills": [
        {
          "key": "s1",
          "title": "Saette della Rovina",
          "description": null,
          "abilities": [
            {
              "key": "a1",
              "description": "Scocca fino a 5 frecce consecutive con l'arco.",
              "descriptions": []
            },
            {
              "key": "a2",
              "description": "Esegue un colpo mirato più preciso con DMG aumentato. Mentre si mira, gli spiriti oscuri del fulmini dell'Immernachtreich rispondono al richiamo della Prinzessin e incantano la punta della freccia. Quando viene incantata al massimo il Rachsuchtig Blitz infligge notevoli Electro DMG.",
              "descriptions": []
            },
            {
              "key": "a3",
              "description": "Scatena una pioggia di frecce a mezz'aria che infliggono AoE DMG all'impatto con il terreno.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s2",
          "title": "Nightrider",
          "description": "Evoca Oz, il corvo notturno nato dall'oscurità e dai fulmini discende in terra infliggendo Electro DMG in un piccolo AoE. Per l'intera durata dell'abilità, Oz attaccherà senza sosta i nemici vicini con Freikugel. Tieni premuto per designare dove evocare Oz. Premi ancora mentre l'abilità è attiva per evocarlo a fianco di Fischl.",
          "abilities": []
        },
        {
          "key": "s3",
          "title": "Fantasmagorìa Notturna",
          "description": "Evoca Oz che estende le sue ali crepuscolari per difendere Fischl. Ha le seguenti proprietà:",
          "abilities": [
            {
              "name": "",
              "description": null,
              "descriptions": [
                "Fischl si tramuta in Oz aumentando notevolmente la sua Movement Speed.",
                "Scatena fulmini che infliggono Electro DMG ai nemici vicini che incontra. Ciascun nemico può essere colpito solo una volta.",
                "Quando l'abilità scade, Oz rimane sul campo per combattere chi ostacola la sua Prinzessin. Se Oz è già schierato, la sua durata ricomincia."
              ]
            }
          ]
        }
      ],
      "passives": [
        {
          "key": "p1",
          "title": "Mein Hausgarten",
          "description": "Quando viene schierato in una spedizione a Mondstadt, il tempo di esplorazione si riduce del 25%.",
          "descriptions": []
        },
        {
          "key": "p2",
          "title": "Predatrice delle Stelle",
          "description": "Quando Fischl colpisce Oz con un Colpo Mirato caricato al massimo, Oz scatena una Retribuzione Tuonante che infligge AoE Electro DMG pari al 152.7% del DMG della freccia scoccata.",
          "descriptions": []
        },
        {
          "key": "p3",
          "title": "Possa la tua Peccaminosa Maledizione Svanire!",
          "description": "Se un personaggio innesca una Reazione Elementale mentre Oz è sul campo, il nemico sarà colpito da una Retribuzione Tuonante che infligge Electro DMG pari al 80% dell'ATK di Fischl.",
          "descriptions": []
        }
      ],
      "constellations": [
        {
          "key": "c1",
          "title": "Sguardo degli Abissi",
          "description": "Anche se non è presente in combattimento, Oz veglierà sempre su Fischl con i suoi occhi di corvo. Quando Fischl attaccherà un nemico, Oz scatena un'attacco congiunto infliggendo il 22% dell'ATK DMG.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c2",
          "title": "Divoratrice di Tutti i Peccati",
          "description": "Nightrider infligge il 200% di ATK DMG in più e il suo AoE aumenta del 50%.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c3",
          "title": "Ali degli Incubi",
          "description": "Aumenta di 3 il livello di Nightrider. Il livello massimo di upgrade è 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c4",
          "title": "Pellegrinaggio nelle tenebre",
          "description": "Fantasmagorìa Notturna infligge il 222% Electro DMG ai nemici vicini. Quando l'abilità scade, Fischl Rigenera 20% dei suoi HP.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c5",
          "title": "Contro la Luce Fuggevole",
          "description": "Aumenta di 3 il livello di Fantasmagorìa Notturna. Il livello massimo di upgrade è 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c6",
          "title": "Corvo della notte eterna",
          "description": "Aumenta di 2s la durata dell'evocazione di Oz. Inoltre, quando presente Oz combatterà con il personaggio attivo infliggendo il 30% di ATK di Fischl come Electro DMG.",
          "secondDescription": null,
          "descriptions": []
        }
      ]
    },
    {
      "key": "Ganyu",
      "name": "Ganyu",
      "description": "È la segretaria al Yuehai Pavillion. Il sangue del qilin, una creatura illuminata, scorre nelle sue vene.",
      "skills": [
        {
          "key": "s1",
          "title": "Tecnica dell'Arco Liutian",
          "description": null,
          "abilities": [
            {
              "key": "a1",
              "description": "Scocca fino a 6 frecce consecutive con l'arco.",
              "descriptions": []
            },
            {
              "key": "a2",
              "description": "Esegue un colpo mirato più preciso con DMG aumentato. Mentre si mira, un'aura ghiacciata avvolge la punta della freccia. Ha diversi effetti in base a quanto a lungo si carica il colpo:",
              "descriptions": [
                "Livello di Carica 1: Scocca una freccia ghiacciata che infligge Cryo DMG.",
                "Livello di Carica 2: Scocca a Freccia Stella Assiderata che infligge Cryo DMG. La Freccia Stella Assiderata si frammenta dopo aver colpito il bersaglio infliggendo AoE Cryo DMG."
              ]
            },
            {
              "key": "a3",
              "description": "Scatena una pioggia di frecce a mezz'aria che infliggono AoE DMG all'impatto con il terreno.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s2",
          "title": "Retaggio del Qilin",
          "description": "Schivando ogni impurità, Ganyu indietreggia in scivolata lasciando un Fiore di Loto Assiderato che infligge AoE Cryo DMG.",
          "abilities": [
            {
              "name": "Fiore di Loto Assiderato",
              "descriptions": [
                "Schernisce continuamente il nemico attirandone gli attacchi.",
                "La Durata scala sul Max HP di Ganyu.",
                "Si Frammenta profondamente assestando AoE Cryo DMG quando viene distrutto o scade."
              ]
            }
          ]
        },
        {
          "key": "s3",
          "title": "Pioggia Celeste",
          "description": "Converge il vento gelido e la neve per generare una Sacra Perla di Ghiaccio che esorcizza il male.\n Mentre è attiva, la Sacra Perla di Ghiaccio farà piovere continuamente schegge di ghiaccio all'interno del suo AoE, infliggendo Cryo DMG.",
          "abilities": []
        }
      ],
      "passives": [
        {
          "key": "p1",
          "title": "Riservata per la Caccia",
          "description": "Rimborsa il 15% dei minerali usati per la creazione di Archi.",
          "descriptions": []
        },
        {
          "key": "p2",
          "title": "Cuore Impenetrabile",
          "description": "Dopo aver scoccato una Freccia Stella Assiderata, il CRIT Rate della Freccia e della conseguente frammentazione aumenta del 20% per 5s.",
          "descriptions": []
        },
        {
          "key": "p3",
          "title": "Armonia tra Terra e Paradiso",
          "description": "Pioggia Celeste conferisce 20% Cryo DMG Bonus ai membri attivi del party all'interno dell'AoE.",
          "descriptions": []
        }
      ],
      "constellations": [
        {
          "key": "c1",
          "title": "Beve Rugiada",
          "description": "Una Freccia Stella Assiderata di Livello 2 o la sua Frammentazione riduce del 15% la Cryo RES dei nemici per 6s.\n Un colpo a segno rigenera 2 Energie per Ganyu. L'effetto può avvenire una volta per Freccia Stella Assiderata di Livello 2, a prescindere che la freccia o la sua frammentazione colpiscano i nemici.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c2",
          "title": "Il Buon Auspicio",
          "description": "Retaggio del Qilin ottiene 1 carica in più.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c3",
          "title": "Dominatrice delle Nuvole",
          "description": "Aumenta di 3 il livello della Pioggia Celeste. Il livello massimo di upgrade è 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c4",
          "title": "Riposo a Ovest",
          "description": "I nemici all'interno dell'Aoe della Pioggia Celeste subiscono DMG aumentato. L'effetto si potenzia nel tempo.\nI DMG aumentati inflitti partono dal 5% e aumentano del 5% ognj 3s, al massimo fino al 25%.\nL'effetto continua per 3s anche quando il nemico ha abbandonato l'AoE.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c5",
          "title": "La Misericordiosa",
          "description": "Aumenta di 3 il livello del Retaggio del Qilin. Il livello massimo di upgrade è 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c6",
          "title": "La Clemente",
          "description": "La Prima Freccia Stella Assiderata scoccata entro 30s dall'attivazione di Retaggio del Qilin non ha bisogno di alcun caricamento. .",
          "secondDescription": null,
          "descriptions": []
        }
      ]
    },
    {
      "key": "HuTao",
      "name": "Hu Tao",
      "description": "La 77sima Direttrice del Wangsheng Funeral Parlor. Lei ha preso le redini dell'attività ad un'età relativamente giovane.",
      "skills": [
        {
          "key": "s1",
          "title": "Secret Spear of Wangsheng",
          "description": null,
          "abilities": [
            {
              "key": "a1",
              "description": "Esegue six consecutive spear strikes.",
              "descriptions": []
            },
            {
              "key": "a2",
              "description": "Consuma una certa quantità di Stamina per to lunge forward, Infliggere damage to opponents along the way.",
              "descriptions": []
            },
            {
              "key": "a3",
              "description": "Si lancia in picchiata da mezz'aria per colpire il terreno sottostante, danneggiando i nemici lungo il percorso e assestando AoE DMG all'impatto.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s2",
          "title": "Guide to Afterlife",
          "description": "Only an unwavering flame can cleanse the impurities of this world.\nHu Tao consumes a set portion of her HP to knock the surrounding enemies back and enter the Paramita Papilio state.",
          "abilities": [
            {
              "name": "Paramita Papilio",
              "descriptions": [
                "Increases Hu Tao's ATK based on her Max HP at the time of entering this state. ATK Bonus gained this way cannot exceed 400% of Hu Tao's Base ATK.",
                "Converts attack DMG to Pyro DMG, which cannot be overridden by any other elemental infusion.",
                "Charged Attacks apply the Blood Blossom effect to the enemies hit.",
                "Increases Hu Tao's resistance to interruption."
              ]
            },
            {
              "name": "Blood Blossom",
              "description": "Enemies afflitto by Blood Blossom will take Pyro DMG every 4s. This DMG is considered Elemental Skill DMG.\nEach enemy can be afflitto by only one Blood Blossom effect at a time, and its duration may only be refreshed by Hu Tao herself.\nParamita Papilio ends when its duration is over, or Hu Tao has left the battlefield or fallen.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s3",
          "title": "Spirit Soother",
          "description": "Commands a blazing spirit to attack, Infliggere Pyro DMG in a large AoE.\nUpon striking the enemy, Rigenera a percentage of Hu Tao's Max HP. This effect can be triggered up to 5 times, based on the number of enemies hit.\nIf Hu Tao's HP is below or equal to 50% when the enemy is hit, both the DMG and HP Regeneration are increased.",
          "abilities": []
        }
      ],
      "passives": [
        {
          "key": "p1",
          "title": "The More the Merrier",
          "description": "When Hu Tao cooks a dish perfectly, she has a 18% chance to receive an additional \"Suspicious\" dish of the same type.",
          "descriptions": []
        },
        {
          "key": "p2",
          "title": "Flutter By",
          "description": "When a Paramita Papilio state activated by Guide to Afterlife ends, all allies in the party (excluding Hu Tao herself) will have their CRIT Rate increased by 12% for 8s.",
          "descriptions": []
        },
        {
          "key": "p3",
          "title": "Sanguine Rouge",
          "description": "When Hu Tao's HP is equal to or less than 50%, her Pyro DMG Bonus is increased by 33%.",
          "descriptions": []
        }
      ],
      "constellations": [
        {
          "key": "c1",
          "title": "Crimson Bouquet",
          "description": "While in a Paramita Papilio state activated by Guide to Afterlife, Hu Tao's Charge Attacks do not consume Stamina.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c2",
          "title": "Ominous Rainfall",
          "description": "Increases the Blood Blossom DMG by an amount equal to 10% of Hu Tao's Max HP at the time the effect is applied.\nInoltre, Spirit Soother will also apply the Blood Blossom effect.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c3",
          "title": "Lingering Carmine",
          "description": "Aumenta di 3 il livello di Guide to Afterlife by 3. Il livello massimo di upgrade è 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c4",
          "title": "Garden of Eternal Rest",
          "description": "Upon defeating an enemy afflitto by a Blood Blossom that Hu Tao applied herself, all nearby allies in the party (excluding Hu Tao herself) will have their CRIT Rate increased by 12% for 15s.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c5",
          "title": "Floral Incense",
          "description": "Aumenta di 3 il livello di Spirit Soother by 3. Il livello massimo di upgrade è 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c6",
          "title": "Butterfly's Embrace",
          "description": "innesca when Hu Tao's HP drops below 25%, or when she suffers a lethal strike:",
          "secondDescription": null,
          "descriptions": [
            "Hu Tao will not fall as a result of the DMG sustained. Inoltre, for the next 10s, all of her Elemental and Physical RES is increased by 200%, her CRIT Rate is increased by 100%, and her resistance to interruption is greatly increased.",
            "This effect innesca automatically when Hu Tao has 1 HP left.",
            "Can only avvenire once every 60s."
          ]
        }
      ]
    },
    {
      "key": "Jean",
      "name": "Jean",
      "description": "La più devota,onesta e rigorosa Dandelion Knight, e l'attuale facente Funzione di Gran Maestro dell'Ordine dei Cavalieri di Favonius a Monstadt.",
      "skills": [
        {
          "key": "s1",
          "title": "Favonius Bladework",
          "description": null,
          "abilities": [
            {
              "key": "a1",
              "description": "Esegue 5 attacchi rapidi.",
              "descriptions": []
            },
            {
              "key": "a2",
              "description": "Consuma una certa quantità di Stamina per to launch an enemy using the power of wind. Launched enemies will slowly fall to the ground.",
              "descriptions": []
            },
            {
              "key": "a3",
              "description": "Si lancia in picchiata da mezz'aria per colpire il terreno sottostante, danneggiando i nemici lungo il percorso e assestando AoE DMG all'impatto.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s2",
          "title": "Gale Blade",
          "description": "Focusing the might of the formless wind around her blade, Jean Rilascia a miniature storm, launching enemies in the direction she aims at, Infliggere massive Anemo DMG.",
          "abilities": [
            {
              "key": "a1",
              "description": "At the cost of continued consumo di Stamina, Jean can command the whirlwind to pull surrounding enemies towards her front. Direction can be adjusted. Character is immobile during skill duration.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s3",
          "title": "Dandelion Breeze",
          "description": "Calling upon the wind’s protection, Jean creates a swirling Dandelion Field, launching surrounding enemies and causing Anemo DMG. At the same time, she instantly Rigenera a large amount of HP for nearby allied units and tutti i membri del party. HP restored scale off Jean’s ATK.",
          "abilities": [
            {
              "name": "Dandelion Field",
              "description": null,
              "descriptions": [
                "Continuously Rigenera HP of characters within the AoE and continuously imbues them with Anemo.",
                "infligges Anemo DMG to enemies entering or exiting the field."
              ]
            }
          ]
        }
      ],
      "passives": [
        {
          "key": "p1",
          "title": "Guiding Breeze",
          "description": "Quando si ottiene un Perfect Cooking su un piatto con a dish with effetti ristorativi, there is a 12% di possibilità di ottenere il doppio del prodotto.",
          "descriptions": []
        },
        {
          "key": "p2",
          "title": "Wind Companion",
          "description": "Hits by Normal Attacks have a 50% chance to regenerate HP equal to 15% of Jean’s ATK for tutti i membri del party.",
          "descriptions": []
        },
        {
          "key": "p3",
          "title": "Let the Wind Lead",
          "description": "Using Dandelion Breeze will regenerate 20% of its Energia.",
          "descriptions": []
        }
      ],
      "constellations": [
        {
          "key": "c1",
          "title": "Spiraling Tempest",
          "description": "Increases the pulling speed of Gale Blade after holding for more than 1s, and increases the DMG infligget by 40%.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c2",
          "title": "People’s Aegis",
          "description": "When Jean picks up an Elemental Orb/Particle, tutti i membri del party have their Movement SPD and ATK SPD increased by 15% for 15s.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c3",
          "title": "When the West Wind Arises",
          "description": "Aumenta di 3 il livello di Dandelion Breeze by 3. Il livello massimo di upgrade è 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c4",
          "title": "Lands of Dandelion",
          "description": "Within the Field created by Dandelion Breeze, all enemies have their Anemo RES decreased by 40%.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c5",
          "title": "Outbursting Gust",
          "description": "Aumenta di 3 il livello di Gale Blade by 3. Il livello massimo di upgrade è 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c6",
          "title": "Lion’s Fang, Fair Protector of Mondstadt",
          "description": "Incoming DMG is decreased by 35% within the Field created by Dandelion Breeze. Upon leaving the Dandelion Field, this effect lasts for 3 attacks or 10s.",
          "secondDescription": null,
          "descriptions": []
        }
      ]
    },
    {
      "key": "Kaeya",
      "name": "Kaeya",
      "description": "A thinker in the Knights of Favonius with a somewhat exotic appearance.",
      "skills": [
        {
          "key": "s1",
          "title": "Ceremonial Bladework",
          "description": null,
          "abilities": [
            {
              "key": "a1",
              "description": "Esegue 5 attacchi rapidi.",
              "descriptions": []
            },
            {
              "key": "a2",
              "description": "Consuma una certa quantità di Stamina perper scatenare  2 fendenti rapidi.",
              "descriptions": []
            },
            {
              "key": "a3",
              "description": "Plunges from mid-air to strike the ground below, damaging enemeies along the path and Infliggere AoE DMG upon impact.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s2",
          "title": "Frostgnaw",
          "description": "Unleashes a frigit blast, Infliggere Cryo DMG to enemies in front of Kaeya.",
          "abilities": []
        },
        {
          "key": "s3",
          "title": "Glacial Waltz",
          "description": "Coalescing the frost in the air, Kaeya Fa apparire 3 icicles that revolve around him. These icicles will follow the character around and infligge Cryo DMG to enemies in their path for so long as they persist.",
          "abilities": []
        }
      ],
      "passives": [
        {
          "key": "p1",
          "title": "Hidden Strength",
          "description": "Decreases all party member’s sprinting consumo di Stamina by 20%.",
          "descriptions": []
        },
        {
          "key": "p2",
          "title": "Cold-Blooded Strike",
          "description": "Every hit with Frostgnaw Rigenera HP for Kaeya equal to 15% of ATK.",
          "descriptions": []
        },
        {
          "key": "p3",
          "title": "Heart of the Abyss",
          "description": "Enemies Frozen by Frostgnaw will drop additional Elemental Particles. Frostgnaw may only produce a maximum of 2 additional Elemental Particles per use.",
          "descriptions": []
        }
      ],
      "constellations": [
        {
          "key": "c1",
          "title": "Excellent Blood",
          "description": "The CRIT Rate of Normal Attack and Charged Attack DMG against enemies afflitto by the Cold or Frozen status effects is increased by 15%.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c2",
          "title": "Never-Ending Performance",
          "description": "Every time Glacial Waltz defeats an enemy, its duration is increased by 2.5s, up to a maximum of 15s.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c3",
          "title": "Dance of Frost",
          "description": "Aumenta di 3 il livello di Frostgnaw by 3. Il livello massimo di upgrade è 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c4",
          "title": "Frozen Kiss",
          "description": "innesca automatically when Kaeya’s HP falls below 20%:",
          "secondDescription": null,
          "descriptions": [
            "Creates a shield that absorbs damage equal to 30% of Kaeya’s Max HP. Lasts for 20s.",
            "This shield absorbs Cryo DMG with 250% efficiency. Can only avvenire once every 60s."
          ]
        },
        {
          "key": "c5",
          "title": "Frostbiting Embrace",
          "description": "Aumenta di 3 il livello di Glacial Waltz by 3. Il livello massimo di upgrade è 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c6",
          "title": "Glacial Whirlwind",
          "description": "Glacial Waltz will generate 1 additional icicle, and will regenerate 15 Energia when cast.",
          "secondDescription": null,
          "descriptions": []
        }
      ]
    },
    {
      "key": "Keqing",
      "name": "Keqing",
      "description": "The Yuheng of the Liyue Qixing. Has much to say about Rex Lapis’ unilateral approach to policymaking in Liyue - but in truth, gods admire skeptics such as her quite a lot.",
      "skills": [
        {
          "key": "s1",
          "title": "Yunlai Swordsmanship",
          "description": null,
          "abilities": [
            {
              "key": "a1",
              "description": "Esegue 5 attacchi rapidi.",
              "descriptions": []
            },
            {
              "key": "a2",
              "description": "Consuma una certa quantità di Stamina perper scatenare  2 fendenti rapidi.",
              "descriptions": []
            },
            {
              "key": "a3",
              "description": "Plunges from mid-air to strike the ground below, damaging enemeies along the path and Infliggere AoE DMG upon impact.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s2",
          "title": "Stellar Restoration",
          "description": "Hurls a Lightning Stiletto that annihilates her enemies like the swift thunder. When the Stiletto hits its target, it infligges Electro DMG to enemies in un piccolo AoE, and places a Stiletto Mark on the spot hit.",
          "abilities": [
            {
              "key": "a1",
              "description": "Tieni premuto per adjust the direction in which the Stiletto shall be thrown. Stilettos thrown by the Hold attack mode can be suspended in mid-air, allowing Keqing to jump to them when using Stellar Restoration a second time.",
              "descriptions": []
            },
            {
              "name": "Lightning Stiletto",
              "description": "If Keqing uses Stellar Restoration again or uses a Charged Attack while its duration lasts, it will clear the Stiletto Mark and produce different effects:",
              "descriptions": [
                "If she uses Stellar Restoration again, she will blink to the location of the Mark and unleashed one slashing attack che infligges AoE Electro DMG. When blinking to a Stiletto that was thrown from a Holding attack, Keqing can leap across obstructing terrain.",
                "If Keqing uses a Charged Attack, she will ignite a series of thundering cuts at the Mark’s location, Infliggere AoE Electro DMG."
              ]
            }
          ]
        },
        {
          "key": "s3",
          "title": "Starward Sword",
          "description": "Keqing unleashes the power of lightning, Infliggere Electro DMG in an AoE. She then blends into the shadow of her blade, striking a series of thunderclap-blows to nearby enemies simultaneous che infligge multiple instance of Electro DMG. The final attack infligges massive AoE Electro DMG.",
          "abilities": []
        }
      ],
      "passives": [
        {
          "key": "p1",
          "title": "Land’s Overseer",
          "description": "Quando viene schierato in una spedizione  in Liyue, il tempo di esplorazione si riduce del 25%.",
          "descriptions": []
        },
        {
          "key": "p2",
          "title": "Thundering Penance",
          "description": "Within 5s of recasting Stellar Restoration while a Lightning Stiletto is present, Keqing’s Normal and Charged Attacks are converted to Electro DMG.",
          "descriptions": []
        },
        {
          "key": "p3",
          "title": "Aristocratic Dignity",
          "description": "When Attivare Starward Sword, Keqing’s CRIT Rate is increased by 15%, and her Energia Recharge is increased by 15%. This effect lasts for 8s.",
          "descriptions": []
        }
      ],
      "constellations": [
        {
          "key": "c1",
          "title": "Thundering Might",
          "description": "Recasting Stellar Restoration while a Lightning Stiletto is present causes Keqing to infligge 50% of her ATK as AoE Electro DMG at the start point and terminus of her Blink.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c2",
          "title": "Keen Extraction",
          "description": "When Keqing’s Normal and Charged Attack’s hit enemies afflitto by Electro, they have a 50% chance of producing an Elemental Particle. Questo effetto può avvenire solo una volta ogni 5s.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c3",
          "title": "Forseen Reformation",
          "description": "Aumenta di 3 il livello di Starward Sword by 3. Il livello massimo di upgrade è 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c4",
          "title": "Attunement",
          "description": "For 10s after Keqing innesca an Electro-related Elemental Reaction, her ATK is increased by 25%.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c5",
          "title": "Beckoning Stars",
          "description": "Aumenta di 3 il livello di Stellar Restoration by 3. Il livello massimo di upgrade è 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c6",
          "title": "Tenacious Star",
          "description": "When initiating a Normal Attack, Charged Attack, Elemental Skill or Elemental Burst, Keqing gains a 6% Electro DMG Bonus for 8s. Effects triggered by Normal Attacks, Charged Attacks, Elemental Skills and Elemental Bursts are considered independent entities.",
          "secondDescription": null,
          "descriptions": []
        }
      ]
    },
    {
      "key": "Klee",
      "name": "Klee",
      "description": "An explosives expert and a regular at the Knights of Favonius’ confinement room. Also known as Fleeing Sunlight.",
      "skills": [
        {
          "key": "s1",
          "title": "Kaboom!",
          "description": null,
          "abilities": [
            {
              "key": "a1",
              "description": "Throws things that go boom when they hit things! Esegue  3 explosive attacks, Infliggere AoE Pyro DMG.",
              "descriptions": []
            },
            {
              "key": "a2",
              "description": "Consuma una certa quantità di Stamina per and infligges Pyro DMG to enemies after a short Attivare time.",
              "descriptions": []
            },
            {
              "key": "a3",
              "description": "Concentrando il potere power of Pyro, Klee si lancia in picchiata da mezz'aria verso il terreno, danneggiando i nemici lungo il percorso e assestando AoE Pyro DMG all'impatto.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s2",
          "title": "Jumpy Dumpty",
          "description": "Jumpy Dumpty is tons of boom-bang-fun! When thrown, Jumpy Dumpty bounces thrice, igniting and Infliggere AoE Pyro DMG with every bounce. On the third bounce, the bomb splits into many mines. The mines will explode upon contact with enemies, or after a short period of time, Infliggere AoE Pyro DMG. Starts with 2 charges.",
          "abilities": []
        },
        {
          "key": "s3",
          "title": "Sparks ’n’ Splash",
          "description": "Klee’s Blazing Delight! For the duration of this ability, continuously Fa apparire Sparks ’n’ Splash to attack nearby enemies, Infliggere AoE Pyro DMG.",
          "abilities": []
        }
      ],
      "passives": [
        {
          "key": "p1",
          "title": "All Of My Treasures!",
          "description": "Displays the location of nearby resources unique to Mondstadt on the mini-map.",
          "descriptions": []
        },
        {
          "key": "p2",
          "title": "Pounding Surprise",
          "description": "When Jumpy Dumpty and Normal Attacks infligge DMG, Klee has a 50% chance to obtain an Explosive Spark. This Explosive Spark is consumed by the next Charged Attack, which costs no Stamina and infligges 50% increased DMG.",
          "descriptions": []
        },
        {
          "key": "p3",
          "title": "Sparkling Burst",
          "description": "When a Charged Attack results in a CRIT, tutti i membri del party gain 2 Elemental Energia.",
          "descriptions": []
        }
      ],
      "constellations": [
        {
          "key": "c1",
          "title": "Chained Reaction",
          "description": "Attacks and Skills have a certain chance to summon a spark that bombards enemies, Infliggere DMG equal to 120% of Sparks ’n’ Splash’s DMG.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c2",
          "title": "Explosive Frags",
          "description": "Being hit by Jumpy Dumpty’s mines decreases enemy DEF by 23% for 10s.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c3",
          "title": "Exquisite Compound",
          "description": "Aumenta di 3 il livello di Jumpy Dumpty by 3. Il livello massimo di upgrade è 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c4",
          "title": "Sparkly Explosion",
          "description": "If Klee leaves the field during the duration of Sparks ’n’ Splash, her departure innesca an explosion che infligges 555% of her ATK as AoE Pyro DMG.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c5",
          "title": "Nova Burst",
          "description": "Aumenta di 3 il livello di Sparks ’n’ Splash by 3. Il livello massimo di upgrade è 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c6",
          "title": "Blazing Delight",
          "description": "While under the effects of Sparks ’n’ Splash, other members of the party will continuously regenerate Energia. When Sparks ’n’ Splash is used, tutti i membri del party will gain 10% Pyro DMG Bonus for 25s.",
          "secondDescription": null,
          "descriptions": []
        }
      ]
    },
    {
      "key": "Lisa",
      "name": "Lisa",
      "description": "The languid but knowledgeable Librarian of the Knights of Favonius who was deemed by Sumeru Academia to be their most distinguised graduate in the past two centuries.",
      "skills": [
        {
          "key": "s1",
          "title": "Lightning Touch",
          "description": null,
          "abilities": [
            {
              "key": "a1",
              "description": "Esegue  4 lightning attacks che infligge Electro DMG.",
              "descriptions": []
            },
            {
              "key": "a2",
              "description": "Consuma una certa quantità di Stamina per to infligge AoE Electro DMG after a short Attivare time.",
              "descriptions": []
            },
            {
              "key": "a3",
              "description": "Concentrando il potere might of Electro, Lisa si lancia in picchiata da mezz'aria verso il terreno, danneggiando i nemici lungo il percorso e assestando AoE Electro DMG all'impatto.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s2",
          "title": "Violet Arc",
          "description": "Channels the power of lightning to sweep bothersome matters away.",
          "abilities": [
            {
              "key": "a1",
              "description": "Rilascia a homing Lightning Orb. On hit, it infligges Electro DMG, and Applica a stack of Conductive status (Max 3 stacks) to enemies in un piccolo AoE.",
              "descriptions": []
            },
            {
              "key": "a2",
              "description": "After an extended Attivare time, calls down lightning from the heavens, Infliggere massive Electro DMG to all nearby enemies. infligges great amounts of extra damage to enemies based on the number of Conductive stacks applied to them, and clears their Conductive status.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s3",
          "title": "Lightning Rose",
          "description": "Fa apparire a Lightning Rose that unleashes powerful lightning bolts, launching surrounding enemies and Infliggere Electro DMG. The Lightning Rose will continuously emit lightning to knock back enemies and infligge Electro DMG for so long as it persists.",
          "abilities": []
        }
      ],
      "passives": [
        {
          "key": "p1",
          "title": "General Pharmaceutics",
          "description": "When Lisa crafts a potion, she has a 20% chance to refund a portion of the crafting materials used.",
          "descriptions": []
        },
        {
          "key": "p2",
          "title": "Induced Aftershock",
          "description": "Hits by charged Attacks apply Violet Arc’s Conductive status to enemies.",
          "descriptions": []
        },
        {
          "key": "p3",
          "title": "Static Electricity Field",
          "description": "Enemies hit by Lightning Rose have their DEF decreased by 15% for 10s.",
          "descriptions": []
        }
      ],
      "constellations": [
        {
          "key": "c1",
          "title": "Infinite Circuit",
          "description": "Lisa recovers 2 Energia for every opponent hit while holding Violet Arc. A maximum of 10 Energia can be regenerated in this manner at any one time.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c2",
          "title": "Electromagnetic Field",
          "description": "Holding Violet Arc has the following effects:",
          "secondDescription": null,
          "descriptions": [
            "Increases DEF by 25%.",
            "Increases Lisa’s resistance to interruption."
          ]
        },
        {
          "key": "c3",
          "title": "Resonant Thunder",
          "description": "Aumenta di 3 il livello di Lightning Rose by 3. Il livello massimo di upgrade è 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c4",
          "title": "Plasma Eruption",
          "description": "Increases the number of lightning bolts released by Lightning Rose by 1-3.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c5",
          "title": "Electrocute",
          "description": "Aumenta di 3 il livello di Violet Arc by 3. Il livello massimo di upgrade è 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c6",
          "title": "Pulsating Witch",
          "description": "When Lisa takes the field, she Applica 3 stacks of Violet Arc’s Conductive status onto nearby enemies. Questo effetto può avvenire solo una volta ogni 5s.",
          "secondDescription": null,
          "descriptions": []
        }
      ]
    },
    {
      "key": "Mona",
      "name": "Mona",
      "description": "A mysterious young astrologer who proclaims herself to be \"Astrologist Mona Megistus,\" and who possesses abilities to match the title.",
      "skills": [
        {
          "key": "s1",
          "title": "Ripple of Fate",
          "description": null,
          "abilities": [
            {
              "key": "a1",
              "description": "Esegue 4 water splash attacks che infligge Hydro DMG.",
              "descriptions": []
            },
            {
              "key": "a2",
              "description": "Consuma una certa quantità di Stamina per and infligges AoE Hydro DMG after a short Attivare time.",
              "descriptions": []
            },
            {
              "key": "a3",
              "description": "Concentrando il potere might of Hydro, Mona si lancia in picchiata da mezz'aria verso il terreno, danneggiando i nemici lungo il percorso e assestando AoE Hydro DMG all'impatto.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s2",
          "title": "Mirror Reflection of Doom",
          "description": "Creates an illusory Phantom of fate from coalesced waterspouts.",
          "abilities": [
            {
              "name": "",
              "description": "The Phantom has the following special properties:",
              "descriptions": [
                "Continuously taunts nearby enemies, attracting their fire.",
                "Continuously infligges Hydro DMG to nearby enemies.",
                "When its duration expires, the Phantom explodes, Infliggere AoE Hydro DMG."
              ]
            },
            {
              "key": "a2",
              "description": "Utilizes water currents to move backwards swiftly before conjuring a Phantom. Only one Phantom created by Mirror Reflection of Doom can exist at any time.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s3",
          "title": "Stellaris Phantasm",
          "description": "Mona Fa apparire the sparkling waves and creates a reflection of the starry sky, applying the Illusory Bubble status to opponents in a large AoE.",
          "abilities": [
            {
              "name": "Illusory Bubble",
              "description": "Traps opponents inside a pocket of destiny and also makes them Wet. Renders weaker opponents immobile. When an opponent afflitto by Illusory Bubble sustains DMG, the following effects are produced:",
              "descriptions": [
                "Applica an Omen to the opponent, which gives a DMG Bonus, also increasing the DMG of the attack that causes it.",
                "Removes the Illusory Bubble, Infliggere Hydro Elemental DMG in the process. The DMG Bonus does not apply to the Hydro Elemental DMG infligget in this instance."
              ]
            },
            {
              "name": "Omen",
              "description": "During its duration, increases DMG taken by enemies.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s4",
          "title": "Illusory Torrent",
          "description": null,
          "abilities": [
            {
              "name": "Alternate Spirit",
              "description": "Mona cloaks herself within the water’s flow, consuming Stamina to move rapidly. When under the effect of Illusory Torrent, Mona can move at high speed on water. Applica the Wet status to nearby enemies when she reappears.",
              "descriptions": []
            }
          ]
        }
      ],
      "passives": [
        {
          "key": "p1",
          "title": "Principium of Astrology",
          "description": "When Mona crafts Weapon Ascension Materials, she has a 25% chance to refund a portion of the crafting materials used.",
          "descriptions": []
        },
        {
          "key": "p2",
          "title": "Come ’n’ Get Me, Hag!",
          "description": "After she has used Illusory Torrent for 2s, if there are any enemies nearby, Mona will automatically create a Phantom. A Phantom created in this manner lasts for 2s, and its explosion DMG is equal to 50% of Mirror Reflection of Doom.",
          "descriptions": []
        },
        {
          "key": "p3",
          "title": "Waterborne Destiny",
          "description": "Increases Mona’s Hydro DMG Bonus by a degree equivalent to 20% of her Energy Recharge rate.",
          "descriptions": []
        }
      ],
      "constellations": [
        {
          "key": "c1",
          "title": "Prophecy of Submersion",
          "description": "The effects of Hydro-related Elemental Reactions are enhanced for 8s after a character hits an enemy afflitto by an Omen:",
          "secondDescription": null,
          "descriptions": [
            "Electro-Charged DMG is increased by 15%.",
            "Vaporize DMG is increased by 15%.",
            "Hydro Swirl DMG is increased by 15%.",
            "The duration for which enemies are Frozen is increased by 15%."
          ]
        },
        {
          "key": "c2",
          "title": "Lunar Chain",
          "description": "When a Normal Attack hits, there is a 20% chance that it will be automatically followed by a Charged Attack. Questo effetto può avvenire solo una volta ogni 5s.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c3",
          "title": "Restless Revolution",
          "description": "Aumenta di 3 il livello di Stellaris Phantasm by 3. Il livello massimo di upgrade è 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c4",
          "title": "Prophecy of Oblivion",
          "description": "When a character attacks an enemy afflitto by the Omen status effect, their CRIT Rate is increased by 15%.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c5",
          "title": "Mockery of Fortuna",
          "description": "Aumenta di 3 il livello di Mirror Reflection of Doom by 3. Il livello massimo di upgrade è 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c6",
          "title": "Rhetorics of Calamitas",
          "description": "Upon entering Illusory Torrent, Mona gain a 60% increase to the DMG her next Charged Attack per second of movement. A maximum DMG Bonus of 180% can be achieved in this manner. The effect lasts for no more than 8s.",
          "secondDescription": null,
          "descriptions": []
        }
      ]
    },
    {
      "key": "Ningguang",
      "name": "Ningguang",
      "description": "The Tianquan of Liyue Qixing. Her wealth is unsurpassed in all of Teyvat.",
      "skills": [
        {
          "key": "s1",
          "title": "Sparkling Scatter",
          "description": null,
          "abilities": [
            {
              "key": "a1",
              "description": "Shoots gems che infligge Geo DMG. Upon hit, this conferisce Ningguang 1 Star Jade.",
              "descriptions": []
            },
            {
              "key": "a2",
              "description": "Consuma una certa quantità di Stamina per to fire off a giant gem che infligges Geo DMG. If Ningguang has any Star Jades, unleashing a Charged Attack will cause the Star Jades to be fired at the enemy as well, Infliggere additional DMG.",
              "descriptions": []
            },
            {
              "key": "a3",
              "description": "Concentrando il potere might of Geo, Ningguang si lancia in picchiata da mezz'aria verso il terreno, danneggiando i nemici lungo il percorso e assestando AoE Geo DMG all'impatto.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s2",
          "title": "Jade Screen",
          "description": "Ningguang creates a Jade Screen out of gold, obsidian and her great opulence, Infliggere AoE Geo DMG.",
          "abilities": [
            {
              "name": "Jade Screen",
              "description": "Jade Screen is considered a Geo Construct and can be used to block certain attacks, but cannot be climbed. Only one Jade Screen may exist at any one time.",
              "descriptions": [
                "Blocks enemy projectiles.",
                "Endurance scales based on Ningguang’s Max HP."
              ]
            }
          ]
        },
        {
          "key": "s3",
          "title": "Starshatter",
          "description": "Gathering a great number of gems, Ningguang scatters them all at once, sending homing projectiles at her enemies che infligge massive Geo DMG. If Starshatter is cast when a Jade Screen is nearby, the Jade Screen will fire additional gem projectiles at the same time.",
          "abilities": []
        }
      ],
      "passives": [
        {
          "key": "p1",
          "title": "Trove of Marvelous Treasure",
          "description": "Displays the location of nearby ore veins (Iron Ore, White Iron Ore, Crystal Ore, and Magical Crystal Ore) on the mini-map.",
          "descriptions": []
        },
        {
          "key": "p2",
          "title": "Backup Plan",
          "description": "When Ningguang is in possession of Star Jades, her Charged Attack does not consume Stamina.",
          "descriptions": []
        },
        {
          "key": "p3",
          "title": "Strategic Reserve",
          "description": "A character that passes through the Jade Screen will gain a 12% Geo DMG Bonus for 10s.",
          "descriptions": []
        }
      ],
      "constellations": [
        {
          "key": "c1",
          "title": "Piercing Fragments",
          "description": "When a Normal Attack hits, it infligges AoE DMG.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c2",
          "title": "Shock Effect",
          "description": "When Jade Screen is shattered, its CD will reset. Can avvenire once every 6s.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c3",
          "title": "Majesty be the Array of Stars",
          "description": "Aumenta di 3 il livello di Starshatter by 3. Il livello massimo di upgrade è 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c4",
          "title": "Exquisite be the Jade, Outshining All the Beneath",
          "description": "Jade Screen increases nearby characters’ Elemental RES by 10%.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c5",
          "title": "Invincible be the Jade Screen",
          "description": "Aumenta di 3 il livello di Jade Screen by 3. Il livello massimo di upgrade è 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c6",
          "title": "Grandeur be the Seven Stars",
          "description": "When Starshatter is used, Ningguang gains 7 Star Jades.",
          "secondDescription": null,
          "descriptions": []
        }
      ]
    },
    {
      "key": "Noelle",
      "name": "Noelle",
      "description": "A maid in the service of the Knights of Favonius that dreams of joining their ranks someday.",
      "skills": [
        {
          "key": "s1",
          "title": "Favonius Bladework - Maid",
          "description": null,
          "abilities": [
            {
              "key": "a1",
              "description": "Esegue 4 attacchi rapidi.",
              "descriptions": []
            },
            {
              "key": "a2",
              "description": "Consuma Stamina nel tempo per eseguire un continuo attacco vorticoso contro tutti i nemici vicini. Alla fine della sequenza, infligge un colpo molto più potente.",
              "descriptions": []
            },
            {
              "key": "a3",
              "description": "Si lancia in picchiata da mezz'aria per colpire il terreno sottostante, danneggiando i nemici lungo il percorso e assestando AoE DMG all'impatto.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s2",
          "title": "Breastplate",
          "description": "Fa apparire a protective stone armor, Infliggere Geo DMG to surrounding enemies and creating a shield. The shield’s DMG Absorption scaled based on Noelle’s DEF.",
          "abilities": [
            {
              "name": "",
              "description": "The shield has the following properties:",
              "descriptions": [
                "When Noelle’s Normal and Charged Attacks hit a target, they have a certain chance to regenerate HP for all characters, both on and off the field. The amount of HP healed when regeneration is triggered scales based on Noelle’s DEF.",
                "Applica the Geo element to the character.",
                "Ha il 150% di Absorption Efficiency di Geo DMG."
              ]
            }
          ]
        },
        {
          "key": "s3",
          "title": "Sweeping Time",
          "description": "Concentrando il potere strength of stone around her weapon, Noelle strikes the enemies surrounding her within a large AoE, Infliggere Geo DMG.",
          "abilities": [
            {
              "name": "",
              "description": "Afterwards, Noelle gains the following effects:",
              "descriptions": [
                "Larger attack AoE.",
                "Converts attack DMG to Geo DMG.",
                "Increased ATK that scales based on her DEF."
              ]
            }
          ]
        }
      ],
      "passives": [
        {
          "key": "p1",
          "title": "Maid’s Knighthood",
          "description": "Quando si ottiene un Perfect Cooking su un piatto con a DEF-boosting dish, Noelle has a 12% di possibilità di ottenere il doppio del prodotto.",
          "descriptions": []
        },
        {
          "key": "p2",
          "title": "Devotion",
          "description": "When Noelle is in the party but not on the field, this ability innesca automatically when the active character’s HP falls below 30%: Creates a shield that lasts for 20s and absorbs DMG equal to 400% of Noelle’s DEF. Questo effetto può avvenire solo una volta ogni 60s.",
          "descriptions": []
        },
        {
          "key": "p3",
          "title": "Nice and Clean",
          "description": "Every 4 Normal or Charged Attack hits will decrease the CD of Breastplate by 1s. Hitting multiple enemies with a single attack is only counted as 1 hit.",
          "descriptions": []
        }
      ],
      "constellations": [
        {
          "key": "c1",
          "title": "I Got Your Back",
          "description": "While Sweeping Time and Breastplate are both in effect, the chance of Breastplate’s healing effects activating is increased to 100%.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c2",
          "title": "Combat Maid",
          "description": "Decreases Il Consumo di Stamina of Noelle’s Charged Attacks by 20% and increases her Charged Attack DMG by 15%.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c3",
          "title": "Invulnerable Maid",
          "description": "Aumenta di 3 il livello di Breastplate by 3. Il livello massimo di upgrade è 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c4",
          "title": "To Be Cleaned",
          "description": "When Breastplate’s duration expires or it is destroyed by DMG, it will infligge 400% ATK of Geo DMG to surrounding enemies.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c5",
          "title": "Favonius Sweeper Master",
          "description": "Aumenta di 3 il livello di Sweeping Time by 3. Il livello massimo di upgrade è 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c6",
          "title": "Must Be Spotless",
          "description": "Sweeping Time increases Noelle’s ATK by an additional 50% of her DEF. Inoltre, every enemy defeated during the skill’s duration adds 1s to the duration, up to 10s.",
          "secondDescription": null,
          "descriptions": []
        }
      ]
    },
    {
      "key": "Qiqi",
      "name": "Qiqi",
      "description": "An apprentice and herb-picker Bubu Pharmacy. An undead with a bone-white complexion, she seldom has much in the way of words or emotion.",
      "skills": [
        {
          "key": "s1",
          "title": "Ancient Sword Art",
          "description": null,
          "abilities": [
            {
              "key": "a1",
              "description": "Esegue 5 attacchi rapidi.",
              "descriptions": []
            },
            {
              "key": "a2",
              "description": "Consuma una certa quantità di Stamina perper scatenare  2 fendenti rapidi.",
              "descriptions": []
            },
            {
              "key": "a3",
              "description": "Si lancia in picchiata da mezz'aria per colpire il terreno sottostante, danneggiando i nemici lungo il percorso e assestando AoE DMG all'impatto.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s2",
          "title": "Adeptus Art: Herald of Frost",
          "description": "Using the Icevein Talisman, Qiqi brings forth the Herald of Frost, Infliggere Cryo DMG to nearby enemies.",
          "abilities": [
            {
              "name": "Herald of Frost",
              "description": "",
              "descriptions": [
                "When Qiqi hits a target with her Normal or Charged Attacks, she Rigenera HP for tutti i membri del party and all personaggi alleati vicini. Healing scales based on Qiqi’s ATK.",
                "Rigenera HP for current character at regular intervals.",
                "Follows the character around, Infliggere Cryo DMG to enemies in its path."
              ]
            }
          ]
        },
        {
          "key": "s3",
          "title": "Adeptus Art: Preserver of Fortune",
          "description": "Qiqi Rilascia the adeptus power sealed within her body, marking nearby enemies with a Fortune-Preserving Talisman che infligges Cryo DMG.",
          "abilities": [
            {
              "name": "Fortune-Preserving Talisman",
              "description": "When enemies afflitto by this Talisman take DMG, the character che infligget this DMG Rigenera HP.",
              "descriptions": []
            }
          ]
        }
      ],
      "passives": [
        {
          "key": "p1",
          "title": "Former Life Memories",
          "description": "Displays the location of nearby resources unique to Liyue on the mini-map.",
          "descriptions": []
        },
        {
          "key": "p2",
          "title": "Life-Prolonging Methods",
          "description": "When a character under the effects of Adeptus Art: Herald of Frost innesca an Elemental Reaction, their Incoming Healing Bonus is increased by 20% for 8s.",
          "descriptions": []
        },
        {
          "key": "p3",
          "title": "A Glimpse into Arcanum",
          "description": "When Qiqi hits enemies with her Normal and Charged Attacks, she has a 50% chance to apply a Fortune-Preserving Talisman to them for 6s. Questo effetto può avvenire solo una volta ogni 30s.",
          "descriptions": []
        }
      ],
      "constellations": [
        {
          "key": "c1",
          "title": "Ascetics of Frost",
          "description": "When the Herald of Frost hits an enemy marked by a Fortune-Preserving Talisman, Qiqi Rigenera 2 Energia.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c2",
          "title": "Frozen to the Bone",
          "description": "Qiqi’s Normal and Charge Attack DMG against enemies afflitto by Cryo is increased by 15%.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c3",
          "title": "Ascendant Praise",
          "description": "Aumenta di 3 il livello di Adeptus Art: Preserver of Fortune by 3. Il livello massimo di upgrade è 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c4",
          "title": "Divine Suppression",
          "description": "Targets marked by the Fortune-Preserving Talisman have their ATK decreased by 20%.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c5",
          "title": "Crimson Lotus Bloom",
          "description": "Aumenta di 3 il livello di Adeptus Art: Herald of Frost by 3. Il livello massimo di upgrade è 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c6",
          "title": "Rite of Resurrection",
          "description": "Using Adeptus Art: Preserve of Fortune rianima all nearby fallen characters and Rigenera 50% of their HP. Questo effetto può avvenire solo una volta ogni 15 mins.",
          "secondDescription": null,
          "descriptions": []
        }
      ]
    },
    {
      "key": "Razor",
      "name": "Razor",
      "description": "A boy who lives among the wolves in Wolvendom of Mondstadt, away from human civilization. As agile as lightning.",
      "skills": [
        {
          "key": "s1",
          "title": "Steel Fang",
          "description": null,
          "abilities": [
            {
              "key": "a1",
              "description": "Esegue 4 attacchi rapidi.",
              "descriptions": []
            },
            {
              "key": "a2",
              "description": "Consuma Stamina nel tempo per eseguire un continuo attacco vorticoso contro tutti i nemici vicini. Alla fine della sequenza, infligge un colpo molto più potente.",
              "descriptions": []
            },
            {
              "key": "a3",
              "description": "Si lancia in picchiata da mezz'aria per colpire il terreno sottostante, danneggiando i nemici lungo il percorso e assestando AoE DMG all'impatto.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s2",
          "title": "Claw and Thunder",
          "description": "Hunts his prey using the techniques taught to him by his master and his Lupical.",
          "abilities": [
            {
              "key": "a1",
              "description": "Swings the Thunder Wolf Claw, Infliggere Electro DMG to enemies in front of Razor. Upon striking an enemy, Razor will gain an Electro Sigil, which increases his Energy Recharge rate. Razor can have up to 3 Electro Sigils simultaneously, and gaining a new Electro Sigil refreshes their duration.",
              "descriptions": []
            },
            {
              "key": "a2",
              "description": "Gathers Electro Energia to unleash a lightning storm over a small AoE, causing massive Electro DMG, and clears all of Razor’s Electro Sigils. Each Electro Sigil cleared in this manner will be converted into Energia for Razor.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s3",
          "title": "Lightning Fang",
          "description": "Fa apparire the Wolf Within which infligges Electro DMG to all nearby opponents. This clears all of Razor’s Electro Sigils, which will be converted into elemental Energia for him. The Wolf Within will fight alongside Razor for the skill’s duration.",
          "abilities": [
            {
              "name": "The Wolf Within",
              "description": "These effects end when Razor leaves the battlefield. When Razor leaves the field, a maximum of 10 Energia will be returned to him based off the duration remaining on this skill.",
              "descriptions": [
                "Strikes alongside Razor’s normal attacks, Infliggere Electro DMG.",
                "Raises Razor’s ATK SPD and Electro RES.",
                "Causes Razor to be immune to DMG inflicted by the Electro-Charged status.",
                "Disables Razor’s Charged Attacks.",
                "Increases Razor's resistance to interruption."
              ]
            }
          ]
        }
      ],
      "passives": [
        {
          "key": "p1",
          "title": "Wolvensprint",
          "description": "Decreases all party member’s sprinting consumo di Stamina by 20%.",
          "descriptions": []
        },
        {
          "key": "p2",
          "title": "Awakening",
          "description": "Decreases Claw and Thunder’s CD by 18%. Using Lightning Fang resets the CD of Claw and Thunder.",
          "descriptions": []
        },
        {
          "key": "p3",
          "title": "Hunger",
          "description": "When Razor’s Energia is below 50%, increases Energia Recharge by 30%.",
          "descriptions": []
        }
      ],
      "constellations": [
        {
          "key": "c1",
          "title": "Wolf’s Instinct",
          "description": "Picking up an Elemental Orb or Particle increases Razor’s DMG by 10% for 8s.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c2",
          "title": "Suppression",
          "description": "Increases CRIT Rate against enemies with less than 30% HP by 10%.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c3",
          "title": "Soul Companion",
          "description": "Aumenta di 3 il livello di Lightning Fang by 3. Il livello massimo di upgrade è 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c4",
          "title": "Bite",
          "description": "When Attivare Claw and Thunder (Press), enemies hit will have their DEF decreased by 15% for 7s.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c5",
          "title": "Sharpened Claws",
          "description": "Aumenta di 3 il livello di Claw and Thunder by 3. Il livello massimo di upgrade è 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c6",
          "title": "Lupus Fulguris",
          "description": "Every 10s, Razor’s sword charges up, causing the next Normal Attack to release lightning che infligges 100% of Razor’s ATK as Electro DMG. When Razor is not using Lightning Fang, a lightning strike on an enemy will garantisce Razor an Electro Sigil for Claw and Thunder.",
          "secondDescription": null,
          "descriptions": []
        }
      ]
    },
    {
      "key": "Rosaria",
      "name": "Rosaria",
      "description": "A nun who, outside of her garb, seems nothing at all like a person of the cloth. Known for her sharp, cold words and manner, she often works alone.",
      "skills": [
        {
          "key": "s1",
          "title": "Spear of Worship",
          "abilities": [
            {
              "key": "a1",
              "description": "Esegue five consecutive spear strikes.",
              "descriptions": []
            },
            {
              "key": "a2",
              "description": "Consuma una certa quantità di Stamina per to lunge forward, Infliggere damage to opponents along the way.",
              "descriptions": []
            },
            {
              "key": "a3",
              "description": "Si lancia in picchiata da mezz'aria per colpire il terreno sottostante, danneggiando i nemici lungo il percorso e assestando AoE DMG all'impatto.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s2",
          "title": "Ravaging Confession",
          "description": "Rosaria swiftly shifts her position to appear behind her opponent, then stabs and slashes them with her polearm, Infliggere Cyro DMG.\nThis ability cannot be used to travel behind opponents of a larger build.",
          "abilities": []
        },
        {
          "key": "s3",
          "title": "Rites of Termination",
          "description": "Rosaria's unique take on this prayer ritual: First, she swings her weapon to slash surrounding opponents; then, she Fa apparire a frigid Ice Lance that colpisce il terreno. Both actions infligge Cryo DMG.\nWhile active, the Ice Lance periodically Rilascia a blast of cold air, Infliggere Cryo DMG to surrounding opponents.",
          "abilities": []
        }
      ],
      "passives": [
        {
          "key": "p1",
          "title": "Night Walk",
          "description": "At night (18:00–6:00), increases the Movement SPD of your own party members by 10%.\nDoes not take effect in Domains, Trounce Domains, or Spiral Abyss. Not stackable with Passive Talents that provide the exact same effects.",
          "descriptions": []
        },
        {
          "key": "p2",
          "title": "Extracted Confession",
          "description": "When Rosaria strikes an opponent from behind using Ravaging Confession, Rosaria's CRIT Rate increases by 12% for 5s.",
          "descriptions": []
        },
        {
          "key": "p3",
          "title": "Shadow Samaritan",
          "description": "Attivare Rites of Termination increases CRIT Rate of all nearby party members (except Rosaria herself) by 15% of Rosaria's CRIT Rate for 10s.\nCRIT Rate Bonus gained this way cannot exceed 15%.",
          "descriptions": []
        }
      ],
      "constellations": [
        {
          "key": "c1",
          "title": "Unholy Revelation",
          "description": "When Rosaria infligges a CRIT Hit, her ATK SPD increases by 10% and her Normal Attack DMG increases by 10% for 4s.",
          "descriptions": []
        },
        {
          "key": "c2",
          "title": "Land Without Promise",
          "description": "The duration of the Ice Lance created by Rites of Termination is increased by 4s.",
          "descriptions": []
        },
        {
          "key": "c3",
          "title": "Sacrament of Penance",
          "description": "Aumenta di 3 il livello di Ravaging Confessionby 3. Il livello massimo di upgrade è 15.",
          "descriptions": []
        },
        {
          "key": "c4",
          "title": "Amazing Disgrace",
          "description": "Ravaging Confession's Crit Hits regenerate 5 Energia for Rosaria. Can only be triggered once each time Ravaging Confession is cast.",
          "descriptions": []
        },
        {
          "key": "c5",
          "title": "Extreme Unction",
          "description": "Aumenta di 3 il livello di Rites of Termination by 3. Il livello massimo di upgrade è 15.",
          "descriptions": []
        },
        {
          "key": "c6",
          "title": "Divine Retribution",
          "description": "Rites of Termination' attack decreases opponents' Physical RES by 20% for 10s.",
          "descriptions": []
        }
      ]
    },
    {
      "key": "Sucrose",
      "name": "Sucrose",
      "description": "An alchemist filled with curiosity about all things. She researches bio-alchemy.",
      "skills": [
        {
          "key": "s1",
          "title": "Wind Spirit Creation",
          "description": null,
          "abilities": [
            {
              "key": "a1",
              "description": "Esegue 4 attacks using Wind Spirits, Infliggere Anemo DMG.",
              "descriptions": []
            },
            {
              "key": "a2",
              "description": "Consuma una certa quantità di Stamina per and infligges AoE Anemo DMG after a short Attivare time.",
              "descriptions": []
            },
            {
              "key": "a3",
              "description": "Calling upon the power of her Wind Spirits, Sucrose si lancia in picchiata da mezz'aria verso il terreno, danneggiando i nemici lungo il percorso e assestando AoE Anemo DMG all'impatto.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s2",
          "title": "Astable Anemohypostasis Creation - 6308",
          "description": "Creates a small Wind Spirit che infligges Anemo DMG to enemies in an AoE, pulling them towards the location of the Wind Spirit before launching them.",
          "abilities": []
        },
        {
          "key": "s3",
          "title": "Forbidden Creation - Isomer 75 / Type II",
          "description": "Sucrose hurls an unstable concoction that creates a Large Wind Spirit. While it persists, the Large Wind Spirit will continuously pull and launch nearby enemies, Infliggere AoE Anemo DMG.",
          "abilities": [
            {
              "key": "a1",
              "description": "If the Wind Spirit comes into contact with Hydro / Pyro / Cryo / Electro elements, it will infligge additional DMG of that type. Elemental Absorption may only avvenire once per use.",
              "descriptions": []
            }
          ]
        }
      ],
      "passives": [
        {
          "key": "p1",
          "title": "Astable Invention",
          "description": "When Sucrose crafts Character and Weapon Enhancement Materials, she has a 10% to obtain double the product.",
          "descriptions": []
        },
        {
          "key": "p2",
          "title": "Catalyst Conversion",
          "description": "When Sucrose innesca a Swirl effect, characters in the party with the matching element have their Elemental Mastery increased by 50 for 8s.",
          "descriptions": []
        },
        {
          "key": "p3",
          "title": "Mollis Favonius",
          "description": "When Astable Anemohypostatis Creation - 6308 or Forbidden Creation - Isomer 75 / Type II hit an enemy, increases other party member’s Elemental Mastery based on 20% of Sucrose’s Elemental Mastery for 8s.",
          "descriptions": []
        }
      ],
      "constellations": [
        {
          "key": "c1",
          "title": "Clustered Vacuum Field",
          "description": "Astable Anemohypostasis Creation - 6308 gains 1 carica in più.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c2",
          "title": "Beth - Unbound Form",
          "description": "The duration of Forbidden Creation - Isomer 75 / Type II is increased by 2s.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c3",
          "title": "Flawless Alchemistress",
          "description": "Aumenta di 3 il livello di Astable Anemohypostasis Creation - 6308 by 3. Il livello massimo di upgrade è 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c4",
          "title": "Alchemania",
          "description": "Every 7 Normal and Charged Attacks, Sucrose will reduce the CD of Astable Anemohypostasis Creation - 6308 by 1-7s.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c5",
          "title": "Caution: Standard Flask",
          "description": "Aumenta di 3 il livello di Forbidden Creation - Isomer 75 / Type II by 3. Il livello massimo di upgrade è 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c6",
          "title": "Chaotic Entropy",
          "description": "If Forbidden Creation - Isomer 75 / Type II innesca an Elemental Absorption, tutti i membri del party gain a 20% Elemental DMG Bonus for the corresponding absorbed element during its duration.",
          "secondDescription": null,
          "descriptions": []
        }
      ]
    },
    {
      "key": "Tartaglia",
      "name": "Tartaglia",
      "description": "No. 11 of The Harbingers, also known as \"Childe\". His name is highly feared on the battlefield.",
      "skills": [
        {
          "key": "s1",
          "title": "Cutting Torrent",
          "description": null,
          "abilities": [
            {
              "key": "a1",
              "description": "Esegue 6 consecutive shots with a bow.",
              "descriptions": []
            },
            {
              "key": "a2",
              "description": "Esegue un colpo mirato più preciso con DMG aumentato. Mentre si mira, the power of Hydro will accumulate on the arrowhead. An arrow fully charged with the torrent will infligge Hydro DMG and apply Riptide status..",
              "descriptions": []
            },
            {
              "name": "Riptide",
              "description": "Opponents afflitto by Riptide will suffer from AoE Hydro DMG effects when attacked by Tartaglia in various ways. DMG infligget in this way is considered Normal Attack DMG.",
              "descriptions": [
                "Riptide Flash: A fully-charged Colpo Mirato that hits an opponent afflitto by Riptide infligges consecutive bouts of AoE DMG. Can avvenire once every 0.7s.",
                "Riptide Burst: Defeating an opponent afflitto by Riptide created a Hydro burst that inflicts the Riptide status on nearby opponents hit."
              ]
            },
            {
              "key": "a4",
              "description": "Scatena una pioggia di frecce a mezz'aria che infliggono AoE DMG all'impatto con il terreno. When Tartaglia is in Foul Legacy: Raging Tide’s Melee Stance, he cannot perform a Attacco in Picchiata.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s2",
          "title": "Foul Legacy: Raging Tide",
          "description": "Unleashes a set of weaponry made of pure water, Infliggere Hydro DMG to surrounding opponents and entering a Melee Stance. In this Stance, Tartaglia’s Normal and Charged Attacks change as follows:",
          "abilities": [
            {
              "key": "a1",
              "description": "Esegue 6 consecutive Hydro strikes.",
              "descriptions": []
            },
            {
              "key": "a2",
              "description": "Consuma una certa quantità di Stamina perper scatenare  a cross slash, Infliggere Hydro DMG.",
              "descriptions": []
            },
            {
              "name": "Riptide Slash",
              "description": "Hitting an opponent afflitto by Riptide with a melee attack unleashes a Riptide Slash che infligges AoE Hydro DMG. DMG infligget in this way is considered Elemental Skill DMG, and can only avvenire once every 1.5s. After 30s, or when the ability is unleashed again, this skill will end. Tartaglia will return to his Ranged Stance and this ability will enter CD. The longer Tartaglia stays in his Melee Stance, the longer the CD. If the return to a ranged stance occurs automatically after 30s, the CD is even longer.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s3",
          "title": "Havor: Obliteration",
          "description": "Performs different attacks based on what stance Tartaglia is in when Attivare.",
          "abilities": [
            {
              "name": "Ranged Stance: Flash of Havoc",
              "description": "Swiftly fires a Hydro-imbued magic arrow, Infliggere AoE Hydro DMG and applying the Riptide status. Returns a portion of its Energia Cost after use.",
              "descriptions": []
            },
            {
              "name": "Melee Stance: Light Obliteration",
              "description": "Performs a slash with a large AoE, Infliggere massive Hydro DMG to all surrounding opponents, which innesca Riptide Blast.",
              "descriptions": []
            },
            {
              "name": "Riptide Blast",
              "description": "When the obliterating waters hit an opponent afflitto by Riptide, it clears their Riptide status and innesca a Hydro Explosion che infligges AoE Hydro DMG. DMG infligget in this way is considered Elemental Burst DMG.",
              "descriptions": []
            }
          ]
        }
      ],
      "passives": [
        {
          "key": "p1",
          "title": "Master of Weaponry",
          "description": "Increases your own party member’s Normal Attack Level by 1.",
          "descriptions": []
        },
        {
          "key": "p2",
          "title": "Never Ending",
          "description": "Extends Riptide duration by 8s.",
          "descriptions": []
        },
        {
          "key": "p3",
          "title": "Sword of Torrents",
          "description": "When Tartaglia is in Foul Legacy: Raging Tide’s Melee Stance, or if his Normal and Charged Attacks do CRIT DMG, they will apply the Riptide status effect on the hit enemy.",
          "descriptions": []
        }
      ],
      "constellations": [
        {
          "key": "c1",
          "title": "Foul Legacy: Tide Withholder",
          "description": "Decreases the CD of Foul Legacy: Raging Tide by 20%.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c2",
          "title": "Foul Legacy: Understream",
          "description": "When opponents afflitto by Riptide are defeated, Tartaglia Rigenera 4 Elemental Energia.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c3",
          "title": "Abyssal Mayhem: Vortex of Turmoil",
          "description": "Aumenta di 3 il livello di Foul Legacy: Raging Tide by 3. Il livello massimo di upgrade è 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c4",
          "title": "Abyssal Mayhem: Hydrospout",
          "description": "If Tartaglia is in Foul Legacy: Raging Tide’s Melee Stance, innesca Riptide Slash against opponents on the field afflitto by Riptide every 4s, otherwise, innesca Riptide Flash. Riptide Slashes and Riptide Flashes triggered by this Constellation effect are not subject to the time intervals that would typically apply to these two Riptide effects, nor do they have any effect on those time intervals.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c5",
          "title": "Havoc: Formless Blade",
          "description": "Aumenta di 3 il livello di Havoc: Obliteration by 3. Il livello massimo di upgrade è 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c6",
          "title": "Havoc: Annihilation",
          "description": "When Havoc: Obliteration is cast in Melee Stance, the CD of Foul Legacy: Raging Tide is reset. This effect will only take place once Tartaglia returns to his Ranged Stance.",
          "secondDescription": null,
          "descriptions": []
        }
      ]
    },
    {
      "key": "Traveler (Anemo)",
      "name": "Traveler (Anemo)",
      "description": "A traveler from another world who had their only kin taken away, forcing them to embark on a journey to find The Seven.",
      "skills": [
        {
          "key": "s1",
          "title": "Foreign Ironwind",
          "description": null,
          "abilities": [
            {
              "key": "a1",
              "description": "Esegue 5 attacchi rapidi.",
              "descriptions": []
            },
            {
              "key": "a2",
              "description": "Consuma una certa quantità di Stamina perper scatenare  2 fendenti rapidi.",
              "descriptions": []
            },
            {
              "key": "a3",
              "description": "Si lancia in picchiata da mezz'aria per colpire il terreno sottostante, danneggiando i nemici lungo il percorso e assestando AoE DMG all'impatto.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s2",
          "title": "Palm Vortex",
          "description": "Grasping the wind’s might, you form a vortex of vacuum in your palm, causing continuous Anemo DMG to enemies in front of you. The vacuum vortex explodes Quando l'abilità scade, causing a greater amount of Anemo DMG over a larger area.",
          "abilities": [
            {
              "key": "a1",
              "description": "DMG and AoE will gradually increase",
              "descriptions": []
            },
            {
              "key": "a2",
              "description": "If the vortex comes in contact with Hydro/Pyro/Cryo/Electro elements, it will infligge additional elemental DMG of that type. Elemental Absorption may only avvenire once per use.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s3",
          "title": "Gust Surge",
          "description": "Guiding the path of the wind currents, you summon a forward-moving tornado that pulls objects and opponents towards itself, Infliggere continuous Anemo DMG.",
          "abilities": [
            {
              "key": "a1",
              "description": "If the tornado comes in contact with Hydro/Pyro/Cryo/Electro elements, it will infligge additional elemental DMG of that type. Elemental Absorption may only avvenire once per use.",
              "descriptions": []
            }
          ]
        }
      ],
      "passives": [
        {
          "key": "p2",
          "title": "Slitting Wind",
          "description": "The last hit of a Normal Attack combo unleashes a wind blade, Infliggere 60% of ATK as Anemo DMG to all opponents in its path.",
          "descriptions": []
        },
        {
          "key": "p3",
          "title": "Second Wind",
          "description": "Palm Vortex kills renegerate 2% HP for 5s. Questo effetto può avvenire solo una volta ogni 5s.",
          "descriptions": []
        }
      ],
      "constellations": [
        {
          "key": "c1",
          "title": "Raging Vortex",
          "description": "Palm Vortex pulls in enemies within a 5m raggio d'azione.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c2",
          "title": "Uprising Whirlwind",
          "description": "Increases Energia Recharge by 16%.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c3",
          "title": "Sweeping Gust",
          "description": "Aumenta di 3 il livello di Gust Surge by 3. Il livello massimo di upgrade è 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c4",
          "title": "Cherishing Breezes",
          "description": "Reduces DMG taken while Attivare Palm Vortex by 10%.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c5",
          "title": "Vortex Stellaris",
          "description": "Aumenta di 3 il livello di Palm Vortex by 3. Il livello massimo di upgrade è 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c6",
          "title": "Intertwined Winds",
          "description": "Targets who take DMG from Gust Surge have their Anemo RES decreased by 20%. If an Elemental Absorption occurred, then their RES towards the corresponding Element is also decreased by 20%.",
          "secondDescription": null,
          "descriptions": []
        }
      ]
    },
    {
      "key": "Traveler (Geo)",
      "name": "Traveler (Geo)",
      "description": "A traveler from another world who had their only kin taken away, forcing them to embark on a journey to find The Seven.",
      "skills": [
        {
          "key": "s1",
          "title": "Foreign Rockblade",
          "description": null,
          "abilities": [
            {
              "key": "a1",
              "description": "Esegue 5 attacchi rapidi.",
              "descriptions": []
            },
            {
              "key": "a2",
              "description": "Consuma una certa quantità di Stamina perper scatenare  2 fendenti rapidi.",
              "descriptions": []
            },
            {
              "key": "a3",
              "description": "Si lancia in picchiata da mezz'aria per colpire il terreno sottostante, danneggiando i nemici lungo il percorso e assestando AoE DMG all'impatto.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s2",
          "title": "Starfell Sword",
          "description": "You disgorge a meteorite from the depths of the earth, Infliggere AoE Geo DMG. The meteorite is considered a Geo Construct, and can be climbed or used to block attacks.",
          "abilities": [
            {
              "key": "a1",
              "description": "The skill’s positioning may be adjusted.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s3",
          "title": "Wake of Earth",
          "description": "Energizing the Geo elements deep underground, you set off expanding shockwaves. Launches surrounding enemies back and infligges AoE Geo DMG. A stone wall is erected at the edges of the shockwave. The stone wall is considered a Geo Construct, and may be used to block attacks.",
          "abilities": []
        }
      ],
      "passives": [
        {
          "key": "p2",
          "title": "Shattered Darkrock",
          "description": "Reduces Starfell Sword’s CD by 2s.",
          "descriptions": []
        },
        {
          "key": "p3",
          "title": "Frenzied Rockslide",
          "description": "The final hit of a Normal Attack combo innesca a collapse, Infliggere 60% of ATK as AoE Geo DMG.",
          "descriptions": []
        }
      ],
      "constellations": [
        {
          "key": "c1",
          "title": "Invincible Stonewall",
          "description": "Allies within the raggio d'azione of Wake of Earth have their CRIT Rate increased by 10% and have increased resistance against interruption.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c2",
          "title": "Rockcore Meltdown",
          "description": "When the meteorite created by Starfell Sword is destroyed, it will also explode, Infliggere additional AoE Geo DMG equal to the amount of damage infligget by Starfell Sword.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c3",
          "title": "Will of the Rock",
          "description": "Aumenta di 3 il livello di Wake of Earth by 3. Il livello massimo di upgrade è 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c4",
          "title": "Reaction Force",
          "description": "The shockwave triggered by Wake of Earth Rigenera 5 Energia for every enemy hit. A maximum of 25 Energia can be recovered in this manner at any one time.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c5",
          "title": "Meteorite Impact",
          "description": "Aumenta di 3 il livello di Starfell Sword by 3. Il livello massimo di upgrade è 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c6",
          "title": "Everlasting Boulder",
          "description": "The barrier created by Wake of Earth lasts 5s longer. The meteorite created by Starfell Sword lasts 10s longer.",
          "secondDescription": null,
          "descriptions": []
        }
      ]
    },
    {
      "key": "Venti",
      "name": "Venti",
      "description": "One of the many bards of Mondstadt, who freely wanders the city’s streets and alleys.",
      "skills": [
        {
          "key": "s1",
          "title": "Divine Marksmanship",
          "description": null,
          "abilities": [
            {
              "key": "a1",
              "description": "Esegue 6 consecutive shots with a bow.",
              "descriptions": []
            },
            {
              "key": "a2",
              "description": "Esegue un colpo mirato più preciso con DMG aumentato. Mentre si mira, favorable winds will accumulate on the arrowhead. A fully charged arrow will infligge Anemo DMG.",
              "descriptions": []
            },
            {
              "key": "a3",
              "description": "Scatena una pioggia di frecce a mezz'aria che infliggono AoE DMG all'impatto con il terreno.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s2",
          "title": "Skyward Sonnet",
          "description": "O wind upon which all hymns and songs fly, bear these earth-walkers up into the sky!",
          "abilities": [
            {
              "key": "a1",
              "description": "Fa apparire a Wind Domain at the enemy’s location, Infliggere AoE Anemo DMG and launching enemies into the air.",
              "descriptions": []
            },
            {
              "key": "a2",
              "description": "Fa apparire an even larger Wind Domain with Venti as the epicenter, Infliggere AoE Anemo DMG and launching afflitto enemies into the air. After unleashing the Hold version of this ability, Venti rides the wind into the air. Enemies hit by Skyward Sonnet will fall to the ground slowly.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s3",
          "title": "Wind’s Grand Ode",
          "description": "Scatena an arrow made of countless coalesced winds, creating a huge Stormeye that sucks in objects and enemies along its path, Infliggere continuous Anemo DMG.",
          "abilities": [
            {
              "key": "a1",
              "description": "If the Stormeye comes into contact with Hydro/Pyro/Cryo/Electro elements, it will infligge additional elemental DMG of that type. Elemental Absorption may only avvenire once per use.",
              "descriptions": []
            }
          ]
        }
      ],
      "passives": [
        {
          "key": "p1",
          "title": "Windrider",
          "description": "Decreases all party member’s gliding consumo di Stamina by 20%.",
          "descriptions": []
        },
        {
          "key": "p2",
          "title": "Embrace of Winds",
          "description": "Holding Skyward Sonnet creates an upcurrent that lasts for 20s.",
          "descriptions": []
        },
        {
          "key": "p3",
          "title": "Stormeye",
          "description": "Rigenera 15 Energia for Venti quando scade Wind’s Grand Ode end. If an Elemental Absorption occurred, this also restores 15 Energia to all characters of that corresponding element.",
          "descriptions": []
        }
      ],
      "constellations": [
        {
          "key": "c1",
          "title": "Splitting Gale",
          "description": "Fires 2 additional arrows per Colpo Mirato, each Infliggere 33% of the original arrow’s DMG.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c2",
          "title": "Breeze of Reminiscence",
          "description": "Skyward Sonnet decreases enemy Anemo RES by 12% for 10s. Enemies launched by Skyward Sonnet suffer an additional 12% Anemo RES and Physical RES decrease while airborne.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c3",
          "title": "Ode to Thousand Winds",
          "description": "Aumenta di 3 il livello di Wind’s Grand Ode by 3. Il livello massimo di upgrade è 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c4",
          "title": "Hurricane of Freedom",
          "description": "When Venti picks up an Elemental Orb or Particle, he receives a 25% Anemo DMG Bonus for 10s.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c5",
          "title": "Concierto dal Cielo",
          "description": "Aumenta di 3 il livello di Skyward Sonnet by 3. Il livello massimo di upgrade è 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c6",
          "title": "Storm of Defiance",
          "description": "Targets who take DMG from Wind’s Grand Ode have their Anemo RES decreased by 20%. If an Elemental Absorption occurred, then their RES towards the corresponding Element is also decreased by 20%.",
          "secondDescription": null,
          "descriptions": []
        }
      ]
    },
    {
      "key": "Xiangling",
      "name": "Xiangling",
      "description": "A renowned chef from Liyue. She’s extremely passionate about cooking and excels at making her signature hot and spicy dishes.",
      "skills": [
        {
          "key": "s1",
          "title": "Dough-Fu",
          "description": null,
          "abilities": [
            {
              "key": "a1",
              "description": "Esegue 5 consecutive spear strikes.",
              "descriptions": []
            },
            {
              "key": "a2",
              "description": "Consuma una certa quantità di Stamina per to lunge forward, Infliggere damage to enemies along the way.",
              "descriptions": []
            },
            {
              "key": "a3",
              "description": "Si lancia in picchiata da mezz'aria per colpire il terreno sottostante, danneggiando i nemici lungo il percorso e assestando AoE DMG all'impatto.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s2",
          "title": "Guoba Attack",
          "description": "Fa apparire Guoba the Panda. Guoba continuously breathes fire, Infliggere AoE Pyro DMG.",
          "abilities": []
        },
        {
          "key": "s3",
          "title": "Pyronado",
          "description": "Displaying her mastery over both fire and polearms, Xiangling sends a Pyronado whirling around her. The Pyronado will move with your character for so long as the ability persists, Infliggere Pyro DMG to all enemies in its path.",
          "abilities": []
        }
      ],
      "passives": [
        {
          "key": "p1",
          "title": "Chef de Cuisine",
          "description": "When Xiangling cooks an ATK-boosting dish perfectly, she has a 12% possibilità di ricevere il doppio del prodotto.",
          "descriptions": []
        },
        {
          "key": "p2",
          "title": "Crossfire",
          "description": "Increases the flame range of Guoba by 20%.",
          "descriptions": []
        },
        {
          "key": "p3",
          "title": "Beware, It’s Super Hot!",
          "description": "When Guoba Attack’s effect ends, Guoba leaves a chili pepper on the spot where it disappeared. Picking up a chili pepper increases ATK by 10% for 10s.",
          "descriptions": []
        }
      ],
      "constellations": [
        {
          "key": "c1",
          "title": "Crispy Outside, Tender Inside",
          "description": "Enemies hit by Guoba’s attacks have their Pyro RES reduced by 15% for 6s.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c2",
          "title": "Oil Meets Fire",
          "description": "The last attack in a Normal Attack sequence Applica the Implode status onto the enemy for 2s. An explosion will avvenire once this duration ends, Infliggere 75% of Xiangling’s ATK as AoE Pyro DMG.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c3",
          "title": "Deepfry",
          "description": "Aumenta di 3 il livello di Pyronado by 3. Il livello massimo di upgrade è 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c4",
          "title": "Slowbake",
          "description": "Pyronado’s duration is increased by 40%.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c5",
          "title": "Guoba Mad",
          "description": "Aumenta di 3 il livello di Guoba Attack by 3. Il livello massimo di upgrade è 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c6",
          "title": "Condensed Pyronado",
          "description": "For the duration of Pyronado, tutti i membri del party receive a 15% Pyro DMG Bonus.",
          "secondDescription": null,
          "descriptions": []
        }
      ]
    },
    {
      "key": "Xiao",
      "name": "Xiao",
      "description": "A yaksha adeptus who defends Liyue. Also heralded as the \"Conqueror of Demons\" or \"Vigilant Yaksha.\"",
      "skills": [
        {
          "key": "s1",
          "title": "Whirlwind Thrust",
          "abilities": [
            {
              "key": "a1",
              "description": "Esegue  6 rapid strikes.",
              "descriptions": []
            },
            {
              "key": "a2",
              "description": "Consuma una certa quantità di Stamina per to perform an upward thrust.",
              "descriptions": []
            },
            {
              "key": "a3",
              "description": "Si lancia in picchiata da mezz'aria per colpire il terreno sottostante, danneggiando i nemici lungo il percorso e assestando AoE DMG all'impatto.\nXiao does not take DMG from performing Plunging Attacks.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s2",
          "title": "Lemniscatic Wind Cycling",
          "description": "Xiao lunges forward, Infliggere Anemo DMG to opponents in his path.\nCan be used in mid-air.\nStarts with 2 charges.",
          "abilities": []
        },
        {
          "key": "s3",
          "title": "Bane of All Evil",
          "description": "Xiao dons the Yaksha Mask that set gods and demons trembling millennia ago.",
          "abilities": [
            {
              "description": "Yaksha's Mask",
              "descriptions": [
                "Greatly increases Xiao's jumping ability.",
                "Increases his attack AoE and attack DMG.",
                "Converts attack DMG into Anemo DMG, which cannot be overridden by any other elemental infusion. In this state, Xiao will continuously lose HP.",
                "The effects of this skill end when Xiao leaves the field."
              ]
            }
          ]
        }
      ],
      "passives": [
        {
          "key": "p1",
          "title": "Transcension: Gravity Defier",
          "description": "Decreases climbing consumo di Stamina for your own party members by 20%.\nNot stackable with Passive Talents that provide the exact same effects.",
          "descriptions": []
        },
        {
          "key": "p2",
          "title": "Conqueror of Evil: Tamer of Demons",
          "description": "While under the effects of Bane of All Evil, all DMG infligget by Xiao increases by 5%. DMG increases by a further 5% for every 3s the ability persists.\nThe maximum DMG Bonus is 25%.",
          "descriptions": []
        },
        {
          "key": "p3",
          "title": "Dissolution Eon: Heaven Fall",
          "description": "Using Lemniscatic Wind Cycling increases the DMG of subsequent uses of Lemniscatic Wind Cycling by 15%.\n This effect lasts for 7s, and has a maximum of 3 stacks. Gaining a new stack refreshes the effect's duration.",
          "descriptions": []
        }
      ],
      "constellations": [
        {
          "key": "c1",
          "title": "Dissolution Eon: Destroyer of Worlds",
          "description": "Increases Lemniscatic Wind Cycling’s charges by 1.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c2",
          "title": "Annihilation Eon: Blossom of Kaleidos",
          "description": "When in the party and not on the field, Xiao's Energia Recharge is increased by 25%.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c3",
          "title": "Conqueror of Evil: Wrath Deity",
          "description": "Aumenta di 3 il livello di Lemniscatic Wind Cycling by 3. Il livello massimo di upgrade è 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c4",
          "title": "Transcension: Extinction of Suffering",
          "description": "When Xiao's HP falls below 50%, he gains a 100% DEF Bonus.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c5",
          "title": "Evolution Eon: Origin of Ignorance",
          "description": "Aumenta di 3 il livello di Bane of All Evil by 3. Il livello massimo di upgrade è 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c6",
          "title": "Conqueror of Evil: Guardian Yaksha",
          "description": "While under the effects of Bane of All Evil, hitting at least 2 opponents with Xiao's Attacco in Picchiata will immediately garantisce him 1 charge of Lemniscatic Wind Cycling, and for the next 1s, he may use Lemniscatic Wind Cycling while ignoring its CD.",
          "secondDescription": null,
          "descriptions": []
        }
      ]
    },
    {
      "key": "Xingqiu",
      "name": "Xingqiu",
      "description": "A young man carrying a longsword who is frequently seen at book booths. He has a chivalrous heart and yearns for justice and fairness for all.",
      "skills": [
        {
          "key": "s1",
          "title": "Guhua Style",
          "description": null,
          "abilities": [
            {
              "key": "a1",
              "description": "Esegue 5 consecutive spear strikes.",
              "descriptions": []
            },
            {
              "key": "a2",
              "description": "Consuma una certa quantità di Stamina perper scatenare  2 fendenti rapidi.",
              "descriptions": []
            },
            {
              "key": "a3",
              "description": "Plunges from mid-aur to strike the ground below, damaging enemies along the path and Infliggere AoE DMG upon impact.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s2",
          "title": "Guhua Sword - Fatal Rainscreen",
          "description": "Xingqiu performs twin strikes with his sword, Infliggere Hydro DMG. At the same time, this ability creates the maximum number of Rain Swords, which will orbit the character. 20% of Xingqiu’s Hydro DMG Bonus will be converted to additional DMG Reduction for the Rain Swords. The maximum amount of additional DMG Reduction that can be gained this way is 24%. The initial maximum number of Rain Swords is 3. Using this ability Applica the Wet status onto the character.",
          "abilities": [
            {
              "name": "",
              "description": "The Rain Swords have the following properties:",
              "descriptions": [
                "When a character takes DMG, the Rain Sword will shatter, reducing the amount of DMG taken.",
                "Increases the character’s resistance to interruption."
              ]
            }
          ]
        },
        {
          "key": "s3",
          "title": "Guhua Sword - Raincutter",
          "description": "Initiate Rainbow Bladework and fight using an illusory sword rain, while creating the maximum number of Rain Swords.",
          "abilities": [
            {
              "name": "Rainbow Bladework",
              "description": "These effects carry over to other characters.",
              "descriptions": [
                "Normal Attacks will trigger consecutive sword rain attacks, Infliggere Hydro DMG.",
                "Rain Swords will remain at the maximum number throughout the ability’s duration."
              ]
            }
          ]
        }
      ],
      "passives": [
        {
          "key": "p1",
          "title": "Lampo di Genio",
          "description": "When Xingqiu crafts Character Talent Materials, he has a 25% chance to refund a portion of the crafting materials used.",
          "descriptions": []
        },
        {
          "key": "p2",
          "title": "Hydropathic",
          "description": "When a Rain Sword is shattered or when its duration expires, it Rigenera the current character’s HP based on 6% of Xingqiu’s Max HP.",
          "descriptions": []
        },
        {
          "key": "p3",
          "title": "Blades Amidst Raindrops",
          "description": "Xingqiu gains a 20% Hydro DMG Bonus.",
          "descriptions": []
        }
      ],
      "constellations": [
        {
          "key": "c1",
          "title": "The Scent Remained",
          "description": "Increases the maximum number of Rain Swords by 1.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c2",
          "title": "Rainbow Upon the Azure Sky",
          "description": "Extends the duration of Guhua Sword - Raincutter by 3s. Decreases the Hydro RES of enemies hit by sword rain attacks by 15% for 4s.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c3",
          "title": "Weaver of Verses",
          "description": "Aumenta di 3 il livello di Guhua Sword - Raincutter by 3. Il livello massimo di upgrade è 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c4",
          "title": "Evilsoother",
          "description": "Throughout the duration of Guhua Sword: Raincutter, the DMG infligget by Guhua Sword: Fatal Rainscreen is increased by 50%.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c5",
          "title": "Embrace of Rain",
          "description": "Aumenta di 3 il livello di Guhua Sword - Fatal Rainscreen by 3. Il livello massimo di upgrade è 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c6",
          "title": "Hence, Call Them My Own Verses",
          "description": "Activating 2 of Guhua Sword - Raincutter’s sword rain attacks greatly increases the DMG of the third. Xingqiu Rigenera 3 Energia when sword rain attacks hit enemies.",
          "secondDescription": null,
          "descriptions": []
        }
      ]
    },
    {
      "key": "Xinyan",
      "name": "Xinyan",
      "description": "Liyue’s sole rock ’n’ roll musician. She rebels against ossified prejudices using her music and passionate singing.",
      "skills": [
        {
          "key": "s1",
          "title": "Dance on Fire",
          "description": null,
          "abilities": [
            {
              "key": "a1",
              "description": "Esegue 4 attacchi rapidi.",
              "descriptions": []
            },
            {
              "key": "a2",
              "description": "Drains Stamina over time to perform continuous spinning attacks against all nearby enemies. Alla fine della sequenza, infligge un colpo molto più potente.",
              "descriptions": []
            },
            {
              "key": "a3",
              "description": "Si lancia in picchiata da mezz'aria per colpire il terreno sottostante, danneggiando i nemici lungo il percorso e assestando AoE DMG all'impatto.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s2",
          "title": "Sweeping Fervor",
          "description": "Xinyan brandishes her instrument, Infliggere Pyro DMG on nearby enemies, forming a shield made out of her audience’s passion.",
          "abilities": [
            {
              "name": "",
              "description": "The shield’s DMG Absorption scales based on Xinyan’s DEF and on the number of enemies hit:",
              "descriptions": [
                "Hitting 0-1 enemies conferisce Shield Level 1: Ad Lib.",
                "Hitting 2 enemies conferisce Shield Level 2: Lead-In.",
                "Hitting 3 or more enemies conferisce Shield Level 3: Rave, which will also infligge intermittent Pyro DMG to nearby enemies."
              ]
            },
            {
              "name": "",
              "description": "The shield has the following special properties:",
              "descriptions": [
                "When unleashed, it infuses Xinyan with Pyro.",
                "It has 250% DMG Absorption effectiveness against Pyro DMG."
              ]
            }
          ]
        },
        {
          "key": "s3",
          "title": "Riff Revolution",
          "description": "Strumming rapidly, Xinyan launches nearby enemies and infligges Physical DMG to them, hyping up the crowd. The sheer intensity of the atmosphere will cause explosions che infligge Pyro DMG to nearby enemies.",
          "abilities": []
        }
      ],
      "passives": [
        {
          "key": "p1",
          "title": "A Rad Recipe",
          "description": "Quando si ottiene un Perfect Cooking su un piatto con an DEF-boosting dish, Xinyan has a 12% di possibilità di ottenere il doppio del prodotto.",
          "descriptions": []
        },
        {
          "key": "p2",
          "title": "\"The Show Goes On, Even Without an Audience...\"",
          "description": "Decreases the number of enemies Sweeping Fervor must hit to trigger each level of shielding.",
          "descriptions": [
            "Shield Level 2: Lead-In requirement reduced to 1 enemy hit.",
            "Shield Level 3: Rave requirement reduced to 2 enemies hit or more."
          ]
        },
        {
          "key": "p3",
          "title": "\"...Now That’s Rock ’N’ Roll!\"",
          "description": "Characters shielded by Sweeping Fervor infligge 15% increased Physical DMG.",
          "descriptions": []
        }
      ],
      "constellations": [
        {
          "key": "c1",
          "title": "Fatal Acceleration",
          "description": "Upon scoring a CRIT hit, increases ATK SPD of Xinyan’s Normal and Charged Attacks by 12% for 5s. Can only avvenire once every 5s.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c2",
          "title": "Impromptu Opening",
          "description": "Riff Revolution Physical DMG has its Crit rate increased by 100%, and will form a shield at Shield Level 3: Rave when cast.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c3",
          "title": "Double Stop",
          "description": "Aumenta di 3 il livello di Sweeping Fervor by 3. Il livello massimo di upgrade è 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c4",
          "title": "Wildfire Rhythm",
          "description": "Sweeping Fervor’s swing DMG decrease opponents Physical RES by 15% for 12s.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c5",
          "title": "Screamin’ for an Encore",
          "description": "Aumenta di 3 il livello di Riff Revolution by 3. Il livello massimo di upgrade è 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c6",
          "title": "Rockin’ in a Flaming World",
          "description": "Decrease Il Consumo di Stamina of Xinyan Charged Attacks by 30%. Inoltre, Xinyan Charged Attack gain an ATK bonus equal to 50% of her DEF.",
          "secondDescription": null,
          "descriptions": []
        }
      ]
    },
    {
      "key": "Zhongli",
      "name": "Zhongli",
      "description": "A mysterious guest invited by the Wangsheng Funeral Parlor. Extremely knowledgeable in all things.",
      "skills": [
        {
          "key": "s1",
          "title": "Rain of Stone",
          "description": null,
          "abilities": [
            {
              "key": "a1",
              "description": "Performs up to 6 consecutive spear strikes.",
              "descriptions": []
            },
            {
              "key": "a2",
              "description": "Consuma una certa quantità di Stamina per to lunge forward, causing stone spears to fall along his path.",
              "descriptions": []
            },
            {
              "key": "a3",
              "description": "Si lancia in picchiata da mezz'aria per colpire il terreno sottostante, danneggiando i nemici lungo il percorso e assestando AoE DMG all'impatto.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s2",
          "title": "Dominus Lapidis",
          "description": "Every mountain, rock and inch of land is filled with the power of Geo, but those who can wield such powers freely are few and far between.",
          "abilities": [
            {
              "key": "a1",
              "description": "Commands the power of earth to create a Stone Stele.",
              "descriptions": []
            },
            {
              "key": "a2",
              "description": "Causes nearby Geo Energia to explode, causing the following effects:",
              "descriptions": [
                "If their maximum number hasn't been reached, creates a Stone Stele.",
                "Creates a shield of jade. The shield's DMG Absorption scales based on Zhongli's Max HP.",
                "infligges AoE Geo DMG.",
                "If there are nearby targets with the Geo element, it will drain a large amount of Geo element from a maximum of 2 such targets. This effect does not cause DMG."
              ]
            },
            {
              "name": "Stone Stele",
              "description": "When created, infligges AoE Geo DMG.\nInoltre, it will intermittently resonate with other nearby Geo constructs, Infliggere Geo DMG to nearby opponents.\n1The Stone Stele is considered a Geo construct that can both be climbed and used to block attacks.\nOnly one Stele created by Zhongli himself may initially exist at any one time",
              "descriptions": []
            },
            {
              "name": "Jade Shield",
              "description": "Possesses 150% DMG Absorption against all Elemental and Physical DMG.\nCharacters protected by the Jade Shield will decrease the Elemental RES and Physical RES of opponents in un piccolo AoE by 20%. This effect cannot be stacked.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s3",
          "title": "Planet Befall",
          "description": "Brings a falling meteor down to earth, Infliggere massive Geo DMG to opponents caught in its AoE and applying the Petrification status to them.",
          "abilities": [
            {
              "name": "Petrification",
              "description": "Opponents afflitto by the Petrification status cannot move.",
              "descriptions": []
            }
          ]
        }
      ],
      "passives": [
        {
          "key": "p1",
          "title": "Arcanum of Crystal",
          "description": "Rimborsa il 15% dei minerali usati per la creazioni di Polearm-type weapons.",
          "descriptions": []
        },
        {
          "key": "p2",
          "title": "Resonant Waves",
          "description": "When the Jade Shield takes DMG, it will Fortify:",
          "descriptions": [
            "Fortified characters have 5% increased Shield Strength.",
            "Can stack up to 5 times, and lasts until the Jade Shield disappears."
          ]
        },
        {
          "key": "p3",
          "title": "Dominance of Earth",
          "description": "Zhongli infligges bonus DMG based on his Max HP:",
          "descriptions": [
            "Normal Attack, Charged Attack, and Attacco in Picchiata DMG is increased by 1.39% of Max HP.",
            "Dominus Lapidis' Stone Stele, resonance, and hold DMG is increased by 1.9% of Max HP.",
            "Planet Befall's DMG is increased by 33% of Max HP."
          ]
        }
      ],
      "constellations": [
        {
          "key": "c1",
          "title": "Rock, the Backbone of Earth",
          "description": "Increases the maximum number of Stone Steles created by Dominus Lapidis that may exist simultaneously by 2.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c2",
          "title": "Stone, the Cradle of Jade",
          "description": "Planet Befall conferisce nearby characters on the field a Jade Shield when it descends.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c3",
          "title": "Jade, Shimmering through Darkness",
          "description": "Aumenta di 3 il livello di Dominus Lapidis by 3. Il livello massimo di upgrade è 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c4",
          "title": "Topaz, Unbreakable and Fearless",
          "description": "Increases Planet Befall’s AoE by 20% and increases the duration of Planet Befall’s Petrification effect by 2s.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c5",
          "title": "Lazuli, Herald of the Order",
          "description": "Aumenta di 3 il livello di Planet Befall by 3. Il livello massimo di upgrade è 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c6",
          "title": "Chrysos, Bounty of Dominator",
          "description": "When the Jade Shield takes DMG, 40% of that incoming DMG is converted to HP for the current character.\nA single instance of regeneration cannot exceed 8% of that character’s Max HP.",
          "secondDescription": null,
          "descriptions": []
        }
      ]
    }
  ],
  "weapons": [
    {
      "key": "Hunter’s Bow",
      "name": "Hunter’s Bow",
      "description": "A hunter’s music consists of but two sounds: the twang of the bowstring and the whoosh of soaring arrows.",
      "refinement": null
    },
    {
      "key": "Seasoned Hunter’s Bow",
      "name": "Seasoned Hunter’s Bow",
      "description": "A bow that has been well-polished by time and meticulously cared for by its owner. It feels almost like an extension of the archer’s arm.",
      "refinement": null
    },
    {
      "key": "Ebony Bow",
      "name": "Ebony Bow",
      "description": "A longbow made of ebony wood with stiffer limbs than ordinary bows. It is also a far more powerful weapon.",
      "refinement": "Increases DMG against mechanoid Ruin enemies by {{0}}%"
    },
    {
      "key": "Messenger",
      "name": "Messenger",
      "description": "A basic wooden bow. It is said to have once been used as a tool for long-distance communication.",
      "refinement": "Charged Attack hits on weak points infligge an additional {{0}}% ATK DMG as CRIT DMG. Can only avvenire once every 10s."
    },
    {
      "key": "Raven Bow",
      "name": "Raven Bow",
      "description": "Ravens are known to be the ferrymen of the dead. This bow’s limb is decorated with raven feathers, which forebode the imminent death of its target.",
      "refinement": "Increases DMG against enemies afflitto by Hydro or Pyro by {{0}}%"
    },
    {
      "key": "Recurve Bow",
      "name": "Recurve Bow",
      "description": "It is said that this bow can shoot down eagles in flight, but ultimately how true that is depends on the skill of the archer.",
      "refinement": "Defeating an opponent restores {{0}}% HP"
    },
    {
      "key": "Sharpshooter’s Oath",
      "name": "Sharpshooter’s Oath",
      "description": "This superior bow once belonged to a master archer. However, it gives off a strong scent, thus making it unsuitable for hunting.",
      "refinement": "Increases DMG against weak spots by {{0}}%"
    },
    {
      "key": "Slingshot",
      "name": "Slingshot",
      "description": "A bow, despite the name. After countless experiments and improvements to the design, the creator of the ultimate slingshot found himself to have made what was actually a bow.",
      "refinement": "If a Normal or Charged Attack hits a target within 0.3s of being fired, increases DMG by {{0}}%. Otherwise, decreases DMG by 10%."
    },
    {
      "key": "The Stringless",
      "name": "The Stringless",
      "description": "A bow that once served as an extraordinary instrument. It is no longer capable of getting people up and dancing.",
      "refinement": "Increases Elemental Skill and Elemental Burst DMG by {{0}}%."
    },
    {
      "key": "Alley Hunter",
      "name": "Alley Hunter",
      "description": "An intricate, opulent longbow. It once belonged to a gentleman thief who was never caught.",
      "refinement": "Every 4s a character is on the field, their ATK increases by {{0}}% and their CRIT DMG increases by {{1}}%. This effect has a maximum of 5 stacks and will not be reset if the character leaves the field, but will be cleared when the character takes DMG."
    },
    {
      "key": "Blackcliff Warbow",
      "name": "Blackcliff Warbow",
      "description": "A bow made of blackcliff that features extremely sturdy bow limbs. It requires an archer with a strong bow arm to use.",
      "refinement": "After defeating an enemy, ATK is increased by {{0}}% for 30s. This effect has a maximum of 3 stacks, and the duration of each stack is independent of the others."
    },
    {
      "key": "Compound Bow",
      "name": "Compound Bow",
      "description": "An exotic metallic bow from a distant land. Though extremely difficult to maintain, it is easy to nock and fires with tremendous force.",
      "refinement": "Normal Attack and Charged Attack hits increase ATK by {{0}}% and Normal ATK SPD by {{1}}% for 6s. Max 4 stacks. Can only avvenire once every 0.3s."
    },
    {
      "key": "Favonius Warbow",
      "name": "Favonius Warbow",
      "description": "A standard-issue recurve bow of the Knights of Favonius. Only the best archers can unleash its full potential.",
      "refinement": "CRIT Hits have a {{0}}% chance to generate a small amount of Elemental Particles, which will regenerate 6 Energia for the character. Can only avvenire once every {{1}}s."
    },
    {
      "key": "Prototype Crescent",
      "name": "Prototype Crescent",
      "description": "A prototype longbow discovered in the Blackcliff Forge. The arrow fired from this bow glimmers like a ray of moonlight.",
      "refinement": "Charged Attack hits on weak points increase Movement SPD by 10% and ATK by {{0}}% for 10s."
    },
    {
      "key": "Royal Bow",
      "name": "Royal Bow",
      "description": "An old royal longbow that belonged to the erstwhile rulers of Mondstadt. Countless generations later, the bowstring is still tight and can still fire arrows with great force.",
      "refinement": "Upon damaging an opponent, increases CRIT Rate by {{0}}%. Max 5 stacks. A CRIT hit removes all stacks."
    },
    {
      "key": "Rust",
      "name": "Rust",
      "description": "A completely rusted iron greatbow. The average person would lack the strength to even lift it, let alone fire it.",
      "refinement": "Increases Normal Attack DMG by {{0}}% but decreases Charged Attack DMG by 10%."
    },
    {
      "key": "Sacrificial Bow",
      "name": "Sacrificial Bow",
      "description": "A ceremonial hunting bow that has become petrified over time. The trinkets on it are still visible. It conferisce the wielder the power to withstand the winds of time.",
      "refinement": "After damaging an opponent with an Elemental Skill, the skill has a {{0}}% chance to end its own CD. Can only avvenire once every {{1}}s"
    },
    {
      "key": "The Viridescent Hunt",
      "name": "The Viridescent Hunt",
      "description": "A pure green hunting bow. This once belonged to a certain hunter whose home was the forest.",
      "refinement": "Upon hit, Normal and Colpo Mirato Attacks have a 50% chance to generate a Cyclone, which will continuously attract surrounding enemies, Infliggere {{0}}% of ATK as DMG to these enemies every 0.5s for 4s. Questo effetto può avvenire solo una volta ogni {{1}}s"
    },
    {
      "key": "Skyward Harp",
      "name": "Skyward Harp",
      "description": "A greatbow that symbolizes Dvalin’s affiliation with the Anemo Archon. The sound of the bow firing is music to the Anemo Archon’s ears. It contains the power of the sky and wind within.",
      "refinement": "Increases CRIT DMG by {{0}}%. Hits have a {{1}}% chance to inflict a small AoE attack, Infliggere 125% Physical ATK DMG. Can only avvenire once every {{2}}s."
    },
    {
      "key": "Amos’ Bow",
      "name": "Amos’ Bow",
      "description": "An extremely ancient bow that has retained its power despite its original master being long gone. It draws power from everyone and everything in the world, and the further away you are from that which your heart desires, the more powerful it is.",
      "refinement": "Increases Normal and Charged Attack DMG by {{0}}%. Normal and Charged Attack DMG increases by {{1}}% every 0.1s for up to 5 times."
    },
    {
      "key": "Dreams of Dragonfell",
      "name": "Dreams of Dragonfell",
      "description": "A great bow that once shot clean through a giant dragon. Once released, the impetus of its bowstring resembles a peal of thunder.",
      "refinement": "Increases Shield Strength by {{0}}%. Scoring hits on opponents increases ATK by {{1}}% for 8s. Max 5 stacks. Can only avvenire once every 0.3s. While protected by a shield, this ATK increase effect is increased by 100%."
    },
    {
      "key": "Dull Blade",
      "name": "Dull Blade",
      "description": "Youthful dreams and the thrill of adventure. If this isn’t enough, then make it up with valiance.",
      "refinement": null
    },
    {
      "key": "Silver Sword",
      "name": "Silver Sword",
      "description": "A sword for exorcising demons. Everyone knows it’s made of a silver alloy, not pure silver.",
      "refinement": null
    },
    {
      "key": "Cool Steel",
      "name": "Cool Steel",
      "description": "A reliable steel-forged weapon that serves as a testament to the great adventures of its old master.",
      "refinement": "Increases DMG against enemies afflitto by Hydro or Cryo by {{0}}%"
    },
    {
      "key": "Dark Iron Sword",
      "name": "Dark Iron Sword",
      "description": "A perfectly ordinary iron sword, just slightly darker than most.",
      "refinement": "Upon causing an Overloaded, Superconduct, Electro-Charged, or an Electro-infused Swirl reaction, ATK is increased by {{0}}% for 12s."
    },
    {
      "key": "Fillet Blade",
      "name": "Fillet Blade",
      "description": "A sharp filleting knife. The blade is long, thin, and incredibly sharp.",
      "refinement": "On hit, has a 50% chance to infligge {{0}}% ATK DMG to a single enemy. Can only avvenire once every {{1}}s."
    },
    {
      "key": "Harbinger of Dawn",
      "name": "Harbinger of Dawn",
      "description": "A sword that once shone like the sun. The wielder of this sword will be blessed with a \"feel-good\" buff. The reflective material on the blade has long worn off.",
      "refinement": "When HP supera 90%, increases CRIT Rate by {{0}}%."
    },
    {
      "key": "Skyrider Sword",
      "name": "Skyrider Sword",
      "description": "A reliable steel sword. The legendary Skyrider once tried to ride it as a flying sword...",
      "refinement": "Using an Elemental Burst conferisce a {{0}}% increase in ATK and Movement SPD for 15s."
    },
    {
      "key": "Traveler’s Handy Sword",
      "name": "Traveler’s Handy Sword",
      "description": "A handy steel sword which contains scissors, a magnifying glass, tinder, and other useful items in its sheath.",
      "refinement": "Each Elemental Orb or Particle collected restores {{0}}% HP."
    },
    {
      "key": "Blackcliff Longsword",
      "name": "Blackcliff Longsword",
      "description": "A sword made of a material known as \"blackcliff.\" It has a dark crimson glow on its black blade.",
      "refinement": "After defeating an enemy, ATK is increased by {{0}}% for 30s. This effect has a maximum of 3 stacks, and the duration of each stack is independent of the others."
    },
    {
      "key": "Favonius Sword",
      "name": "Favonius Sword",
      "description": "A standard-issue longsword of the Knights of Favonius. When you’re armed with this agile and sharp weapon, channeling the power of the elements has never been so easy!",
      "refinement": "CRIT Hits have a {{0}}% chance to generate a small amount of Elemental Particles, which will regenerate 6 Energia for the character. Can only avvenire once every {{1}}s."
    },
    {
      "key": "Iron Sting",
      "name": "Iron Sting",
      "description": "An exotic long-bladed rapier that somehow found its way into Liyue via foreign traders. It is light, agile, and sharp.",
      "refinement": "Infliggere Elemental DMG increases all DMG by {{0}}% for 6s. Max 2 stacks. Can avvenire once every 1s."
    },
    {
      "key": "Lion’s Roar",
      "name": "Lion’s Roar",
      "description": "A sharp blade with extravagant carvings that somehow does not compromise on durability and sharpness. It roars like a lion as it cuts through the air.",
      "refinement": "Increases DMG against enemies afflitto by Pyro or Electro by {{0}}%"
    },
    {
      "key": "Prototype Rancour",
      "name": "Prototype Rancour",
      "description": "An ancient longsword discovered in the Blackcliff Forge that cuts through rocks like a hot knife through butter.",
      "refinement": "On hit, Normal or Charged Attacks increase ATK and DEF by {{0}}% for 6s. Max 4 stacks. Questo effetto può avvenire solo una volta ogni 0.3s."
    },
    {
      "key": "Royal Longsword",
      "name": "Royal Longsword",
      "description": "An old longsword that belonged to the erstwhile rulers of Mondstadt. Exquisitely crafted, the carvings and embellishments testify to the stature of its owner.",
      "refinement": "Upon damaging an opponent, increases CRIT Rate by {{0}}%. Max 5 stacks. A CRIT hit removes all stacks."
    },
    {
      "key": "Sacrificial Sword",
      "name": "Sacrificial Sword",
      "description": "A ceremonial sword that has become petrified over time. The trinkets on it are still visible. It conferisce the wielder the power to withstand the winds of time.",
      "refinement": "After damaging an opponent with an Elemental Skill, the skill has a {{0}}% chance to end its own CD. Can only avvenire once every {{1}}s"
    },
    {
      "key": "The Alley Flash",
      "name": "The Alley Flash",
      "description": "A straight sword as black as the night. It once belonged to a thief who roamed the benighted streets.",
      "refinement": "Increases DMG dealt by the character equipping this weapon by {{0}}%. Taking DMG disables this effect for 5s."
    },
    {
      "key": "The Black Sword",
      "name": "The Black Sword",
      "description": "A pitch-black longsword that thirsts for violence and conflict. It is said that this weapon can cause its user to become drunk on the red wine of slaughter.",
      "refinement": "Increases DMG infligget by Normal and Charged Attacks by {{0}}%. Inoltre, Rigenera {{1}}% of ATK as HP when Normal and Charged Attacks score a CRIT Hit. This effect can avvenire once every 5s."
    },
    {
      "key": "The Flute",
      "name": "The Flute",
      "description": "Beneath its rusty exterior is a lavishly decorated thin blade. It swings as swiftly as the wind.",
      "refinement": "Normal or Charged Attacks garantisce a Harmonic on hits. Gaining 5 Harmonics innesca the power of music and infligges {{0}}% ATK DMG to surrounding enemies. Harmonics last up to 30s, and a maximum of 1 can be gained every 0.5s."
    },
    {
      "key": "Sword of Descension",
      "name": "Sword of Descension",
      "description": "A sword of unique craftsmanship. It does not appear to belong to this world.",
      "refinement": "Hitting opponents with Normal and Charged Attacks conferisce a {{0}}% chance to infligge 200% ATK as DMG in un piccolo AoE. Questo effetto può avvenire solo una volta ogni 10s. Inoltre, if the Traveler equips the Sword of Descension, their ATK is increased by {{1}}."
    },
    {
      "key": "Festering Desire",
      "name": "Festering Desire",
      "description": "A creepy straight sword that almost seems to yearn for life. It drips with a shriveling venom that could even corrupt a mighty dragon.",
      "refinement": "Increases Elemental Skill DMG by {{0}}% and Elemental Skill CRIT Rate by {{1}}%."
    },
    {
      "key": "Aquila Favonia",
      "name": "Aquila Favonia",
      "description": "The soul of the Knights of Favonius. Millennia later, it still calls on the winds of swift justice to vanquish all evil  just like the last heroine who wielded it.",
      "refinement": "ATK is increased by {{0}}%. innesca on taking DMG: the soul of the Falcon of the West awakens, holding the banner of resistance aloft, regenerating HP equal to {{1}}% of ATK and Infliggere {{2}}% of ATK as DMG to surrounding enemies. Questo effetto può avvenire solo una volta ogni 15s."
    },
    {
      "key": "Skyward Blade",
      "name": "Skyward Blade",
      "description": "The sword of a knight that symbolizes the restored honor of Dvalin. The blessings of the Anemo Archon rest on the fuller of the blade, imbuing the sword with the powers of the sky and the wind.",
      "refinement": "CRIT Rate increased by {{0}}%. Gains Skypiercing Might upon using an Elemental Burst: Increases Movement SPD by 10%, increases ATK SPD by 10%, and increases the DMG of Normal and Charged Attack hits by {{1}}% for 12s."
    },
    {
      "key": "Summit Shaper",
      "name": "Summit Shaper",
      "description": "A symbol of a legendary pact, this sharp blade once cut off the peak of a mountain.",
      "refinement": "Increases Shield Strength by {{0}}%. Scoring hits on opponents increases ATK by {{1}}% for 8s. Max 5 stacks. Can only avvenire once every 0.3s. While protected by a shield, this ATK increase effect is increased by 100%."
    },
    {
      "key": "Apprentice’s Notes",
      "name": "Apprentice’s Notes",
      "description": "Notes left behind by a top student. Many useful spells are listed, and the handwriting is beautiful.",
      "refinement": null
    },
    {
      "key": "Pocket Grimoire",
      "name": "Pocket Grimoire",
      "description": "A carefully compiled notebook featuring the essentials needed to pass a magic exam.",
      "refinement": null
    },
    {
      "key": "Amber Bead",
      "name": "Amber Bead",
      "description": "A catalyst carved out of amber that gains a warm halo under the sun.",
      "refinement": "Normal Attack hits increase all Elemental DMG by {{0}}% for 6s. Max 2 stacks."
    },
    {
      "key": "Emerald Orb",
      "name": "Emerald Orb",
      "description": "A catalyst carved out of the hard jade from Jueyun Karst north of Liyue. It is small, light, and durable.",
      "refinement": "Upon causing a Vaporize, Electro-Charged, Frozen, or a Hydro-infused Swirl reaction, increases ATK by {{0}}% for 12s."
    },
    {
      "key": "Magic Guide",
      "name": "Magic Guide",
      "description": "Version 12. A reprint featuring corrections to Version 11 and brand-new additions based on recent developments.",
      "refinement": "Increases DMG against enemies afflitto by Hydro or Electro by {{0}}%."
    },
    {
      "key": "Otherworldly Story",
      "name": "Otherworldly Story",
      "description": "A cheap fantasy novel with no value whatsoever. Any claim that it possesses the power of catalysis is also pure fantasy.",
      "refinement": "Picking up an Elemental Energia Orb/Particle recovers {{0}}% HP."
    },
    {
      "key": "Thrilling Tales of Dragon Slayers",
      "name": "Thrilling Tales of Dragon Slayers",
      "description": "A fictional story of a band of five heroes who go off on a dragon hunt. It is poorly written and structurally incoherent. Its value lies in the many lessons that can be learned from failure.",
      "refinement": "When switching characters, the new character taking the field has their ATK increased by {{0}}% for 10s. Questo effetto può avvenire solo una volta ogni 20s."
    },
    {
      "key": "Twin Nephrite",
      "name": "Twin Nephrite",
      "description": "A jade pendant formed by piecing together two jade stones.",
      "refinement": "Defeating an enemy increases Movement SPD and ATK by {{0}}% for 15s."
    },
    {
      "key": "Blackcliff Agate",
      "name": "Blackcliff Agate",
      "description": "A mysterious catalyst made of a material known as \"blackcliff.\" It has an ominous crimson glow that seems to pulse in synchronization with the tremors from deep within the earth.",
      "refinement": "After defeating an enemy, ATK is increased by {{0}}% for 30s. This effect has a maximum of 3 stacks, and the duration of each stack is independent of the others."
    },
    {
      "key": "Favonius Codex",
      "name": "Favonius Codex",
      "description": "A secret tome that belonged to the scholars of the Knights of Favonius. It describes the logic and power of elements and matter.",
      "refinement": "CRIT Hits have a {{0}}% chance to generate a small amount of Elemental Particles, which will regenerate 6 Energia for the character. Can only avvenire once every {{1}}s."
    },
    {
      "key": "Mappa Mare",
      "name": "Mappa Mare",
      "description": "A nautical chart featuring nearby currents and climates that somehow found its way into Liyue via foreign traders.",
      "refinement": "Triggering an Elemental reaction conferisce a {{0}}% Elemental DMG Bonus for 10s. Max 2 stacks."
    },
    {
      "key": "Prototype Amber",
      "name": "Prototype Amber",
      "description": "A dully gilded catalyst secretly guarded in the Blackcliff Forge. It seems to glow with the very light from the sky.",
      "refinement": "Using an Elemental Burst Rigenera {{0}} Energia every 2s for 6s. tutti i membri del party will regenerate {{1}}% HP every 2s for this duration."
    },
    {
      "key": "Royal Grimoire",
      "name": "Royal Grimoire",
      "description": "A book that once belonged to a royal mage of Mondstadt. It contains faithful and comprehensive historical accounts as well as magic spells.",
      "refinement": "Upon damaging an opponent, increases CRIT Rate by {{0}}%. Max 5 stacks. A CRIT hit removes all stacks."
    },
    {
      "key": "Sacrificial Fragments",
      "name": "Sacrificial Fragments",
      "description": "A weathered script, the text of which is no longer legible. A cursed item eroded by the winds of time.",
      "refinement": "After damaging an opponent with an Elemental Skill, the skill has a {{0}}% chance to end its own CD. Can only avvenire once every {{1}}s."
    },
    {
      "key": "Solar Pearl",
      "name": "Solar Pearl",
      "description": "A dull, golden pearl made of an unknown substance that harbors the light of the sun and the moon, and pulses with a warm strength.",
      "refinement": "Normal Attack hits increase Elemental Skill and Elemental Burst DMG by {{0}}% for 6s. Likewise, Elemental Skill or Elemental Burst hits increase Normal Attack DMG by {{1}}% for 6s."
    },
    {
      "key": "The Widsith",
      "name": "The Widsith",
      "description": "A heavy notebook filled with musical scores. Though suffering from moth damage and heavy wear-and-tear, there is still much power to be found among the hand-written words within.",
      "refinement": "When the character takes the field, they will gain a random theme song for 10s. This can only avvenire once every 30s. Recitative: ATK is increased by {{0}}%. Aria: Increases all Elemental DMG by {{1}}%. Interlude: Elemental Mastery is increased by {{2}}."
    },
    {
      "key": "Wine and Song",
      "name": "Wine and Song",
      "description": "A songbook from the bygone aristocratic era, whose composer has become forgotten. It chronicles the tale of a certain heroic outlaw.",
      "refinement": "Hitting an opponent with a Normal Attack decreases the Stamina consumption of Sprint or Alternate Sprint by {{0}}% for 5s. Additionally, using a Sprint or Alternate Sprint ability increases ATK by {{1}}% for 5s."
    },
    {
      "key": "Eye of Perception",
      "name": "Eye of Perception",
      "description": "A dim black glaze pearl that is said to have the power to read the purity of one’s heart.",
      "refinement": "Normal and Charged Attacks have a 50% chance to fire a Bolt of Perception, Infliggere {{0}}% ATK as DMG. This bolt can bounce between enemies a maximum of 4 times. This effect can avvenire once every {{1}}s."
    },
    {
      "key": "Frostbearer",
      "name": "Frostbearer",
      "description": "A fruit that possesses a strange, frosty will. A faint sense of agony emanates from it.",
      "refinement": "Hitting an enemy with Normal and Charged Attacks has a {{0}}% chance of forming and dropping an Everfrost Icicle above them, Infliggere {{1}}% AoE ATK DMG. Can only avvenire once every 10s. Enemies afflitto by Cryo are infligget {{2}}% ATK DMG. Can only avvenire once every 10s."
    },
    {
      "key": "Lost Prayer to the Sacred Winds",
      "name": "Lost Prayer to the Sacred Winds",
      "description": "An educational tome written by anonymous early inhabitants who worshiped the wind. It has been blessed by the wind for its faithfulness and influence over the millennia.",
      "refinement": "Increases Movement SPD by 10%. When in battle, gain an {{0}}% Elemental DMG Bonus every 4s. Max 4 stacks. Lasts until the character falls or leaves combat."
    },
    {
      "key": "Skyward Atlas",
      "name": "Skyward Atlas",
      "description": "A cloud atlas symbolizing Dvalin and its former master, the Anemo Archon. It details the winds and clouds of the northern regions and contains the powers of the sky and wind.",
      "refinement": "Increases Elemental DMG Bonus by {{0}}%. Normal Attack hits have a 50% chance to earn the favor of the clouds, which actively seek out nearby enemies to attack for 15s, Infliggere {{1}}% ATK DMG. Can only avvenire once every 30s."
    },
    {
      "key": "Memory of Dust",
      "name": "Memory of Dust",
      "description": "A stone dumbbell containing distant memories. Its endless transformations reveal the power within.",
      "refinement": "Increases Shield Strength by {{0}}%. Scoring hits on opponents increases ATK by {{1}}% for 8s. Max 5 stacks. Can only avvenire once every 0.3s. While protected by a shield, this ATK increase effect is increased by 100%."
    },
    {
      "key": "Waster Greatsword",
      "name": "Waster Greatsword",
      "description": "A sturdy sheet of iron that may be powerful enough to break apart mountains if wielded with enough willpower.",
      "refinement": null
    },
    {
      "key": "Old Merc’s Pal",
      "name": "Old Merc’s Pal",
      "description": "A battle-tested greatsword that has seen better days and worse.",
      "refinement": null
    },
    {
      "key": "Bloodtainted Greatsword",
      "name": "Bloodtainted Greatsword",
      "description": "A steel sword that is said to have been coated with dragon blood, rendering it invulnerable to damage. This effect is not extended to its wielder, however.",
      "refinement": "Increases DMG infligget against enemies afflitto by Pyro or Electro by {{0}}%"
    },
    {
      "key": "Debate Club",
      "name": "Debate Club",
      "description": "A handy club made of fine steel. The most persuasive line of reasoning in any debater’s arsenal.",
      "refinement": "After using an Elemental Skill, Normal or Charged Attacks, on hit, infligge an additional {{0}}% ATK DMG in a small area. Effect lasts 15s. DMG can only avvenire once every 3s."
    },
    {
      "key": "Ferrous Shadow",
      "name": "Ferrous Shadow",
      "description": "A replica of the famed sword of Arundolyn, the Lion of Light. Feel the power of a legendary hero as you hold this sword in your hand! Imagine yourself as the great warrior himself! Note: Daydreaming not recommended in live combat.",
      "refinement": "When HP falls below {{0}}%, increases Charged Attack DMG by {{1}}% and Charged Attacks become harder to interrupt."
    },
    {
      "key": "Quartz",
      "name": "Quartz",
      "description": "A simple but heavy greatsword made of polished black quartz with a golden gilt. It has an air of elegance and dignity about it.",
      "refinement": "Upon causing an Overloaded, Melt, Burning, Vaporize, or a Pyro-infused Swirl reaction, ATK is increased by {{0}}% for 12s."
    },
    {
      "key": "Skyrider Greatsword",
      "name": "Skyrider Greatsword",
      "description": "A reliable steel sword. The legendary Skyrider once tried to ride it as a flying sword... for the second time.",
      "refinement": "On hit, Normal or Charged Attacks increase ATK by {{0}}% for 6s. Max 4 stacks. Can avvenire once every 0.5s."
    },
    {
      "key": "White Iron Greatsword",
      "name": "White Iron Greatsword",
      "description": "A claymore made from white iron. Lightweight without compromising on power. Effective even when wielded by one of average strength, it is extremely deadly in the hands of a physically stronger wielder.",
      "refinement": "Defeating an opponent restores {{0}}% HP."
    },
    {
      "key": "Blackcliff Slasher",
      "name": "Blackcliff Slasher",
      "description": "An extremely sturdy greatsword from the Blackcliff Forge. It has a dark crimson color from the blade to pommel.",
      "refinement": "After defeating an enemy, ATK is increased by {{0}}% for 30s. This effect has a maximum of 3 stacks, and the duration of each stack is independent of the others."
    },
    {
      "key": "Favonius Greatsword",
      "name": "Favonius Greatsword",
      "description": "A heavy ceremonial sword of the Knights of Favonius. It channels elemental power easily and is highly destructive.",
      "refinement": "CRIT Hits have a {{0}}% chance to generate a small amount of Elemental Particles, which will regenerate 6 Energia for the character. Can only avvenire once every {{1}}s."
    },
    {
      "key": "Lithic Blade",
      "name": "Lithic Blade",
      "description": "A greatsword carved and chiseled from the very bedrock of Liyue.",
      "refinement": "For every character in the party who hails from Liyue, the character who equips this weapon gains a {{0}}% ATK increase and a {{1}}% CRIT Rate increase. L'effetto si somma fino a 4 volte."
    },
    {
      "key": "Prototype Archaic",
      "name": "Prototype Archaic",
      "description": "An ancient greatsword discovered in the Blackcliff Forge. It swings with such an immense force that one feels it could cut straight through reality itself.",
      "refinement": "On hit, Normal or Charged Attacks have a 50% chance to infligge an additional {{0}}% ATK DMG to enemies within un piccolo AoE. Can only avvenire once every 15s."
    },
    {
      "key": "Rainslasher",
      "name": "Rainslasher",
      "description": "A fluorescent greatsword with no sharp edge that crushes enemies with brute force and raw power.",
      "refinement": "Increases DMG against enemies afflitto by Hydro or Electro by {{0}}%"
    },
    {
      "key": "Royal Greatsword",
      "name": "Royal Greatsword",
      "description": "An old greatsword that belonged to the erstwhile rulers of Mondstadt. It is made from the finest-quality materials and has stood the test of time. A weapon for use by royals only.",
      "refinement": "Upon damaging an opponent, increases CRIT Rate by {{0}}%. Max 5 stacks. A CRIT hit removes all stacks."
    },
    {
      "key": "Serpent Spine",
      "name": "Serpent Spine",
      "description": "A rare weapon whose origin is the ancient ocean. One can hear the sound of the ageless waves as one swings it.",
      "refinement": "Every 4s a character is on the field, they will infligge {{0}}% more DMG and take {{1}}% more DMG. This effect has a maximum of 5 stacks and will not be reset if the character leaves the field, but will be reduced by 1 stack when the character takes DMG."
    },
    {
      "key": "The Bell",
      "name": "The Bell",
      "description": "A heavy greatsword. A clock is embedded within it, though its internal mechanisms have long been damaged.",
      "refinement": "Taking DMG generates a shield which absorbs DMG up to {{0}}% of Max HP. This shield lasts for 10s or until broken, and can only be triggered once every 45s. While protected by the shield, the character gains {{1}}% increased DMG."
    },
    {
      "key": "Whiteblind",
      "name": "Whiteblind",
      "description": "An exotic sword with one section of the blade left blunt. It made its way into Liyue via the hands of foreign traders. Incredibly powerful in the hands of someone who knows how to use it.",
      "refinement": "On hit, Normal or Charged Attacks increase ATK and DEF by {{0}}% for 6s. Max 4 stacks. Questo effetto può avvenire solo una volta ogni 0.5s."
    },
    {
      "key": "Sacrificial Greatsword",
      "name": "Sacrificial Greatsword",
      "description": "A ceremonial greatsword that has become petrified over time. The trinkets on it are still visible. It conferisce the wielder the power to withstand the winds of time.",
      "refinement": "After damaging an opponent with an Elemental Skill, the skill has a {{0}}% chance to end its own CD. Can only avvenire once every {{1}}s."
    },
    {
      "key": "Snow-Tombed Starsilver",
      "name": "Snow-Tombed Starsilver",
      "description": "An ancient greatsword that was stored between frescoes. Forged from Starsilver, it has the power to cleave through ice and snow.",
      "refinement": "Hitting an enemy with Normal and Charged Attacks has a {{0}}% chance of forming and dropping an Everfrost Icicle above them, Infliggere {{1}}% AoE ATK DMG. Can only avvenire once every 10s. Enemies afflitto by Cryo are infligget {{2}}% ATK DMG. Can only avvenire once every 10s."
    },
    {
      "key": "Skyward Pride",
      "name": "Skyward Pride",
      "description": "A claymore that symbolizes the pride of Dvalin soaring through the skies. When swung, it emits a deep hum as the full force of Dvalin’s command of the sky and the wind is unleashed.",
      "refinement": "Increases all DMG by {{0}}%. After using an Elemental Burst, Normal or Charged Attack, on hit, creates a vacuum blade that does {{1}}% of ATK as DMG to enemies along its path. Lasts for 20s or 8 vacuum blades."
    },
    {
      "key": "Wolf’s Gravestone",
      "name": "Wolf’s Gravestone",
      "description": "A longsword used by the Wolf Knight. Originally just a heavy sheet of iron given to the knight by a blacksmith from the city, it became endowed with legendary power owing to his friendship with the wolves.",
      "refinement": "Increases ATK by {{0}}%. On hit, attacks against enemies with less than 30% HP increase tutti i membri del party’ ATK by {{1}}% for 12s. Can only avvenire once every 30s."
    },
    {
      "key": "The Unforged",
      "name": "The Unforged",
      "description": "Capable of driving away evil spirits and wicked people alike, this edgeless claymore seems to possess divine might.",
      "refinement": "Increases Shield Strength by {{0}}%. Scoring hits on opponents increases ATK by {{1}}% for 8s. Max 5 stacks. Can only avvenire once every 0.3s. While protected by a shield, this ATK increase effect is increased by 100%."
    },
    {
      "key": "Beginner’s Protector",
      "name": "Beginner’s Protector",
      "description": "A polearm as straight as a flag pole. Well suited to most combat situations, it has an imposing presence when swung.",
      "refinement": null
    },
    {
      "key": "Iron Point",
      "name": "Iron Point",
      "description": "Sharp and pointy at one end, it is a balanced weapon that is quite popular among travelers.",
      "refinement": null
    },
    {
      "key": "Black Tassel",
      "name": "Black Tassel",
      "description": "An exceptionally powerful polearm that also offers a simple but elegant solution to the issue of the easily stained white tassel.",
      "refinement": "Increases DMG against slimes by {{0}}%"
    },
    {
      "key": "Halberd",
      "name": "Halberd",
      "description": "A polearm with an axe blade mounted on top that can infligge quite a lot of damage. It’s favored by the Millelith officers.",
      "refinement": "Normal Attacks infligge an additional {{0}}% DMG. Can only avvenire once every 10s."
    },
    {
      "key": "White Tassel",
      "name": "White Tassel",
      "description": "A standard-issue weapon of the Millelith soldiers. It has a sturdy shaft and sharp spearhead. It’s a reliable weapon.",
      "refinement": "Increases Normal Attack DMG by {{0}}%."
    },
    {
      "key": "Blackcliff Pole",
      "name": "Blackcliff Pole",
      "description": "A weapon made of blackcliff and aerosiderite. There is a dark crimson glow on its cold black sheen.",
      "refinement": "After defeating an enemy, ATK is increased by {{0}}% for 30s. This effect has a maximum of 3 stacks, and the duration of each stack is independent of the others."
    },
    {
      "key": "Crescent Pike",
      "name": "Crescent Pike",
      "description": "An exotic weapon with an extremely long blade on the top and a crescent blade at the bottom. It found its way into Liyue through foreign traders. With practice, it can infligge heavy damage.",
      "refinement": "After picking up an Elemental Orb/Particle, Normal and Charged Attacks infligge an additional {{0}}% ATK DMG for 5s."
    },
    {
      "key": "Deathmatch",
      "name": "Deathmatch",
      "description": "A sharp crimson polearm that was once a gladiator’s priceless treasure. Its awl has been stained by the blood of countless beasts and men.",
      "refinement": "If are there at least 2 enemies nearby, ATK is increased by {{0}}% and DEF is increased by {{1}}%. If there are less than 2 enemies nearby, ATK is increased by {{2}}%"
    },
    {
      "key": "Dragon’s Bane",
      "name": "Dragon’s Bane",
      "description": "A polearm decorated with an entwining golden dragon. Light and sharp, this weapon may very well kill dragons with ease.",
      "refinement": "Increases DMG against enemies afflitto by Hydro or Pyro by {{0}}%"
    },
    {
      "key": "Lithic Spear",
      "name": "Lithic Spear",
      "description": "A spear forged from the rocks of the Guyun Stone Forest. Its hardness knows no equal.",
      "refinement": "For every character in the party who hails from Liyue, the character who equips this weapon gains a {{0}}% ATK increase and a {{1}}% CRIT Rate increase. L'effetto si somma fino a 4 volte."
    },
    {
      "key": "Prototype Starglitter",
      "name": "Prototype Starglitter",
      "description": "A grudge discovered in the Blackcliff Forge. The glimmers along the sharp edge are like stars in the night.",
      "refinement": "After using an Elemental Skill, increases Normal and Charged Attack DMG by {{0}}% for 12s. Max 2 stacks."
    },
    {
      "key": "Favonius Lance",
      "name": "Favonius Lance",
      "description": "A polearm made in the style of the Knights of Favonius. Its shaft is straight, and its tip flows lightly like the wind.",
      "refinement": "CRIT Hits have a {{0}}% chance to generate a small amount of Elemental Particles, which will regenerate 6 Energia for the character. Can only avvenire once every {{1}}s."
    },
    {
      "key": "Royal Spear",
      "name": "Royal Spear",
      "description": "This polearm was once cherished by a member of the old nobility that governed Mondstadt long ago. Although it has never seen the light of day, it is still incomparably sharp.",
      "refinement": "Upon damaging an opponent, increases CRIT Rate by {{0}}%. Max 5 stacks. A CRIT hit removes all stacks."
    },
    {
      "key": "Dragonspine Spear",
      "name": "Dragonspine Spear",
      "description": "A spear created from the fang of a dragon. It is oddly warm to the touch.",
      "refinement": "Hitting an enemy with Normal and Charged Attacks has a {{0}}% chance of forming and dropping an Everfrost Icicle above them, Infliggere {{1}}% AoE ATK DMG. Can only avvenire once every 10s. Enemies afflitto by Cryo are infligget {{2}}% ATK DMG. Can only avvenire once every 10s."
    },
    {
      "key": "Vortex Vanquisher",
      "name": "Vortex Vanquisher",
      "description": "This sharp polearm can seemingly pierce through anything. When swung, one can almost see the rift it tears in the air.",
      "refinement": "Increases Shield Strength by {{0}}%. Scoring hits on opponents increases ATK by {{1}}% for 8s. Max 5 stacks. Can only avvenire once every 0.3s. While protected by a shield, this ATK increase effect is increased by 100%."
    },
    {
      "key": "Primordial Jade Winged-Spear",
      "name": "Primordial Jade Winged-Spear",
      "description": "A jade polearm made by the archons, capable of slaying ancient beasts.",
      "refinement": "On hit, increases ATK by {{0}}% for 6s. Max 7 stacks. Questo effetto può avvenire solo una volta ogni 0.3s. While in possession of the maximum possible stacks, DMG infligget is increased by {{1}}%."
    },
    {
      "key": "Skyward Spine",
      "name": "Skyward Spine",
      "description": "A polearm that symbolizes Dvalin’s firm resolve. The upright shaft of this weapon points towards the heavens, clad in the might of sky and wind.",
      "refinement": "Increases CRIT Rate by {{0}}% and increases Normal ATK SPD by 12%. Inoltre, Normal and Charged Attacks hits on enemies have a 50% chance to trigger a vacuum blade che infligges {{1}}% of ATK as DMG in un piccolo AoE. This effect can avvenire no more than once every 2s."
    },
    {
      "key": "Primordial Jade Cutter",
      "name": "Primordial Jade Cutter",
      "description": "A ceremonial sword masterfully carved from pure jade. There almost seems to be an audible sigh in the wind as it is swung.",
      "refinement": "HP increased by {{0}}%. Inoltre, provides an ATK Bonus based on {{1}}% of the wielder's Max HP."
    },
    {
      "key": "Staff of Homa",
      "name": "Staff of Homa",
      "description": "A \"firewood staff\" that was once used in ancient and long-lost rituals.",
      "refinement": "HP increased by {{0}}%. Inoltre, provides an ATK Bonus based on {{1}}% of the wielder's Max HP. When the wielder's HP is less than 50%, this ATK Bonus is increased by an additional {{2}}% of Max HP."
    },
    {
      "key": "Windblume Ode",
      "name": "Windblume Ode",
      "description": "A bow adorned with nameless flowers that bears the earnest hopes of an equally nameless person.",
      "refinement": "After using an Elemental Skill, receive a boon from the ancient wish of the Windblume, increasing ATK by {{0}}% for 6s."
    },
    {
      "key": "Elegy for the End",
      "name": "Elegy for the End",
      "description": "A bow as lovely as any bard's lyre, its arrows pierce the heart like a lamenting sigh.",
      "refinement": "A part of the \"Millennial Movement\" that wanders amidst the winds. Increases Elemental Mastery by {{0}}. When the Elemental Skills or Elemental Bursts of the character wielding this weapon hit opponents, that character gains a Sigil of Remembrance. This effect can be triggered once every 0.2s and can be triggered even if said character is not on the field. When you possess 4 Sigils of Remembrance, all of them will be consumed and all nearby party members will obtain the \"Millennial Movement: Farewell Song\" effect for 12s. \"Millennial Movement: Farewell Song\" increases Elemental Mastery by {{1}} and increases ATK by {{2}}%. Once this effect is triggered, you will not gain Sigils of Remembrance for 20s. Of the many effects of the \"Millennial Movement,\" buffs of the same type will not stack."
    }
  ],
  "artifacts": [
    {
      "key": "Adventurer",
      "name": "Adventurer",
      "bonus": [
        {
          "key": "b1",
          "bonus": "Max HP increased by 1000."
        },
        {
          "key": "b2",
          "bonus": "Opening a chest Rigenera 30% Max HP over 5s."
        }
      ]
    },
    {
      "key": "Traveling Doctor",
      "name": "Traveling Doctor",
      "bonus": [
        {
          "key": "b1",
          "bonus": "Increases incoming healing by 20%."
        },
        {
          "key": "b2",
          "bonus": "Using Elemental Burst restores 20% HP."
        }
      ]
    },
    {
      "key": "Lucky Dog",
      "name": "Lucky Dog",
      "bonus": [
        {
          "key": "b1",
          "bonus": "DEF increased by 100."
        },
        {
          "key": "b2",
          "bonus": "Picking up Mora restores 300 HP."
        }
      ]
    },
    {
      "key": "Resolution of Sojourner",
      "name": "Resolution of Sojourner",
      "bonus": [
        {
          "key": "b1",
          "bonus": "ATK +18%."
        },
        {
          "key": "b2",
          "bonus": "Increases Charged Attack CRIT Rate by 30%."
        }
      ]
    },
    {
      "key": "Tiny Miracle",
      "name": "Tiny Miracle",
      "bonus": [
        {
          "key": "b1",
          "bonus": "All Elemental RES increased by 20%."
        },
        {
          "key": "b2",
          "bonus": "Incoming elemental DMG increases corresponding Elemental RES by 30% for 10s. Can only avvenire once every 10s."
        }
      ]
    },
    {
      "key": "Brave Heart",
      "name": "Brave Heart",
      "bonus": [
        {
          "key": "b1",
          "bonus": "ATK +18%."
        },
        {
          "key": "b2",
          "bonus": "Increases DMG by 30% against enemies with more than 50% HP."
        }
      ]
    },
    {
      "key": "Defender’s Will",
      "name": "Defender’s Will",
      "bonus": [
        {
          "key": "b1",
          "bonus": "DEF +30%."
        },
        {
          "key": "b2",
          "bonus": "For each different element present in your own party, the wearer’s Elemental RES to that corresponding element is increased by 30%."
        }
      ]
    },
    {
      "key": "Martial Artist",
      "name": "Martial Artist",
      "bonus": [
        {
          "key": "b1",
          "bonus": "Increases Normal Attack and Charged Attack DMG by 15%."
        },
        {
          "key": "b2",
          "bonus": "After using Elemental Skill, increases Normal Attack and Charged Attack DMG by 25% for 8s."
        }
      ]
    },
    {
      "key": "Gambler",
      "name": "Gambler",
      "bonus": [
        {
          "key": "b1",
          "bonus": "Increases Elemental Skill DMG by 20%."
        },
        {
          "key": "b2",
          "bonus": "Defeating an enemy has a 100% chance to remove Elemental Skill CD. Can only avvenire once every 15s."
        }
      ]
    },
    {
      "key": "Scholar",
      "name": "Scholar",
      "bonus": [
        {
          "key": "b1",
          "bonus": "Energia Recharge +20%."
        },
        {
          "key": "b2",
          "bonus": "Gaining Elemental Particles or Orbs gives 3 Energia to tutti i membri del party who have a bow or a catalyst equipped. Can only avvenire once every 3s."
        }
      ]
    },
    {
      "key": "Berserker",
      "name": "Berserker",
      "bonus": [
        {
          "key": "b1",
          "bonus": "CRIT Rate +12%."
        },
        {
          "key": "b2",
          "bonus": "When HP is below 70%, CRIT Rate increases by an additional 24%."
        }
      ]
    },
    {
      "key": "Instructor",
      "name": "Instructor",
      "bonus": [
        {
          "key": "b1",
          "bonus": "Increases Elemental Mastery by 80."
        },
        {
          "key": "b2",
          "bonus": "Upon triggering an Elemental Reaction, increases tutti i membri del party’ Elemental Mastery by 120 for 8s."
        }
      ]
    },
    {
      "key": "The Exile",
      "name": "The Exile",
      "bonus": [
        {
          "key": "b1",
          "bonus": "Energia Recharge +20%."
        },
        {
          "key": "b2",
          "bonus": "Using an Elemental Burst Rigenera 2 Energia for tutti i membri del party (excluding the wearer) every 2s for 6s. This effect cannot stack."
        }
      ]
    },
    {
      "key": "Thundering Fury",
      "name": "Thundering Fury",
      "bonus": [
        {
          "key": "b1",
          "bonus": "Electro DMG Bonus +15%."
        },
        {
          "key": "b2",
          "bonus": "Increases damage caused by Overloaded, Electro-Charged and Superconduct by 40%. Triggering such effects decreases Elemental Skill CD by 1s. Can only avvenire once every 0.8s."
        }
      ]
    },
    {
      "key": "Thundersoother",
      "name": "Thundersoother",
      "bonus": [
        {
          "key": "b1",
          "bonus": "Electro RES increased by 40%."
        },
        {
          "key": "b2",
          "bonus": "Increases DMG against enemies afflitto by Electro by 35%."
        }
      ]
    },
    {
      "key": "Viridescent Venerer",
      "name": "Viridescent Venerer",
      "bonus": [
        {
          "key": "b1",
          "bonus": "Anemo DMG Bonus +15%."
        },
        {
          "key": "b2",
          "bonus": "Increases Swirl DMG by 60%. Decreases opponent’s Elemental RES to the element infused in the Swirl by 40% for 10s."
        }
      ]
    },
    {
      "key": "Maiden Beloved",
      "name": "Maiden Beloved",
      "bonus": [
        {
          "key": "b1",
          "bonus": "Character Healing Effectiveness +15%."
        },
        {
          "key": "b2",
          "bonus": "Using an Elemental Skill or Burst increases healing received by tutti i membri del party by 20% for 10s."
        }
      ]
    },
    {
      "key": "Archaic Petra",
      "name": "Archaic Petra",
      "bonus": [
        {
          "key": "b1",
          "bonus": "Gain a 15% Geo DMG Bonus."
        },
        {
          "key": "b2",
          "bonus": "Upon obtaining an Elemental Shard created through a Crystallize Reaction, tutti i membri del party gain a 35% DMG Bonus for that particular element for 10s. Only one form of Elemental DMG Bonus can be gained in this manner at any one time."
        }
      ]
    },
    {
      "key": "Retracing Bolide",
      "name": "Retracing Bolide",
      "bonus": [
        {
          "key": "b1",
          "bonus": "Increases Shield Strength by 35%."
        },
        {
          "key": "b2",
          "bonus": "While protected by a shield, gain an additional 40% Normal and Charged Attack DMG."
        }
      ]
    },
    {
      "key": "Crimson Witch of Flames",
      "name": "Crimson Witch of Flames",
      "bonus": [
        {
          "key": "b1",
          "bonus": "Pyro DMG Bonus +15%."
        },
        {
          "key": "b2",
          "bonus": "Increases Overloaded and Burning DMG by 40%. Increases Vaporize and Melt DMG by 15%. Using an Elemental Skill increases 2-Piece Set effects by 50% for 10s. Max 3 stacks."
        }
      ]
    },
    {
      "key": "Lavawalker",
      "name": "Lavawalker",
      "bonus": [
        {
          "key": "b1",
          "bonus": "Pyro RES increased by 40%."
        },
        {
          "key": "b2",
          "bonus": "Increases DMG against enemies afflitto by Pyro by 35%."
        }
      ]
    },
    {
      "key": "Bloodstained Chivalry",
      "name": "Bloodstained Chivalry",
      "bonus": [
        {
          "key": "b1",
          "bonus": "Physical DMG +25%."
        },
        {
          "key": "b2",
          "bonus": "After defeating an opponent, increases Charged Attack DMG by 50%, and reduces its Stamina cost to 0 for 10s."
        }
      ]
    },
    {
      "key": "Noblesse Oblige",
      "name": "Noblesse Oblige",
      "bonus": [
        {
          "key": "b1",
          "bonus": "Elemental Burst DMG +20%."
        },
        {
          "key": "b2",
          "bonus": "Using an Elemental Burst increases tutti i membri del party’ ATK by 20% for 12s. This effect cannot stack."
        }
      ]
    },
    {
      "key": "Gladiator’s Finale",
      "name": "Gladiator’s Finale",
      "bonus": [
        {
          "key": "b1",
          "bonus": "ATK +18%."
        },
        {
          "key": "b2",
          "bonus": "If the wielder of this artifact set uses a Sword, Claymore or Polearm, increases their Normal Attack DMG by 35%."
        }
      ]
    },
    {
      "key": "Wanderer’s Troupe",
      "name": "Wanderer’s Troupe",
      "bonus": [
        {
          "key": "b1",
          "bonus": "Increases Elemental Mastery by 80."
        },
        {
          "key": "b2",
          "bonus": "Increases Charged Attack DMG by 35% if the character uses a Catalyst or a Bow."
        }
      ]
    },
    {
      "key": "Prayers for Illumination",
      "name": "Prayers for Illumination",
      "bonus": [
        {
          "key": "b1",
          "bonus": "afflitto by Pyro for 40% less time."
        }
      ]
    },
    {
      "key": "Prayers for Destiny",
      "name": "Prayers for Destiny",
      "bonus": [
        {
          "key": "b1",
          "bonus": "afflitto by Hydro for 40% less time."
        }
      ]
    },
    {
      "key": "Prayers for Wisdom",
      "name": "Prayers for Wisdom",
      "bonus": [
        {
          "key": "b1",
          "bonus": "afflitto by Electro for 40% less time."
        }
      ]
    },
    {
      "key": "Prayers to Springtime",
      "name": "Prayers to Springtime",
      "bonus": [
        {
          "key": "b1",
          "bonus": "afflitto by Cryo for 40% less time."
        }
      ]
    },
    {
      "key": "Blizzard Strayer",
      "name": "Blizzard Strayer",
      "bonus": [
        {
          "key": "b1",
          "bonus": "Cryo DMG Bonus +15%."
        },
        {
          "key": "b2",
          "bonus": "When a character attacks an enemy afflitto by Cryo, their CRIT Rate is increased by 20%. If the enemy is Frozen, CRIT Rate is increased by an additional 20%."
        }
      ]
    },
    {
      "key": "Heart of Depth",
      "name": "Heart of Depth",
      "bonus": [
        {
          "key": "b1",
          "bonus": "Hydro DMG Bonus +15%."
        },
        {
          "key": "b2",
          "bonus": "After using Elemental Skill, increases Normal Attack and Charged Attack DMG by 30% for 15s."
        }
      ]
    },
    {
      "key": "Glacier and Snowfield",
      "name": "Glacier and Snowfield",
      "bonus": [
        {
          "key": "b1",
          "bonus": "Cryo DMG Bonus +15%."
        },
        {
          "key": "b2",
          "bonus": "Increases Superconduct DMG by 100%. Increases Melt DMG by 15%. Using an Elemental Burst increases Cryo DMG Bonus by 30% for 10s."
        }
      ]
    },
    {
      "key": "Prayers to the Firmament",
      "name": "Prayers to the Firmament",
      "bonus": [
        {
          "key": "b1",
          "bonus": "afflitto by Anemo for 40% less time."
        }
      ]
    }
  ],
  "materials": [
    {
      "key": "FreedomA",
      "name": "Teachings of Freedom"
    },
    {
      "key": "FreedomB",
      "name": "Guide to Freedom"
    },
    {
      "key": "FreedomC",
      "name": "Philosophies of Freedom"
    },
    {
      "key": "ProsperityA",
      "name": "Teachings of Prosperity"
    },
    {
      "key": "ProsperityB",
      "name": "Guide to Prosperity"
    },
    {
      "key": "ProsperityC",
      "name": "Philosophies of Prosperity"
    },
    {
      "key": "DilligenceA",
      "name": "Teachings of Dilligence"
    },
    {
      "key": "DilligenceB",
      "name": "Guide to Dilligence"
    },
    {
      "key": "DilligenceC",
      "name": "Philosophies of Dilligence"
    },
    {
      "key": "ResistanceA",
      "name": "Teachings of Resistance"
    },
    {
      "key": "ResistanceB",
      "name": "Guide to Resistance"
    },
    {
      "key": "ResistanceC",
      "name": "Philosophies of Resistance"
    },
    {
      "key": "BalladA",
      "name": "Teachings of Ballad"
    },
    {
      "key": "BalladB",
      "name": "Guide to Ballad"
    },
    {
      "key": "BalladC",
      "name": "Philosophies of Ballad"
    },
    {
      "key": "GoldA",
      "name": "Teachings of Gold"
    },
    {
      "key": "GoldB",
      "name": "Guide to Gold"
    },
    {
      "key": "GoldC",
      "name": "Philosophies of Gold"
    },
    {
      "key": "Tail of Boreas",
      "name": "Tail of Boreas",
      "bossName": "Andrius"
    },
    {
      "key": "Ring of Boreas",
      "name": "Ring of Boreas",
      "bossName": "Andrius"
    },
    {
      "key": "Spirit Locket of Boreas",
      "name": "Spirit Locket of Boreas",
      "bossName": "Andrius"
    },
    {
      "key": "Dvalin's Plume",
      "name": "Dvalin's Plume",
      "bossName": "Dvalin"
    },
    {
      "key": "Dvalin's Claw",
      "name": "Dvalin's Claw",
      "bossName": "Dvalin"
    },
    {
      "key": "Dvalin's Sigh",
      "name": "Dvalin's Sigh",
      "bossName": "Dvalin"
    },
    {
      "key": "Tusk of Monoceros Caeli",
      "name": "Tusk of Monoceros Caeli",
      "bossName": "Tartaglia"
    },
    {
      "key": "Shard of a Foul Legacy",
      "name": "Shard of a Foul Legacy",
      "bossName": "Tartaglia"
    },
    {
      "key": "Shadow of the Warrior",
      "name": "Shadow of the Warrior",
      "bossName": "Tartaglia"
    },
    {
      "key": "DecarabianA",
      "name": "Tile of Decarabian’s Tower"
    },
    {
      "key": "DecarabianB",
      "name": "Debris of Decarabian’s City"
    },
    {
      "key": "DecarabianC",
      "name": "Fragment of Decarabian’s Epic"
    },
    {
      "key": "DecarabianD",
      "name": "Scattered Piece of Decarabian’s Dream"
    },
    {
      "key": "GuyunA",
      "name": "Luminous Sands from Guyun"
    },
    {
      "key": "GuyunB",
      "name": "Lustrous Stone from Guyun"
    },
    {
      "key": "GuyunC",
      "name": "Relic from Guyun"
    },
    {
      "key": "GuyunD",
      "name": "Divine Body from Guyun"
    },
    {
      "key": "ElixirA",
      "name": "Mist Veiled Lead Elixir"
    },
    {
      "key": "ElixirB",
      "name": "Mist Veiled Mercury Elixir"
    },
    {
      "key": "ElixirC",
      "name": "Mist Veiled Gold Elixir"
    },
    {
      "key": "ElixirD",
      "name": "Mist Veiled Primo Elixir"
    },
    {
      "key": "BorealWolfA",
      "name": "Boreal Wolf’s Milk Tooth"
    },
    {
      "key": "BorealWolfB",
      "name": "Boreal Wolf’s Cracked Tooth"
    },
    {
      "key": "BorealWolfC",
      "name": "Boreal Wolf’s Broken Fang"
    },
    {
      "key": "BorealWolfD",
      "name": "Boreal Wolf's Nostalgia"
    },
    {
      "key": "AerosideriteA",
      "name": "Grain of Aerosiderite"
    },
    {
      "key": "AerosideriteB",
      "name": "Piece of Aerosiderite"
    },
    {
      "key": "AerosideriteC",
      "name": "Bit of Aerosiderite"
    },
    {
      "key": "AerosideriteD",
      "name": "Chunk of Aerosiderite"
    },
    {
      "key": "GladiatorA",
      "name": "Fetters of the Dandelion Gladiator"
    },
    {
      "key": "GladiatorB",
      "name": "Chains of the Dandelion Gladiator"
    },
    {
      "key": "GladiatorC",
      "name": "Shackles of the Dandelion Gladiator"
    },
    {
      "key": "GladiatorD",
      "name": "Dream of the Dandelion Gladiator"
    },
    {
      "key": "Crown of Insight",
      "name": "Crown of Insight"
    },
    {
      "key": "SacrificialKnifeA",
      "name": "Hunter's Sacrificial Knife"
    },
    {
      "key": "SacrificialKnifeB",
      "name": "Agent's Sacrificial Knife"
    },
    {
      "key": "SacrificialKnifeC",
      "name": "Inspector's Sacrificial Knife"
    },
    {
      "key": "HornA",
      "name": "Heavy Horn"
    },
    {
      "key": "HornB",
      "name": "Black Bronze Horn"
    },
    {
      "key": "HornC",
      "name": "Black Crystal Horn"
    },
    {
      "key": "ChaosA",
      "name": "Chaos Device"
    },
    {
      "key": "ChaosB",
      "name": "Chaos Circuit"
    },
    {
      "key": "ChaosC",
      "name": "Chaos Core"
    },
    {
      "key": "LeyLineA",
      "name": "Dead Ley Line Branch"
    },
    {
      "key": "LeyLineB",
      "name": "Dead Ley Line Leaves"
    },
    {
      "key": "LeyLineC",
      "name": "Ley Line Sprout"
    },
    {
      "key": "MistGrassA",
      "name": "Mist Grass Pollen"
    },
    {
      "key": "MistGrassB",
      "name": "Mist Grass"
    },
    {
      "key": "MistGrassC",
      "name": "Mist Grass Wick"
    },
    {
      "key": "BoneShardA",
      "name": "Fragile Bone Shard"
    },
    {
      "key": "BoneShardB",
      "name": "Sturdy Bone Shard"
    },
    {
      "key": "BoneShardC",
      "name": "Fossilized Bone Shard"
    },
    {
      "key": "MaskA",
      "name": "Damaged Mask"
    },
    {
      "key": "MaskB",
      "name": "Stained Mask"
    },
    {
      "key": "MaskC",
      "name": "Ominous Mask"
    },
    {
      "key": "StatuetteA",
      "name": "Gloomy Statuette"
    },
    {
      "key": "StatuetteB",
      "name": "Dark Statuette"
    },
    {
      "key": "StatuetteC",
      "name": "Deathly Statuette"
    },
    {
      "key": "ScrollA",
      "name": "Divining Scroll"
    },
    {
      "key": "ScrollB",
      "name": "Sealed Scroll"
    },
    {
      "key": "ScrollC",
      "name": "Forbidden Curse Scroll"
    },
    {
      "key": "NectarA",
      "name": "Whopperflower Nectar"
    },
    {
      "key": "NectarB",
      "name": "Shimmering Nectar"
    },
    {
      "key": "NectarC",
      "name": "Energia Nectar"
    },
    {
      "key": "ArrowHeadA",
      "name": "Firm Arrowhead"
    },
    {
      "key": "ArrowHeadB",
      "name": "Sharp Arrowhead"
    },
    {
      "key": "ArrowHeadC",
      "name": "Weathered Arrowhead"
    },
    {
      "key": "CircularInsigniaA",
      "name": "Treasure Hoarder Insignia"
    },
    {
      "key": "CircularInsigniaB",
      "name": "Silver Raven Insignia"
    },
    {
      "key": "CircularInsigniaC",
      "name": "Golden Raven Insignia"
    },
    {
      "key": "InsigniaA",
      "name": "Recruit's Insignia"
    },
    {
      "key": "InsigniaB",
      "name": "Sergeant's Insignia"
    },
    {
      "key": "InsigniaC",
      "name": "Lieutenant's Insignia"
    },
    {
      "key": "SlimeA",
      "name": "Slime Condensate"
    },
    {
      "key": "SlimeB",
      "name": "Slime Secretions"
    },
    {
      "key": "SlimeC",
      "name": "Slime Concentrate"
    },
    {
      "key": "Mora",
      "name": "Mora"
    },
    {
      "key": "BasaltPillar",
      "name": "Basalt Pillar"
    },
    {
      "key": "CleansingHeart",
      "name": "Cleansing Heart"
    },
    {
      "key": "EverflameSeed",
      "name": "Everflame Seed"
    },
    {
      "key": "HoarfrostCore",
      "name": "Hoarfrost Core"
    },
    {
      "key": "HurricaneSeed",
      "name": "Hurricane Seed"
    },
    {
      "key": "LightningPrism",
      "name": "Lightning Prism"
    },
    {
      "key": "AgateA",
      "name": "Agnidus Agate Sliver"
    },
    {
      "key": "AgateB",
      "name": "Agnidus Agate Fragment"
    },
    {
      "key": "AgateC",
      "name": "Agnidus Agate Chunk"
    },
    {
      "key": "AgateD",
      "name": "Agnidus Agate Gemstone"
    },
    {
      "key": "DiamondA",
      "name": "Brilliant Diamond Sliver"
    },
    {
      "key": "DiamondB",
      "name": "Brilliant Diamond Fragment"
    },
    {
      "key": "DiamondC",
      "name": "Brilliant Diamond Chunk"
    },
    {
      "key": "DiamondD",
      "name": "Brilliant Diamond Gemstone"
    },
    {
      "key": "EmeraldA",
      "name": "Nagadus Emerald Sliver"
    },
    {
      "key": "EmeraldB",
      "name": "Nagadus Emerald Fragment"
    },
    {
      "key": "EmeraldC",
      "name": "Nagadus Emerald Chunk"
    },
    {
      "key": "EmeraldD",
      "name": "Nagadus Emerald Gemstone"
    },
    {
      "key": "TopazA",
      "name": "Prithiva Topaz Sliver"
    },
    {
      "key": "TopazB",
      "name": "Prithiva Topaz Fragment"
    },
    {
      "key": "TopazC",
      "name": "Prithiva Topaz Chunk"
    },
    {
      "key": "TopazD",
      "name": "Prithiva Topaz Gemstone"
    },
    {
      "key": "JadeA",
      "name": "Shivada Jade Sliver"
    },
    {
      "key": "JadeB",
      "name": "Shivada Jade Fragment"
    },
    {
      "key": "JadeC",
      "name": "Shivada Jade Chunk"
    },
    {
      "key": "JadeD",
      "name": "Shivada Jade Gemstone"
    },
    {
      "key": "AmethystA",
      "name": "Vajrada Amethyst Sliver"
    },
    {
      "key": "AmethystB",
      "name": "Vajrada Amethyst Fragment"
    },
    {
      "key": "AmethystC",
      "name": "Vajrada Amethyst Chunk"
    },
    {
      "key": "AmethystD",
      "name": "Vajrada Amethyst Gemstone"
    },
    {
      "key": "LazuriteA",
      "name": "Varunada Lazurite Sliver"
    },
    {
      "key": "LazuriteB",
      "name": "Varunada Lazurite Fragment"
    },
    {
      "key": "LazuriteC",
      "name": "Varunada Lazurite Chunk"
    },
    {
      "key": "LazuriteD",
      "name": "Varunada Lazurite Gemstone"
    },
    {
      "key": "TurquoiseA",
      "name": "Vayuda Turquoise Sliver"
    },
    {
      "key": "TurquoiseB",
      "name": "Vayuda Turquoise Fragment"
    },
    {
      "key": "TurquoiseC",
      "name": "Vayuda Turquoise Chunk"
    },
    {
      "key": "TurquoiseD",
      "name": "Vayuda Turquoise Gemstone"
    },
    {
      "key": "CallaLily",
      "name": "Calla Lily"
    },
    {
      "key": "Cecilia",
      "name": "Cecilia"
    },
    {
      "key": "CorLapis",
      "name": "Cor Lapis"
    },
    {
      "key": "DandelionSeed",
      "name": "Dandelion Seed"
    },
    {
      "key": "GlazeLily",
      "name": "Glaze Lily"
    },
    {
      "key": "JueyunChili",
      "name": "Jueyun Chili"
    },
    {
      "key": "NoctilousJade",
      "name": "Noctilucous Jade"
    },
    {
      "key": "PhilanemoMushroom",
      "name": "Philanemo Mushroom"
    },
    {
      "key": "Qingxin",
      "name": "Qingxin"
    },
    {
      "key": "SilkFlower",
      "name": "Silk Flower"
    },
    {
      "key": "SmallLampGrass",
      "name": "Small Lamp Grass"
    },
    {
      "key": "Starconch",
      "name": "Starconch"
    },
    {
      "key": "Valberry",
      "name": "Valberry"
    },
    {
      "key": "Violetgrass",
      "name": "Violetgrass"
    },
    {
      "key": "WindwheelAster",
      "name": "Windwheel Aster"
    },
    {
      "key": "Wolfhook",
      "name": "Wolfhook"
    },
    {
      "key": "EnhancementOreA",
      "name": "Enhancement Ore"
    },
    {
      "key": "EnhancementOreB",
      "name": "Fine Enhancement Ore"
    },
    {
      "key": "EnhancementOreC",
      "name": "Mystic Enhancement Ore"
    },
    {
      "key": "CharExpA",
      "name": "Wanderer's Advice"
    },
    {
      "key": "CharExpB",
      "name": "Adventurer's Experience"
    },
    {
      "key": "CharExpC",
      "name": "Hero's Wit"
    }
  ],
  "debuffs": [
    {
      "key": "Engulfing Storm",
      "name": "Engulfing Storm",
      "effect": "Continuously drains Energia Recharge."
    },
    {
      "key": "Slowing Water",
      "name": "Slowing Water",
      "effect": "Increases skill CD durations."
    },
    {
      "key": "Smoldering Flames",
      "name": "Smoldering Flames",
      "effect": "Continuously inflicts damage over time."
    },
    {
      "key": "Condensed Ice",
      "name": "Condensed Ice",
      "effect": "Increases consumo di Stamina."
    }
  ],
  "reactions": [
    {
      "key": "Burning",
      "name": "Burning",
      "effect": "infligges Pyro DMG over time."
    },
    {
      "key": "Crystalize",
      "name": "Crystalize",
      "effect": "Creates a crystal that will provide a shield when picked up."
    },
    {
      "key": "Electro-Charged",
      "name": "Electro-Charged",
      "effect": "infligges Electro DMG over time."
    },
    {
      "key": "Frozen",
      "name": "Frozen",
      "effect": "Freezes the target."
    },
    {
      "key": "Melt",
      "name": "Melt",
      "effect": "infligges extra damage."
    },
    {
      "key": "Overloaded",
      "name": "Overloaded",
      "effect": "infligges AoE Pyro DMG."
    },
    {
      "key": "Superconduct",
      "name": "Superconduct",
      "effect": "infligges AoE Cryo DMG and reduces the target's Physical RES by 50%."
    },
    {
      "key": "Swirl",
      "name": "Swirl",
      "effect": "infligges extra elemental damage and spreads the effect."
    },
    {
      "key": "Vaporize",
      "name": "Vaporize",
      "effect": "infligges extra damage."
    }
  ],
  "resonance": [
    {
      "key": "Enduring Rock",
      "name": "Enduring Rock",
      "effect": "Increases shield strength by 15%. Aditionally, characters protected by a shield will have the following special characterists: DMG infligget increased by 15%, Infliggere DMG to enemeies will decrease their Geo RES by 20% for 15s."
    },
    {
      "key": "Fervent Flames",
      "name": "Fervent Flames",
      "effect": "afflitto by Cryo for 40% less time. Increases ATK by 25%."
    },
    {
      "key": "Soothing Waters",
      "name": "Soothing Waters",
      "effect": "afflitto by Pyro for 40% less time. Increases incoming healing by 30%."
    },
    {
      "key": "Impetuous Winds",
      "name": "Impetuous Winds",
      "effect": "Decreases consumo di Stamina by 15%. Increases Movement SPD by 10%. Shortens Skill CD by 5%."
    },
    {
      "key": "High Voltage",
      "name": "High Voltage",
      "effect": "afflitto by Hydro for 40% less time. Superconduct, Overloaded, and Electro-Charged have a 100% chance to generate an Electro Elemental Particle (CD: 5s)."
    },
    {
      "key": "Shattering Ice",
      "name": "Shattering Ice",
      "effect": "afflitto by Electro for 40% less time. Increases CRIT Rate against enemies that are Frozen or afflitto by Cryo by 15%."
    },
    {
      "key": "Protective Canopy",
      "name": "Protective Canopy",
      "effect": "All Elemental RES by 15%. Physical RES + 15%",
      "description": "Any 4 Unique Elements"
    }
  ]
}