{
  "characters": [
    {
      "key": "Albedo",
      "name": "Albedo",
      "description": "Um gênio conhecido como Príncipe do Giz, ele é o chefe Alquimista e capitão da equipe de investigação dos cavaleiros de favonius.",
      "skills": [
        {
          "key": "s1",
          "title": "Técnica da Espada de Favonius: Branco",
          "description": null,
          "abilities": [
            {
              "key": "a1",
              "description": "Realiza até 5 golpes Rápidos.",
              "descriptions": []
            },
            {
              "key": "a2",
              "description": "Consome uma certa quantidade de stamina para desferir 2 golpes rápidos com a espada.",
              "descriptions": []
            },
            {
              "key": "a3",
              "description": "Mergulha em pleno ar para golpear o chão, causando dano aos inimigos ao longo do caminho e infligindo Dano em uma AdE durante impacto.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s2",
          "title": "Abiogenesis: Radiação Solar",
          "description": null,
          "abilities": [
            {
              "name": "Radiação Solar",
              "description": "A criação da radiação solar causa Dano Geo em uma AdE.",
              "descriptions": [
                "Quando inimigos dentro da área da Radiação Solar são atingidos, a Radiação Solar gerará Flores Transitórias que causam Dano Geo em uma AdE. Dano causado escala conforme a DEF de Albedo.",
                "Flores Transitórias só podem ser gerada uma vez a cada 2s.",
                "Quando um personagem está localizado no local da Radiação Solar, a Radiação Solar irá acumular o poder Geo. Erguendo os em um pódio cristalizado. Apenas um pódio cristalizado pode existir por vez.",
                "E é considerada como uma construção Geo."
              ]
            },
            {
              "key": "a2",
              "description": "Manter pressionado para designar a localização da habilidade.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s3",
          "title": "Ritual da Progenitura: Maré Tectônica",
          "description": "Sob o comando de Albedo, os cristais de Geo surgem e explode, causando Dano Geo em uma AdE na frente dele.\nSe houver Radiação Solar no campo criado pelo próprio Albedo, 7 Flores Fatais serão geradas na zona da Radiação Solar, florescendo violentamente e causando Dano Geo em uma AdE.\nO dano causado pela explosão e da Flor Fatal não gerará Flores Transitórias.",
          "abilities": []
        }
      ],
      "passives": [
        {
          "key": "p1",
          "title": "Gênio Despertado",
          "description": "Quando Albedo fabrica Materiais de Ascensão de Armas, ele tem 10% de chance de receber o dobro do produto.",
          "descriptions": []
        },
        {
          "key": "p2",
          "title": "Pressão Calcária",
          "description": "Flores transitórias geradas por Abiogênese: Radiação causam mais de 25% de Dano aos inimigos cuja Vida esteja abaixo de 50%.",
          "descriptions": []
        },
        {
          "key": "p3",
          "title": "Sabedoria em Uma Garrafa",
          "description": "Ritual da Progenitura: Maré Tectônica aumenta a proficiência Elemental dos membros próximos do grupo em 125 por 10s.",
          "descriptions": []
        }
      ],
      "constellations": [
        {
          "key": "c1",
          "title": "Flor de Éden",
          "description": "Flores transitórias geradas pela Abiogênese: Radiação Solar regeneram 1,2 Energia, para Albedo..",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c2",
          "title": "Éon da Vida",
          "description": "Flores Transitórias geradas pela Abiogênese: Radiação Solar concedem ao albedo julgamento Fatal por 30s:",
          "secondDescription": "Ritual da Progenitura: Maré Tectônica: Consome todos os acúmulos do julgamento fatal, Cada acúmulo do julgamento Fatal consumido aumenta o dano causado pelas flores fatais.",
          "descriptions": [
            "e o dano de explosão do ritual da progenitura: maré tectônica em 30% da defesa de albedo.",
            "Este efeito pode ser acumulado até 4x."
          ]
        },
        {
          "key": "c3",
          "title": "Esplendor Solar",
          "description": "Aumenta o nível da Abiogênese: Radiação Solar em 3. O nivel máximo de elevação é 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c4",
          "title": "Queda Divina",
          "description": "Radiação Solar aumenta em 30% o Dano do Ataque Imersivo para os membros ativos do grupo dentro de uma AdE.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c5",
          "title": "Maré de Hadeano",
          "description": "Aumenta o Nivel do Ritual da Progenitura: Maré Tectônica em 3. O nivel máximo de aprimoramento é 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c6",
          "title": "Reino da Purificação",
          "description": "Se os membros ativos da equipe dentro de uma AdE estão protegidos por um escudo criado pela Cristalização, a Radiação Solar aumenta seu Dano em 17%.",
          "secondDescription": null,
          "descriptions": []
        }
      ]
    },
    {
      "key": "Amber",
      "name": "Amber",
      "description": "Sempre energética e cheia de vida. A Amber é a melhor, mas também a última aventureira dos cavaleiros de favonius.",
      "skills": [
        {
          "key": "s1",
          "title": "Pontaria",
          "description": null,
          "abilities": [
            {
              "key": "a1",
              "description": "Realiza até 5 tiros consecutivos com um arco.",
              "descriptions": []
            },
            {
              "key": "a2",
              "description": "Dispara um tiro com mira mais preciso e com dano aumentado. Ao mirar, chamas irão se acumular na ponta da flecha. Uma flecha em chamas completamente carregada inflinge Dano Pyro (fogo).",
              "descriptions": []
            },
            {
              "key": "a3",
              "description": "Dispara uma chuva de flechas em pleno ar antes de atingir o chão inflingindo Dano em uma AdE durante o impacto.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s2",
          "title": "Marionete Explosiva",
          "description": null,
          "abilities": [
            {
              "name": "Barão Coelho",
              "description": null,
              "descriptions": [
                "Continuamente provoca o inimigo atraindo seus golpes.",
                "A vida do barão coelho aumenta com a Vida máxima de Amber.",
                "Quando destruído ou quando o tempo expirar, Barão coelho explode inflingindo Dano Pyro em uma AdE."
              ]
            },
            {
              "key": "a2",
              "description": "Ajusta a direção do lançamento do Barão Coelho. Quanto mais tempo o botão for pressionado mais distante é o lançamento.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s3",
          "title": "Chuva Ardente",
          "description": "Dispara uma chuva de flechas, Causando Dano AdE de pyro (fogo).",
          "abilities": []
        }
      ],
      "passives": [
        {
          "key": "p1",
          "title": "Campeã Voadora",
          "description": "Diminui o consumo de Stamina ao Planar de todos os seus personagens em 20%. Não acumulável com Talentos Passivos que concedem exatamente os mesmos efeitos.",
          "descriptions": []
        },
        {
          "key": "p2",
          "title": "Ninguém consegue fugir do meu campo de visão!",
          "description": "Aumenta a taxa crítica da Chuva Ardente em 1-% e expande a AdE em 30%",
          "descriptions": []
        },
        {
          "key": "p3",
          "title": "Disparo Preciso",
          "description": "Disparos com a mira em pontos fracos aumentam o ataque em 15% por 10s.",
          "descriptions": []
        }
      ],
      "constellations": [
        {
          "key": "c1",
          "title": "Uma Flecha para Dominá-los todos ",
          "description": "Dispara 2 flechas a cada Disparo com Mira. A segunda flecha causa 20% do Dano da primeira flecha.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c2",
          "title": "Coelho Ativado",
          "description": "Barão coelho, novo e melhorado! Atingir o pé do Barão Coelho com um tiro carregado irá manualmente detona-lo. Explosões feitas de maneira manual causam 200% de Dano adicional.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c3",
          "title": "Isso, Queima!",
          "description": "Aumenta o nível da Chuva Ardente em 3. O nível máximo de elevação é 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c4",
          "title": "Não é uma Boneca qualquer...",
          "description": "Diminui o tempo de recarga da Marionete Explosiva em 20% e adiciona 1 carga adicional.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c5",
          "title": "è o Barão Coelho!",
          "description": "Aumenta o nível da Marionete Explosiva em 3. O nível máximo e elevação é  15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c6",
          "title": "Fogo Vivo",
          "description": "A Chuva Ardente aumenta a velocidade de movimento da equipe toda em 15% e o ataque em 15% por 10s.",
          "secondDescription": null,
          "descriptions": []
        }
      ]
    },
    {
      "key": "Ayaka",
      "pending": true,
      "name": "Ayaka",
      "description": "The secretary at Yuehai Pavilion. The blood of the qilin, an illuminated beast, flows within her veins.",
      "skills": [],
      "passives": [],
      "constellations": []
    },
    {
      "key": "Barbara",
      "name": "Barbara",
      "description": "Todos os habitantes de Mondstadt adoram a Barbara. Contudo, ela viu a palavra \"ídolo\", pela primeira vez em uma revista.",
      "skills": [
        {
          "key": "s1",
          "title": "Suspiro da Água",
          "description": null,
          "abilities": [
            {
              "key": "a1",
              "description": "Realiza até 4 ataques com esguichos de água que infligem Dano Hydro.",
              "descriptions": []
            },
            {
              "key": "a2",
              "description": "Consome uma certa quantidade de Stamina para infligir Dano Hydro em uma AdE após um curto período de canalização.",
              "descriptions": []
            },
            {
              "key": "a3",
              "description": "Reunindo o poder do Hydro, Bárbara mergulha em direção ao chão em pleno ar, infligindo dano a todos os inimigos em seu caminho. Inflige Dano Hydro em uma AdE durante o impacto com o chão.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s2",
          "title": "Que Comece o Espetáculo",
          "description": "Invoca gotículas de água que se assemelham a notas musicais que formam um Círculo Melódico, causando Dano Hydro aos oponentes próximos e aplicando o estado Molhado a eles.",
          "abilities": [
            {
              "name": "Círculo Melódico",
              "description": null,
              "descriptions": [
                "Ao acertar, os ataques normais da Barbara curam seus próprios membros de equipe e personagens aliados próximos em uma certa quantidade de Vida, que é escalonado com a Vida Máxima de Bárbara.",
                "Acertar o Ataque Carregado de Bárbara gera 4 vezes a quantidade de cura.",
                "Periodicamente regenera a Vida do seu próprio personagem ativo.",
                "Aplica o estado Molhado ao personagem e aos oponentes que entram em contato com eles."
              ]
            }
          ]
        },
        {
          "key": "s3",
          "title": "Milagre Brilhante",
          "description": "Cura todas as forças aliadas e seu próprio personagem em uma grande quantidade de Vida que aumenta com a Vida Máxima de Bárbara.",
          "abilities": []
        }
      ],
      "passives": [
        {
          "key": "p1",
          "title": "Com Todo o Meu Coração",
          "description": "Quando uma Culinária Perfeita é feita em uma comida com efeito de recuperação, tem uma chance de 12% de receber o dobro de produção.",
          "descriptions": []
        },
        {
          "key": "p2",
          "title": "Temporada Gloriosa",
          "description": "O Consumo de Stamina dos personagens dentro do loop da melodia de Que Comece o Espetáculo é reduzido em 12%.",
          "descriptions": []
        },
        {
          "key": "p3",
          "title": "Encore",
          "description": "Quando seu próprio personagem ganha um Orbe/Partícula Elemental, a duração do Loop da Melodia do Que Comece o Espetáculo é estendido em 1s. A extensão máxima é de 5s.",
          "descriptions": []
        }
      ],
      "constellations": [
        {
          "key": "c1",
          "title": "Balada Alegre",
          "description": "Barbara regenera 1 de Energía a cada 10s.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c2",
          "title": "Explosão de Vitalidade",
          "description": "Diminui a Recarga do Que Comece o Espetáculo em 15%. Durante esta habilidade, o seu próprio personagem atual ganha 15% de Dano Hydro adicional.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c3",
          "title": "Estrela de Amanhã",
          "description": "Aumenta o nível do Milagre Brilhante em 3. O nível máximo de elevação é 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c4",
          "title": "A Atenção é o Meu Poder",
          "description": "Sempre que os Ataques Carregados da Bárbara acertarem um inimigo ela regenera 1 de Energia. É possível regenerar um máximo de 5 de Energia desta maneira por vez.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c5",
          "title": "Vínculo de Inocência",
          "description": "Aumenta o nível do Que Comece o Espetáculo em 3. O nivel máximo de elevação ė 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c6",
          "title": "Dedicando Tudo para Você",
          "description": "Quando a Bárbara não estiver no campo de batalha e o próprio personagem da equipe for abatido::",
          "secondDescription": "Este efeito pode ser ativado uma vez a cada 15 mins.",
          "descriptions": [
            "Revive automaticamente este personagem.",
            "Regenera totalmente a Vida deste personagem até 100%."
          ]
        }
      ]
    },
    {
      "key": "Beidou",
      "name": "Beidou",
      "description": "Lider da frota armada Crux — uma frota armada baseada no porto de Liyue. Uma frota armada significa exatamente o que parece: uma frota de navios armados até os dentes.",
      "skills": [
        {
          "key": "s1",
          "title": "Suporte do Oceano",
          "description": null,
          "abilities": [
            {
              "key": "a1",
              "description": "Realiza até 5 golpes consecutivos.",
              "descriptions": []
            },
            {
              "key": "a2",
              "description": "Drena Stamina ao longo do tempo para realizar cortes contínuos. Ao final da sequência, realiza um corte ainda mais poderoso.",
              "descriptions": []
            },
            {
              "key": "a3",
              "description": "Mergulha em pleno ar para golpear o chão, danificando inimigos em seu caminho e infligindo dano em uma AdE durante o impacto.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s2",
          "title": "Invocador da Maré",
          "description": "Nada com que se deva preocupar. Se alguém levantar uma mão contra ela ou contra os seus homens, ela se vingará dez vezes mais com espada e trovão.",
          "abilities": [
            {
              "key": "a1",
              "description": "Acumulando o poder dos raios, Beidou balança sua lâmina para frente ferozmente, causando Dano Electro.",
              "descriptions": []
            },
            {
              "key": "a2",
              "description": "Levanta sua arma como um escudo. Dano Máximo absorvido aumenta conforme a Vida Máxima de Beidou. Ataca usando a energia armazenada no Espadão ao soltar ou quando a duração da habilidade expira, causando Dano Electro. Dano causado aumenta como número de vezes em que Beidou é atacada ao longo da duração da habilidade. O maior Bônus de Dano será atingido quando esse efeito for desencadeado duas vezes. O escudo possui as seguintes propriedades:",
              "descriptions": [
                "Tem 250% de eficiência em absorção de Dano Electro.",
                "Aplica o Elemento Electro para a Beidou ao ativar."
              ]
            }
          ]
        },
        {
          "key": "s3",
          "title": "Quebrador de Tempestades",
          "description": "Relembrando seu abate da grande fera Haishan, Beidou clama pela força monstruosa e relâmpagos para criar um Escudo do Trovão ao seu redor, infligindo Dano Electro aos inimigos próximos.",
          "abilities": [
            {
              "name": "Escudo do Trovão",
              "description": null,
              "descriptions": [
                "Quando Ataques Normais e Carregados atingem, eles criam uma descarga elétrica que pode saltar entre os inimigos, infligindo Dano Electro.",
                "Aumenta a resistência do personagem a interrupções e diminui o Dano Recebido.",
                "No máximo 1 descarga de relâmpago pode ser desencadeada por segundo."
              ]
            }
          ]
        }
      ],
      "passives": [
        {
          "key": "p1",
          "title": "Conquistador das Mares",
          "description": "Diminui o consumo de Stamina ao Nadar de todos os seus personagens em 20%.",
          "descriptions": []
        },
        {
          "key": "p2",
          "title": "Retribuição",
          "description": "Ao atacar com Invocador da Maré no exato momento em que o personagem é atingido, concede o bônus de Dano máximo.",
          "descriptions": []
        },
        {
          "key": "p3",
          "title": "Tempestade Elétrica",
          "description": "Obtém os seguintes efeitos por 10s após lançar o Invocador da Maré com seu bônus máximo de Dano:",
          "descriptions": [
            "O Dano causado pelos Ataques Normais e Carregados aumentam em 15%. A VEL de Ataque dos Ataques Normais ou Carregados são aumentados em 15%.",
            "Reduz grandemente o delay antes de lançar Ataques Carregados."
          ]
        }
      ],
      "constellations": [
        {
          "key": "c1",
          "title": "Flagelo da Fera do Mar",
          "description": "Quando o Quebrador de Tempestades é usado:",
          "secondDescription": null,
          "descriptions": [
            "Cria um escudo que absorve até 16% de Dano baseado na Vida Máxima de Beidou por 15 segundos.",
            "Esse escudo absorve 250% do Dano Electro mais eficientemente."
          ]
        },
        {
          "key": "c2",
          "title": "Sobre o Mar Turbulento, o Trovão Surge",
          "description": "O Arco Relâmpago do Quebrador de Tempestades pode rebater em 2 alvos adicionais.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c3",
          "title": "Invocador da Tempestade",
          "description": "Aumenta o nível do Invocador da Maré em 3. O nível máximo de elevação é 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c4",
          "title": "Vingança Impressionante",
          "description": "Após 10s depois de receber Dano, os Ataques Normais de Beidou ganham 20% de Dano Electro adicional.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c5",
          "title": "Caminhante da Maré Carmesim",
          "description": "Aumenta o nível do Quebrador de Tempestades em 3. O nível máximo de elevação é 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c6",
          "title": "Destruição do Mal",
          "description": "Ao longo da duração do Quebrador de Tempestades, a RES Electro dos inimigos próximos é diminuída em 15%.",
          "secondDescription": null,
          "descriptions": []
        }
      ]
    },
    {
      "key": "Bennett",
      "name": "Bennett",
      "description": "Um aventureiro de Mondstadt justo e bondoso, mas muito azarado.",
      "skills": [
        {
          "key": "s1",
          "title": "Espada da Sorte",
          "description": null,
          "abilities": [
            {
              "key": "a1",
              "description": "Realiza até 5 golpes rápidos .",
              "descriptions": []
            },
            {
              "key": "a2",
              "description": "Consome uma certa quantidade de Stamina para desferir 2 golpes rápidos com a espada.",
              "descriptions": []
            },
            {
              "key": "a3",
              "description": "Mergulha em pleno ar para golpear o chão, causando dano aos inimigos ao longo do caminho e inflingindo Dano em uma AdE durante o impacto.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s2",
          "title": "Sobrecarga de Paixão",
          "description": "Bennett coloca todo seu fogo e sua paixão por aventura em sua espada. Os resultados podem variar baseados no quão fervente ele está....",
          "abilities": [
            {
              "key": "a1",
              "description": "Um único e rápido ataque de chamas que causa Dano Pyro (fogo).",
              "descriptions": []
            },
            {
              "key": "a2",
              "description": "Sobrecarrega, resultando em diferentes efeitos quando liberado baseado no nivel de Carga.",
              "secondDescription": "Bennett não leva nenhum dano ao ser lançado.",
              "descriptions": [
                "Level 1: Ataca duas vezes, causando Dano Pyro e lançando inimigos.",
                "Level 2: Desfere 3 ataques consecutivos que causam um incrível Dano pyro, mas o último ataque desencadeia uma explosão que lança bennett e seu inimigo."
              ]
            }
          ]
        },
        {
          "key": "s3",
          "title": "Viagem Fantástica",
          "description": "Bennett pula, causando Dano Pyro e cria um Campo de Inspiração.",
          "abilities": [
            {
              "name": "Campo de inspiração",
              "description": null,
              "descriptions": [
                "Se a vida dos personagens dentro da AdE for igual ou cair para menos de 70%, regenerará Vida continuamente. A regeneração de Vida se baseia na vida máxima de bennett.",
                "Se a vida dos personagens dentro da AdE for maior que 70%, receberão um dano adicional proporcional ao ataque básico de Bennett.",
                "Aplica-se aos personagens dentro da AdE Elemento Pyro."
              ]
            }
          ]
        }
      ],
      "passives": [
        {
          "key": "p1",
          "title": "Deve ser seguro...",
          "description": "Quando despachado em uma expedição em Mondstadt, o tempo consumido é reduzido em  25%.",
          "descriptions": []
        },
        {
          "key": "p2",
          "title": "Ressurgimento da paixão",
          "description": "Diminui o tempo de recarga da Sobrecarga da paixão em 20%.",
          "descriptions": []
        },
        {
          "key": "p3",
          "title": "Fervor Intrépido",
          "description": "Dentro da área criada pela Viagem Fantástica, a Sobrecarga da Paixão recebe os seguinte efeitos:",
          "descriptions": [
            "A recarga é reduzida em 50%.",
            "Bennett não será lançado pelos efeitos da Carga nível 2."
          ]
        }
      ],
      "constellations": [
        {
          "key": "c1",
          "title": "Grande expectativa",
          "description": "O aumento do ataque da Viagem Fantástica não possui mais restrição de vida, e aumenta numericamente 20% do ataque básico de Bennett.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c2",
          "title": "Escape da Desolação",
          "description": "Quando a vida de Bennett cair abaixo de 70%, a recarga da sua energia é aumentada em 30%.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c3",
          "title": "Paixão Ardente",
          "description": "Aumenta o nível da Sobrecarga da Paixão em 3. o nível máximo de elevação é 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c4",
          "title": "Odisseia Inesperada",
          "description": "Usar um ataque normal ao executar um segundo ataque de carga nivel 1 da Sobrecarga da Paixão permite realizar um ataque adicional. Esse ataque adicional causa 135% do Dano do segundo ataque.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c5",
          "title": "O Explorador Verdadeiro",
          "description": "Aumenta o nível da Viagem Fantástica em 3. O nível máximo de elevação é 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c6",
          "title": "Fogo e Coragem",
          "description": "Personagens que usam Espadas, Espadões e Lanças dentro da área da Viagem Fantástica ganham 15% de Bônus de Dano Pyro e recebem um Encantamento Pyro.",
          "secondDescription": null,
          "descriptions": []
        }
      ]
    },
    {
      "key": "Chongyun",
      "name": "Chongyun",
      "description": "Um jovem exorcista de uma família de exorcistas. Ele tem feito de tudo para superar a sua própria energia positiva pura.",
      "skills": [
        {
          "key": "s1",
          "title": "Desgraça dos Demônios",
          "description": null,
          "abilities": [
            {
              "key": "a1",
              "description": "Performs up to 4 consecutive strikes.",
              "descriptions": []
            },
            {
              "key": "a2",
              "description": "Drains Stamina over time to perform continuous swirling attacks against all nearby enemies. At end of the sequence, perform a more powerful slash.",
              "descriptions": []
            },
            {
              "key": "a3",
              "description": "Plunges from mid-air to strike the ground below, damaging enemies along the path and dealing AoE DMG upon impact.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s2",
          "title": "Spirit Blade - Chonghua’s Layered Frost",
          "description": "Chongyun strikes the ground with his greatsword, causing a Cryo explosion in a circular AoE in front of him that deals Cryo DMG. After a short delay, the cold air created by the Cryo explosion will coalesce into a Chonghua Frost Field, within which all DMG done through Normal and Charged Attacks by Sword, Greatsword and Polearm-wielding characters will be converted to Cryo DMG.",
          "abilities": []
        },
        {
          "key": "s3",
          "title": "Spirit Blade - Cloud-parting Star",
          "description": "Performing the secret hand seals, Chongyun summons 3 giant spirit blades in mid-air that fall to the earth one by one after a short delay, exploding as they hit the ground. When the spirit blades explode, they will deal AoE Cryo DMG and launch enemies.",
          "abilities": []
        }
      ],
      "passives": [
        {
          "key": "p1",
          "title": "Gallant Journey",
          "description": "When dispatched on an expedition in Liyue, time consumed is reduced by 25%.",
          "descriptions": []
        },
        {
          "key": "p2",
          "title": "Steady Breathing",
          "description": "Sword, Claymore, or Polearm-wielding characters within the field created by Spirit Blade - Chonghua’s Layered Frost have their Normal Attack SPD increased by 8%.",
          "descriptions": []
        },
        {
          "key": "p3",
          "title": "Rimechaser Blade",
          "description": "When the field created by Spirit Blade - Chonghua’s Layered Frost disappears, another spirit will be summoned to strike nearby enemies, dealing 100% of Chonghua’s Layered Frost’s Skill DMG as AoE Cryo DMG. Enemies hit by this blade will have their Cryo RES decreased by 10% for 8s.",
          "descriptions": []
        }
      ],
      "constellations": [
        {
          "key": "c1",
          "title": "Nevasca Desencadeada",
          "description": "O último ataque do combo de Ataques Normais do Chongyun libera 3 lâminas de gelo. Cada Lâmina inflige 50% do ATQ de Chongyun como Dano Cryo a todos os inimigos em seu caminho.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c2",
          "title": "Revolução Atmosférica",
          "description": "Habilidades Elementais e Explosões Elementais lançadas dentro do Campo criado pela Lâmina do Espírito – Geada Chongyun têm seu tempo de Recarga reduzido em 15%.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c3",
          "title": "Explosão de Nuvens",
          "description": "Aumenta o nível da Lâmina Espiritual: Estrelas Cadente em 3. O nível máximo de elevação é 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c4",
          "title": "Céus Congelados",
          "description": "Chongyun regenera 1 de Energia sempre que ele acerta um inimigo afetado por Cryo. Esse efeito pode ocorrer apenas uma vez a cada 2 segundos..",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c5",
          "title": "O Verdadeiro Caminho",
          "description": "Aumenta o nível da Lâmina do Espírito – Geada de Chongyun em 3. O nível máximo de elevação é 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c6",
          "title": "Reforço das Quatro Lâminas",
          "description": "A Lâmina Espiritual – Estrela divisora de Nuvens inflige 15% a mais de Dano em inimigos com uma baixa porcentagem de sua Vida Máxima restante menor que a de Chongyun. Essa Habilidade também irá evocar uma lâmina espiritual adicional.",
          "secondDescription": null,
          "descriptions": []
        }
      ]
    },
    {
      "key": "Diluc",
      "name": "Diluc",
      "description": "O magnata do império de vinhedos em Mondstadt. Inigualável em todos os sentidos.",
      "skills": [
        {
          "key": "s1",
          "title": "Espada Temperada",
          "description": null,
          "abilities": [
            {
              "key": "a1",
              "description": "Realiza até 4 golpes consecutivos.",
              "descriptions": []
            },
            {
              "key": "a2",
              "description": "Drena Stamina ao longo do tempo para realizar cortes contínuos. Ao final da sequência, realiza um corte ainda mais poderoso",
              "descriptions": []
            },
            {
              "key": "a3",
              "description": "Mergulha em pleno ar para golpear o chão, causando dano aos inimigos em seu caminho e infligindo dano em uma AdE durante o impacto.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s2",
          "title": "Investida Ardente",
          "description": "Realiza um corte para frente que causa Dano Pyro (fogo). Esta habilidade pode ser usada 3x consecutivamente. Entra em recarga se não for lançada novamente em um curto período de tempo.",
          "abilities": []
        },
        {
          "key": "s3",
          "title": "Alvorecer",
          "description": "Lança chamas intensas nos inimigos ao redor, causando Dano Pyro (fogo). As chamas então convergem na arma, invocando uma Fénix que voa para frente e causa Dano Pyro (fogo) massivo no seu caminho. A Fénix explode depois alcançar seu destino causando um enorme Dano Pyro (fogo ) AdE. As chamas que correm de sua lâmina imbuem Diluc com Pyro (fogo).",
          "abilities": []
        }
      ],
      "passives": [
        {
          "key": "p1",
          "title": "Tradição do Cavaleiro do Alvorecer",
          "description": "Reembolsa 15% dos minérios usados durante a produção de armas do tipo Espadão.",
          "descriptions": []
        },
        {
          "key": "p2",
          "title": "Implacável",
          "description": "O ataque Carregado do Diluc é diminuído em 50%. e sua duração é aumentada em 3 segundos.",
          "descriptions": []
        },
        {
          "key": "p3",
          "title": "Benção da Fénix",
          "description": "O encantamento Pyro (fogo) Obtido pelo Alvorecer dura por 4 segundos a mais. Adicionalmente, Diluc ganha 20% de Bónus de Dano Pyro (fogo) ao longo da duração deste efeito.",
          "descriptions": []
        }
      ],
      "constellations": [
        {
          "key": "c1",
          "title": "Convicção",
          "description": "Diluc causa 15% a mais de Dano aos inimigos com vida superior a 50%",
          "descriptions": []
        },
        {
          "key": "c2",
          "title": "Brasas Ardentes",
          "description": "Quando Diluc recebe Dano, seu ataque aumenta 10%, e a sua velocidade de ataque aumenta em 5% por 10s. Este efeito pode ser ativado até 3 vezes e pode ocorrer apenas uma vez a cada 1.5s.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c3",
          "title": "Aço e fogo",
          "description": "Aumenta o nível da Investida ardente em 3. O nível máximo de elevação é 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c4",
          "title": "Chamas Fluidas",
          "description": "Lançar Investida Ardente em sequência aumenta drasticamente o dano causado. Dentro de 2s de uso da Investida Ardente, lançar a próxima Investida Ardente em um combo infligirá 40% de Dano adicional. Esse efeito dura pelo próximos 2s.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c5",
          "title": "Fênix, Prenúncio do Alvorecer",
          "description": "Aumenta o nível do Alvorecer em 3. O nível máximo de elevação é 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c6",
          "title": "Espada Flamejante, Nemesis das trevas",
          "description": "Após lançar a Investida Ardente, os próximos 2 ataques normais dentro de 6s terão seus Dano e Velocidade de ataque aumentados em 30%. Além disso, a Investida Ardente não interromperá o combo do ataque normal.",
          "secondDescription": null,
          "descriptions": []
        }
      ]
    },
    {
      "key": "Diona",
      "name": "Diona",
      "description": "Uma jovem que herdou pequenas quantidades de sangue não humano. Ela é a bartender incrivelmente popular da taverna da Cauda do Gato.",
      "skills": [
        {
          "key": "s1",
          "title": "Katzlein Style",
          "description": null,
          "abilities": [
            {
              "key": "a1",
              "description": "Performs up to 5 consecutive shots with a bow.",
              "descriptions": []
            },
            {
              "key": "a2",
              "description": "Perform a more precise Aimed Shot with increased DMG. While aiming, biting frost accumulates on the arrowhead. A fully charged frost arrow will deal Cryo DMG.",
              "descriptions": []
            },
            {
              "key": "a3",
              "description": "Fires off a shower of arrows in mid-air before falling and striking the ground, dealing AoE DMG upon impact.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s2",
          "title": "Icy Paws",
          "description": "Fires an Icy Paw that deals Cryo DMG to opponents and forms a shield on hit. The shield’s DMG Absorption scales based on Diona’s Max HP, and its duration scales off the number of Icy Paws that hit their target.",
          "abilities": [
            {
              "key": "a1",
              "description": "Rapidly fires off 2 Icy Paws.",
              "descriptions": []
            },
            {
              "key": "a2",
              "description": "Dashes back quickly before firing five Icy Paws. The shield created by a Hold attack will gain a 75% DMG Absorption Bonus. The shield has a 250% Cryo DMG Absorption Bonus, and will cause your active character to become affected by Cryo at the point of formation for a short duration.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s3",
          "title": "Signature Mix",
          "description": "Tosses out a special cold brew that deals AoE Cryo DMG and creates a Drunken Mist in an AoE.",
          "abilities": [
            {
              "name": "Drunken Mist",
              "description": null,
              "descriptions": [
                "Deals continuous Cryo DMG to opponents within the AoE.",
                "Continuously regenerates the HP of characters within the AoE."
              ]
            }
          ]
        }
      ],
      "passives": [
        {
          "key": "p1",
          "title": "Complimentary Bar Food",
          "description": "When a Perfect Cooking is achieved on a dish with restorative effects, there is a 12% chance to obtain double the product.",
          "descriptions": []
        },
        {
          "key": "p2",
          "title": "Cat’s Tail Secret Menu",
          "description": "Characters shielded by Icy Paws have their Movement SPD increased by 10% and their Stamina Consumption decreased by 10%.",
          "descriptions": []
        },
        {
          "key": "p3",
          "title": "Drunkard’s Farce",
          "description": "Opponents who enter the AoE of Signature Mix have 10% decreased ATK for 15s.",
          "descriptions": []
        }
      ],
      "constellations": [
        {
          "key": "c1",
          "title": "Coquetel da Casa",
          "description": "Regenera 15 de Energia para Diona depois dos efeitos de Coquetel Assassino terminarem.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c2",
          "title": "Garra de Gato Tremendo de frio",
          "description": "Aumenta o dano da Garra de Gato Gelada em 15%, e aumenta a Absorção de Dano do escudo em 15%. Quando a habilidade atinge um alvo, cria um escudo para outros personagens nos arredores que absorve até 50% do dano Garra de Gato Gelada por 5s.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c3",
          "title": "Q-quer outro copo??",
          "description": "Aumenta o nível da Coquetel Assassino em 3.O nível máximo de elevação é 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c4",
          "title": "Assassina da indústria do vinho",
          "description": "Na AdE do Coquetel Assassino, o tempo do Disparo com Mira de Diona é reduzido em 60%.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c5",
          "title": "Dose dupla com gelo",
          "description": "Aumenta o nível da Garra de Gato Gelada em 3. O nível máximo de elevação é 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c6",
          "title": "Encerrando o Expediente na Cauda do Gato",
          "description": "Os personagens dentro da AdE do Coquetel Assassino de acordo com a Vida obtém o seguinte efeito:",
          "secondDescription": null,
          "descriptions": [
            "Quando a Vida é igual ao inferior a 50% o Bônus de Cura Recebida aumenta em 30%.",
            "Quando a Vida é superior a 50%, a Proficiência Elemental aumenta 200."
          ]
        }
      ]
    },
    {
      "key": "Fischl",
      "name": "Fischl",
      "description": "Uma mulher misteriosa que se autointitula \"Princesa dos Pecados\" e viaja com um corvo chamado Oz.",
      "skills": [
        {
          "key": "s1",
          "title": "Bolts of Downfall",
          "description": null,
          "abilities": [
            {
              "key": "a1",
              "description": "Performs up to 5 consecutive shots with a bow.",
              "descriptions": []
            },
            {
              "key": "a2",
              "description": "Perform a more precise Aimed Shot with increased DMG. While aiming, the dark lightning spirits of Immernachtreich shall heed the call of their Prinzessin and indwell the enchanted arrowhead. When fully indwelt, the Rachsuchtig Blitz shall deal immense Electro DMG.",
              "descriptions": []
            },
            {
              "key": "a3",
              "description": "Fires off a shower of arrows in mid-air before falling and striking the ground, dealing AoE DMG upon impact.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s2",
          "title": "Nightrider",
          "description": "Summons Oz, the night raven forged of darkness and lightning descends upon the land, dealing Electro DMG in a small AoE. For the ability’s duration, Oz will continuously attack nearby enemies with Freikugel. Hold to adjust the location Oz will be summoned to. Press again any time during the ability’s duration to once again summon him to Fischl’s side.",
          "abilities": []
        },
        {
          "key": "s3",
          "title": "Midnight Phantasmagoria",
          "description": "Summons Oz to spread his twin swings of twilight and defend Fischl. Has the following properties during the ability’s duration:",
          "abilities": [
            {
              "name": "",
              "description": null,
              "descriptions": [
                "Fischl takes on Oz’s form, greatly increasing her Movement Speed.",
                "Strikes nearby enemies with lightning, dealing Electro DMG to enemies she comes into contact with. Each enemy can only be struck once.",
                "Once this ability’s effects end, Oz will remain on the battlefield and attack his Prinzessin’s foes. If Oz is already on the field, then this will reset the duration of his presence."
              ]
            }
          ]
        }
      ],
      "passives": [
        {
          "key": "p1",
          "title": "Mein Hausgarten",
          "description": "When dispatched on an expedition in Mondstadt, time consumed is reduced by 25%.",
          "descriptions": []
        },
        {
          "key": "p2",
          "title": "Stellar Predator",
          "description": "When Fischl hits Oz with a fully-charged Aimed Shot, Oz brings down Thundering Retribution, dealing AoE Electro DMG equal to 152.7% of the arrow’s DMG.",
          "descriptions": []
        },
        {
          "key": "p3",
          "title": "Undone Be Thy Sinful Hex",
          "description": "If a character triggers an Electro-related Elemental Reaction when Oz is on the field, the enemy shall be stricken with Thundering Retribution, dealing Electro DMG equal to 80% of Fischl’s ATK.",
          "descriptions": []
        }
      ],
      "constellations": [
        {
          "key": "c1",
          "title": "Olhar das Profundezas",
          "description": "Mesmo que OZ não esteja presente no combate, ele ainda pode proteger proteger Fischl através de seus Olhos de Corvo. Quando Fischl ataca um inimigo, Oz atacará simultaneamente, causando 22% de Dano de ATQ.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c2",
          "title": "Devorador de Todos os Pecados",
          "description": "Quando as Asas da Vigilância Noturna são usadas, causa um adicional de 200% de ataque como Dano e a sua AdE é aumentada em 50%.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c3",
          "title": "Asas do Pesadelo",
          "description": "Aumenta o nível do Guarda Noturno em 3. O nível máximo de elevação é 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c4",
          "title": "Fantasia da Rainha",
          "description": "Quando Ilusão Noturna é usada, causa 222% de ATQ como Dano Electro nos inimigos próximos. Quando a habilidade Termina, Fischl regenera 20% de sua Vida.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c5",
          "title": "Noite Silenciosa",
          "description": "Aumenta o nível da Ilusão Noturna em 3. O nível máximo de elevação é 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c6",
          "title": "Corvo da Noite Eterna",
          "description": "Aumenta a duração da evocação de Oz por 2 segundos. Adicionalmente, Oz ataca juntamente o seu próprio personagem quando presente, causando 30% do ATQ de Fischl como Dano Electro..",
          "secondDescription": null,
          "descriptions": []
        }
      ]
    },
    {
      "key": "Ganyu",
      "name": "Ganyu",
      "description": "Secretaria do Pavilhão Yuehai. O sangue da besta iluminada Qilin flui nas suas veias.",
      "skills": [
        {
          "key": "s1",
          "title": "Disparo Liutian",
          "description": null,
          "abilities": [
            {
              "key": "a1",
              "description": "Realiza até 6 disparos consecutivos com um arco.",
              "descriptions": []
            },
            {
              "key": "a2",
              "description": "Realiza um Disparo com Mira mais preciso com Dano aumentado. Ao mirar, uma aura congelante acumulará na ponta da flecha antes de ser disparada. Têm diferentes efeitos baseados em quanto tempo a energia foi carregada:",
              "descriptions": [
                "Carga Nivel 1: Dispara uma Flecha Congelante que causa Dano Cryo.",
                "Carga Nível 2: Dispara uma Flecha Congelante que causa Dano Cryo. A Flecha Congelante floresce após acertar seu alvo, causando Dano Cryo em AdE."
              ]
            },
            {
              "key": "a3",
              "description": "Dispara uma chuva de flechas durante o ar antes de cair e atingir o chão, causando Dano em AdE no impacto.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s2",
          "title": "Rastros de Qilin",
          "description": "Lançando uma Lótus de Gelo, Ganyu salta para trás, causando Dano AdE Cryo.",
          "abilities": [
            {
              "name": "Ice Lotus",
              "descriptions": [
                "Provoca inimigos ao seu redor, atraindo-os para a atacar.",
                "Sua resistência aumenta de acordo a Vida Máxima de Ganyu.",
                "Floresce quando destruída ou quando sua duração acaba, causando Dano Cryo AdE."
              ]
            }
          ]
        },
        {
          "key": "s3",
          "title": "Chuva Celestial",
          "description": "Funde a geada e a neve atmosférica, evocando uma Gema Cryo Sagrada que exorciza o mal. Ao longo da duração desta habilidade, a Gema Cryo Sagrada irá chover continuamente lascas de gelo, golpeando inimigos em uma AdE e infligindo Dano Cryo.",
          "abilities": []
        }
      ],
      "passives": [
        {
          "key": "p1",
          "title": "Preservado para a Caça",
          "description": "Retorna 15% dos minérios usados ao criar armas de Arco.",
          "descriptions": []
        },
        {
          "key": "p2",
          "title": "Com Todo Coração",
          "description": "Após disparar uma Flecha Congelante, a Taxa CRIT das Flechas Congelantes subsequentes e seus efeitos de florescimento resultantes é aumentada em 20% por 5s.",
          "descriptions": []
        },
        {
          "key": "p3",
          "title": "Harmonia entre o Céu e a Terra",
          "description": "Chuva Celestial concede 20% de Bônus de Dano Cryo aos membros ativos no grupo em uma AdE.",
          "descriptions": []
        }
      ],
      "constellations": [
        {
          "key": "c1",
          "title": "Bebedor de Orvalho",
          "description": "Receber Dano de uma Carga Nível 2 da Flecha Congelante ou da Explosão da Flecha Congelante diminui a RES Cryo dos inimigos em 15% por 6s.\n Um golpe restaura 2 de Energia para Ganyu. Este efeito pode ocorrer apenas uma vez por Carga Nível 2 da Flecha Congelante, independentemente se a Flecha Congelante em si ou sua explosão acertar o alvo.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c2",
          "title": "O Auspicioso",
          "description": "Os Rastros de Qilin aumentam 1 de Dano Adicional.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c3",
          "title": "Itinerante das Nuvens",
          "description": "Aumenta o nível da Chuva Celestial em 3. O nível máximo de elevação é 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c4",
          "title": "Estadía no Oeste",
          "description": "Os inimigos dentro da AdE da Dano aumentado. Este efeito fica mais forte com o O Dano aumentado recebido começa em 5% e aumenta 5% a cada 3s, chegando no máximo a 25%.\nEste efeito permanece por 3s após o inimigo sair da AdE.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c5",
          "title": "O Misericordioso",
          "description": "Aumenta o nível dos Rastros de Qilin em 3. O nível máximo de elevação é 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c6",
          "title": "O Clemente",
          "description": "Usando o Rastros de Qilin faz com que durante 30s a próxima Flecha Congelante não precise ser carregada.",
          "secondDescription": null,
          "descriptions": []
        }
      ]
    },
    {
      "key": "HuTao",
      "name": "Hu Tao",
      "description": "A 77.ª diretora da Funerária de Wangsheng. Apesar de ser jovem, já está encarregada de todos os assuntos funerários de Liyue.",
      "skills": [
        {
          "key": "s1",
          "title": "Lança Secreta de Wangsheng",
          "description": null,
          "abilities": [
            {
              "key": "a1",
              "description": "Realiza até 6 golpes com a lança.",
              "descriptions": []
            },
            {
              "key": "a2",
              "description": "Consome uma certa quantidade de Stamina para se lançar para frente, infligindo Dano em seu trajeto.",
              "descriptions": []
            },
            {
              "key": "a3",
              "description": "Mergulha em pleno ar para golpear o chão, causando dano aos inimigos ao longo do caminho e infligindo Dano em uma AdE durante o impacto.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s2",
          "title": "Guia do Além",
          "description": "Somente as chamas eternas podem limpar esse mundo.\nHu Tao consome uma parte de sua vida e repele os inimigos próximos, entrando no estado de Dança de Borboleta.",
          "abilities": [
            {
              "name": "Dança de Borboleta",
              "descriptions": [
                "A dança de borboleta aumenta o ATQ de Hu Tao com base em sua vida máxima. O ATQ obtido dessa forma não poderá ultrapassar 400% do seu ATQ Básico.",
                "O dano de ATQ é transformado em Dano Pyro. Esse dano elemental não pode ser substituido por outro encantamento elemental.",
                "O ataque carregado pode causar aos inimigos atingidos o efeito de Pétalas Sangrentas:.",
                "Aumenta a resistência de Hutao a interrupções."
              ]
            },
            {
              "name": "Pétalas Sangrentas",
              "description": "Os inimigos afetados pelas Pétalas Sangrentas receberão a cada 4s Dano Pyro uma vez. Esse dano é considerado dano de habilidade elemental. Só é possível existir um efeito de Pétalas Sangrentas por alvo, e sua duração só pode ser renovada por Hu Tao.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s3",
          "title": "Pacificadora de Espíritos",
          "description": "Balança a sua alma flamejante, causando Dano Pyro em uma grande AdE. Ao acertar nos inimigos, restaura a Vida de Hu Tao baseando-se na sua Vida Máxima. Esse efeito pode ser aplicado até 5 inimigos acertados. Ao acertar, se a Vida de Hutao for inferior ou igual a 50%, pode causar um maior Dano e Cura.",
          "abilities": []
        }
      ],
      "passives": [
        {
          "key": "p1",
          "title": "Quanto Mais, Melhor",
          "description": "Quando uma Culinária Perfeita é feita, tem uma chance de 18% de receber uma Culinária Esquisita de mesmo gênero.",
          "descriptions": []
        },
        {
          "key": "p2",
          "title": "Crisálida",
          "description": "Após o estado da Dança de Borboleta aplicado por Guia do Além terminar, a Taxa CRIT de todos os personagens (menos Hu Tao) na equipe aumenta em 12% por 8s.",
          "descriptions": []
        },
        {
          "key": "p3",
          "title": "Sangue Fervendo",
          "description": "Quando a Vida de Hu Tao ficar inferior ou igual a 50%, obterá 33% de bônus de Dano Pyro.",
          "descriptions": []
        }
      ],
      "constellations": [
        {
          "key": "c1",
          "title": "Buquê Carmesim",
          "description": "Sob o estado de Dança de Borboleta aplicado por Guia do Além, o Ataque Carregado de Hu Tao não consome Stamina.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c2",
          "title": "Mau Presságio",
          "description": "Pétalas Sangrentas causa Dano adicional equivalente a 10% da Vida Máxima de Hu Tao. Além disso, Pacificadora de Espíritos pode aplicar efeito de Pétalas Sangrentas aos inimigos acertados.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c3",
          "title": "Ritual de Sangría",
          "description": "O nivel de Habilidade Guia do Além aumenta em 3 níveis. Pode ser aumentado até 15 níveis.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c4",
          "title": "Jardim do Descanso Eterno",
          "description": "Quando os inimigos sob estado de Pétalas Sangrentas aplicado por Hu Tao forem derrotados, a Taxa CRIT de todos os aliados (menos Hutao) ao redor aumenta em 12% por 15s.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c5",
          "title": "Incenso de Flores",
          "description": "Aumenta o nível do Pacificadora de Espíritos em 3 níveis. O nível máximo de elevação é 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c6",
          "title": "Abraço das Borboletas",
          "description": "O efeito será ativado quando a Vida de Hu Tao for inferior a 25%, ou o Dano recebido for suficiente para derrotá-la:",
          "secondDescription": null,
          "descriptions": [
            "O Dano recebido não irá derrubar Hu Tao, e nos primeiros 10s, a RES Elemental e RES Física irão aumentar em 200%, entretanto, a Taxa CRIT aumenta em 100%, e sua Resistência contra Interrupção aumenta significativamente.",
            "O efeito será ativado automaticamente quando a Vida for 1.",
            "O efeito apenas pode ser ativado a cada 60s."
          ]
        }
      ]
    },
    {
      "key": "Jean",
      "name": "Jean",
      "description": "A justa e rigorosa Cavaleira de Dandelion, a Grande Mestre Intendente dos Cavaleiros de Favonius em Mondstadt.",
      "skills": [
        {
          "key": "s1",
          "title": "Técnica de Favonius",
          "description": null,
          "abilities": [
            {
              "key": "a1",
              "description": "Realiza até 5 golpes rápidos.",
              "descriptions": []
            },
            {
              "key": "a2",
              "description": "Consome certa quantidade de Stamina para lançar um inimigo ao ar usando o poder do vento.\n Inimigos lançados cairão lentamente ao chão.",
              "descriptions": []
            },
            {
              "key": "a3",
              "description": "Mergulha do ar para atingir o chão abaixo, causando Dano aos inimigos ao longo do caminho e causando AdE Dano no Impacto.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s2",
          "title": "Espada do Temporal",
          "description": "Canalizando o poder do vento sem forma em volta da sua espada, Jean Libera uma miniatura de uma tempestade, lançando inimigos na direção em que ela mira, causando um Dano Anemo massivo.",
          "abilities": [
            {
              "key": "a1",
              "description": "Ao custo de um consumo constante de Stamina, Jean pode comandar um turbilhão que suga inimigos e objetos próximos à sua frente. A direção pode ser controlada. O personagem fica imóvel ao longo da duração da habilidade.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s3",
          "title": "Brisa de Dandelion",
          "description": "Invocando a proteção do vento, Jean cria um Campo Dandelion rodopiante, lançando inimigos ao redor e causando Dano Anemo. Ao mesmo tempo, ela regenera instantaneamente uma grande quantidade de Vida para todos os membros da equipe. A Vida restaurada dimensiona o ATQ de Jean.",
          "abilities": [
            {
              "name": "Campo de Dandelions",
              "description": null,
              "descriptions": [
                "Regenera continuamente a Vida dos personagens dentro da AdE concede o atributo Anemo.",
                "Causa Dano Anemo aos inimigos que entram ou saem do campo."
              ]
            }
          ]
        }
      ],
      "passives": [
        {
          "key": "p1",
          "title": "Brisa de Planagem",
          "description": "Quando uma Culinária Perfeita é feita em uma comida com efeito de recuperação, tem uma chance de 12% de receber o dobro de produção.",
          "descriptions": []
        },
        {
          "key": "p2",
          "title": "Companhia do Vento",
          "description": "Ao acertar Ataques Normais de Jean, possui 50% de chance de regenerar Vida equivalente a 15% do ATQ de Jean a todos os membros da equipe.",
          "descriptions": []
        },
        {
          "key": "p3",
          "title": "Deixe o vento guiar.",
          "description": "Após usar a Brisa de Dandelion regenera 20% de Energia Elemental.",
          "descriptions": []
        }
      ],
      "constellations": [
        {
          "key": "c1",
          "title": "Tempestade Espiral",
          "description": "Aumenta a velocidade da Espada do Temporal após manter pressionado por mais de 1s e aumenta o dano causado em 40%.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c2",
          "title": "Egide do Povo",
          "description": "Quando a Jean pega um Orbe/Particula Elemental. todos os membros terão sua Veloc. Move VEL de ATQ aumentados em 15% por 15s.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c3",
          "title": "Quando o Vento do Oeste Sopra",
          "description": "Aumenta o nível da Brisa de Dandelion em 3. O nível máximo de elevação é 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c4",
          "title": "Terra dos Dandelions",
          "description": "Dentro do Campo criado pela Brisa de Dandelion, todos os inimigos têm sua RES Anemo diminuida em 40%.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c5",
          "title": "Rajada Explosiva",
          "description": "Aumenta o nivel da Espada do Temporal em 3. O nivel máximo de elevação é 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c6",
          "title": "Presa do Leão, Protetor de Mondstadt",
          "description": "Dano recebido é reduzido em 35% dentro da Área criada por Brisa de Dandelion. Após sair do Campo de Dandelion, este efeito dura por 3 ataques ou 10 segundos.",
          "secondDescription": null,
          "descriptions": []
        }
      ]
    },
    {
      "key": "Kaeya",
      "name": "Kaeya",
      "description": "Um espadachim dos Cavaleiros de Favonius com uma aparência exótica.",
      "skills": [
        {
          "key": "s1",
          "title": "Lâmina Cerimonial",
          "description": null,
          "abilities": [
            {
              "key": "a1",
              "description": "Realiza até 5 golpes rápidos.",
              "descriptions": []
            },
            {
              "key": "a2",
              "description": "Consome uma certa quantidade de Stamina para desferir 2 golpes rápidos com a espada.",
              "descriptions": []
            },
            {
              "key": "a3",
              "description": "Mergulha em pleno ar para golpear o chão, causando dano aos inimigos ao longo do caminho e infligindo Dano em uma AdE durante o impacto.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s2",
          "title": "Mordida Congelante",
          "description": "Lança uma explosão gélida, infligindo Dano Cryo aos inimigos em frente ao Kaeya.",
          "abilities": []
        },
        {
          "key": "s3",
          "title": "Valsa Glacial",
          "description": "Coalescendo a geada no ar, Kaeya invoca 3 pingentes de gelo que giram em torno dele. Esses pingentes seguirão o personagem e causaram Dano Cryo aos inimigos em seu caminho enquanto eles persistirem.",
          "abilities": []
        }
      ],
      "passives": [
        {
          "key": "p1",
          "title": "Forca Oculta",
          "description": "Diminui o consumo de Stamina ao Correr de todos os seus personagens em 20%.",
          "descriptions": []
        },
        {
          "key": "p2",
          "title": "Espada do Sangue Frio",
          "description": "Cada golpe com Mordida Congelante regenera a Vida de Kaeya equivalente a 15% do seu ATQ.",
          "descriptions": []
        },
        {
          "key": "p3",
          "title": "Coração Glacial",
          "description": "Os inimigos Congelados pela Mordida Congelante irão dropar Partículas Elementais adicionais. A Mordida Congelante pode produzir no máximo 2 Partículas Elementais por uso.",
          "descriptions": []
        }
      ],
      "constellations": [
        {
          "key": "c1",
          "title": "Sangue Excelente",
          "description": "A Taxa Critica do Ataque Normal e Ataque Carregado de Kaeya contra os inimigos afetados por Cryo aumentam em 15%.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c2",
          "title": "Apresentação Eterna",
          "description": "Cada Valsa Glacial que derrotar um inimigo aumenta sua duração em 2,5s por 15s.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c3",
          "title": "Dança do Gelo",
          "description": "Aumenta o nivel do Mordida Congelante em 3. O nivel máximo de elevacão é 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c4",
          "title": "Beijo Congelante",
          "description": "Triggers automatically when Kaeya’s HP falls below 20%:",
          "secondDescription": null,
          "descriptions": [
            "Ativa automaticamente quando a Vida de Kaeya cai para menos de 20%. Cria um escudo que absorve Dano igual a 30% da Vida Máxima de Kaeya. Dura 20 segundos.",
            "Esse escudo absorve 250% do Dano Cryo mais eficientemente. Pode ocorrer apenas uma vez a cada 60 segundos"
          ]
        },
        {
          "key": "c5",
          "title": "Abraço Congelante",
          "description": "Aumenta o nível do Valsa Glacial em 3. O nível máximo de elevação é 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c6",
          "title": "Redemoinho Glacial",
          "description": "A Valsa Glacial irá gerar 1 Ponta de Gelo adicional, e irá retornar 15 de Energia quando lançada.",
          "secondDescription": null,
          "descriptions": []
        }
      ]
    },
    {
      "key": "Keqing",
      "name": "Keqing",
      "description": "A Yuheng dos Qixing de Liyue. Tem muito a dizer sobre o Rex Lapis governando Liyue com apenas uma palavra, mas na verdade, esse deus admira muito esses céticos..",
      "skills": [
        {
          "key": "s1",
          "title": "Yunlai Swordsmanship",
          "description": null,
          "abilities": [
            {
              "key": "a1",
              "description": "Performs up to 5 rapid strikes.",
              "descriptions": []
            },
            {
              "key": "a2",
              "description": "Consumes a certain amount of Stamina to unleash 2 rapid sword strikes.",
              "descriptions": []
            },
            {
              "key": "a3",
              "description": "Plunges from mid-air to strike the ground below, damaging enemeies along the path and dealing AoE DMG upon impact.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s2",
          "title": "Stellar Restoration",
          "description": "Hurls a Lightning Stiletto that annihilates her enemies like the swift thunder. When the Stiletto hits its target, it deals Electro DMG to enemies in a small AoE, and places a Stiletto Mark on the spot hit.",
          "abilities": [
            {
              "key": "a1",
              "description": "Hold to adjust the direction in which the Stiletto shall be thrown. Stilettos thrown by the Hold attack mode can be suspended in mid-air, allowing Keqing to jump to them when using Stellar Restoration a second time.",
              "descriptions": []
            },
            {
              "name": "Lightning Stiletto",
              "description": "If Keqing uses Stellar Restoration again or uses a Charged Attack while its duration lasts, it will clear the Stiletto Mark and produce different effects:",
              "descriptions": [
                "If she uses Stellar Restoration again, she will blink to the location of the Mark and unleashed one slashing attack that deals AoE Electro DMG. When blinking to a Stiletto that was thrown from a Holding attack, Keqing can leap across obstructing terrain.",
                "If Keqing uses a Charged Attack, she will ignite a series of thundering cuts at the Mark’s location, dealing AoE Electro DMG."
              ]
            }
          ]
        },
        {
          "key": "s3",
          "title": "Starward Sword",
          "description": "Keqing unleashes the power of lightning, dealing Electro DMG in an AoE. She then blends into the shadow of her blade, striking a series of thunderclap-blows to nearby enemies simultaneous that deal multiple instance of Electro DMG. The final attack deals massive AoE Electro DMG.",
          "abilities": []
        }
      ],
      "passives": [
        {
          "key": "p1",
          "title": "Land’s Overseer",
          "description": "When dispatched on an expedition in Liyue, time consumed is reduced by 25%.",
          "descriptions": []
        },
        {
          "key": "p2",
          "title": "Thundering Penance",
          "description": "Within 5s of recasting Stellar Restoration while a Lightning Stiletto is present, Keqing’s Normal and Charged Attacks are converted to Electro DMG.",
          "descriptions": []
        },
        {
          "key": "p3",
          "title": "Aristocratic Dignity",
          "description": "When casting Starward Sword, Keqing’s CRIT Rate is increased by 15%, and her Energy Recharge is increased by 15%. This effect lasts for 8s.",
          "descriptions": []
        }
      ],
      "constellations": [
        {
          "key": "c1",
          "title": "Poder Trovejante",
          "description": "Relançar Estrelas do Regresso enquanto um Canivete de Relâmpago está presente faz com que Keqing cause 50% do seu ATQ como Dano Electro em uma AdE na localização inicial e final de seu Teleporte.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c2",
          "title": "Extração Afiada",
          "description": "Quando Ataques Normais e Carregados de Keqing acertam inimigos afetados por Electro, eles têm 50% de chance de produzir uma Partícula Elemental. Esse efeito pode ocorrer apenas uma vez a cada 5 segundos.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c3",
          "title": "Reforma Prevista",
          "description": "Aumenta o nível da Luxúria do Touro em 3. O nível máximo de elevação é 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c4",
          "title": "Sintonía",
          "description": "Por 10 segundos após Keqing acionar uma Reação Elemental relacionada com Electro, seu ATQ é aumentado em 25%.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c5",
          "title": "Estrelas Viajantes",
          "description": "Aumenta o nível da Estrelas do Retorno em 3. O nível máximo de elevação é 15..",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c6",
          "title": "Estrela Tenaz",
          "description": "Ao iniciar um Ataque Normal, um Ataque Carregado, uma Habilidade Elemental ou uma Suprema, Keqing ganha 6% de Bônus de Dano Electro por 8 segundos. Efeitos ativados por Ataques Normais, Ataques Carregados, Habilidades Elementais e Supremas são considerados entidades independentes..",
          "secondDescription": null,
          "descriptions": []
        }
      ]
    },
    {
      "key": "Klee",
      "name": "Klee",
      "description": "An explosives expert and a regular at the Knights of Favonius’ confinement room. Also known as Fleeing Sunlight.",
      "skills": [
        {
          "key": "s1",
          "title": "Kaboom!",
          "description": null,
          "abilities": [
            {
              "key": "a1",
              "description": "Throws things that go boom when they hit things! Perform up to 3 explosive attacks, dealing AoE Pyro DMG.",
              "descriptions": []
            },
            {
              "key": "a2",
              "description": "Consumes a certain amount of Stamina and deals Pyro DMG to enemies after a short casting time.",
              "descriptions": []
            },
            {
              "key": "a3",
              "description": "Gathering the power of Pyro, Klee plunges towards the ground from mid-air, damaging all enemies in her path. Deals AoE Pyro DMG upon impact with the ground.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s2",
          "title": "Jumpy Dumpty",
          "description": "Jumpy Dumpty is tons of boom-bang-fun! When thrown, Jumpy Dumpty bounces thrice, igniting and dealing AoE Pyro DMG with every bounce. On the third bounce, the bomb splits into many mines. The mines will explode upon contact with enemies, or after a short period of time, dealing AoE Pyro DMG. Starts with 2 charges.",
          "abilities": []
        },
        {
          "key": "s3",
          "title": "Sparks ’n’ Splash",
          "description": "Klee’s Blazing Delight! For the duration of this ability, continuously summons Sparks ’n’ Splash to attack nearby enemies, dealing AoE Pyro DMG.",
          "abilities": []
        }
      ],
      "passives": [
        {
          "key": "p1",
          "title": "All Of My Treasures!",
          "description": "Displays the location of nearby resources unique to Mondstadt on the mini-map.",
          "descriptions": []
        },
        {
          "key": "p2",
          "title": "Pounding Surprise",
          "description": "When Jumpy Dumpty and Normal Attacks deal DMG, Klee has a 50% chance to obtain an Explosive Spark. This Explosive Spark is consumed by the next Charged Attack, which costs no Stamina and deals 50% increased DMG.",
          "descriptions": []
        },
        {
          "key": "p3",
          "title": "Sparkling Burst",
          "description": "When a Charged Attack results in a CRIT, all party members gain 2 Elemental Energy.",
          "descriptions": []
        }
      ],
      "constellations": [
        {
          "key": "c1",
          "title": "Explosão em Cadeia",
          "description": "Ataques e Habilidades possuem certa chance de invocar faíscas que bombardeiam o inimigo, causando Dano igual a 120% das Faíscas Explosivas.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c2",
          "title": "Fragmentos Explosivos",
          "description": "Ao ser atingido pelas minas da Bomba Saltitante, diminui a DEF do inimigo em 23% por 10s.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c3",
          "title": "Coquetel Especial da Klee",
          "description": "Aumenta o nível da Bomba Saltitante em 3. O nível máximo de elevação é 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c4",
          "title": "Coelho Ativado",
          "description": "Se Klee deixa o campo de batalha durante as Faíscas Explosivas, a sua partida ativa uma explosão que causa 555% do seu ATQ como Dano AdE Pyro.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c5",
          "title": "Estrela dos Bombardeios",
          "description": "Aumenta o nível das Faíscas Explosivas em 3. O nível máximo de elevação é 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c6",
          "title": "Fogo Aberto",
          "description": "Enquanto sob o efeito de Faíscas Explosivas, Klee regenera 3 de Energia para todos os membros da equipe (exceto Klee) a cada 3s. Quando Faíscas Explosivas for usado, todos os membros do grupo ganharão 10% de Bônus de Dano Pyro por 25s. Este efeito pode ocorrer apenas uma vez a cada 15s..",
          "secondDescription": null,
          "descriptions": []
        }
      ]
    },
    {
      "key": "Lisa",
      "name": "Lisa",
      "description": "Preguiçosa, mas conhecida como bibliotecária dos Cavaleiros de Favonius, na verdade foi considerada pela Academia Sumeru como a mais graduada dos últimos dois séculos.",
      "skills": [
        {
          "key": "s1",
          "title": "Toque do Relámpago",
          "description": null,
          "abilities": [
            {
              "key": "a1",
              "description": "Realiza até 4 ataques de relâmpago que infligem Dano Electro.",
              "descriptions": []
            },
            {
              "key": "a2",
              "description": "Consome uma certa quantidade de Stamina que inflige Dano Electro em uma AdE após um curto período de canalização.",
              "descriptions": []
            },
            {
              "key": "a3",
              "description": "Reunindo o poder do Electro, Lisa mergulha ao chão em pleno ar, infligindo dano a todos os inimigos em seu caminho, Inflige Dano Electro em uma AdE durante o impacto com o chão.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s2",
          "title": "Arco Violeta",
          "description": "Canaliza o poder dos relâmpagos para se livrar de coisas incômodas.",
          "abilities": [
            {
              "key": "a1",
              "description": "Libera uma esfera relâmpago perseguidora. Ao acertar, inflinge Dano Electro e aplica um acúmulo do efeito Condutor (máximo de 3 acúmulos) nos inimigos em uma pequena AdE",
              "descriptions": []
            },
            {
              "key": "a2",
              "description": "Após um longo periodo de canalização, convoca os relâmpagos dos céus, infligindo Dano Electro massivo em todos os inimigos próximos baseado no número de acúmulos do efeito Condução aplicados neles, e remove seus efeitos de Condução.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s3",
          "title": "Rosa do Relâmpago",
          "description": "Evoca uma Rosa Elétrica que desfere poderosos relâmpagos, lançando inimigos próximos e infligindo Dano Electro. A Rosa Elétrica irá continuamente emitir raios que empurram os inimigos e infligem Dano Electro enquanto ela permanecer.",
          "abilities": []
        }
      ],
      "passives": [
        {
          "key": "p1",
          "title": "Conhecimentos Farmacêuticos",
          "description": "Quando a Lisa cria uma poção, ela possui 20% de chance de retornar uma porção dos materiais usados.",
          "descriptions": []
        },
        {
          "key": "p2",
          "title": "Indução Pós-Choque",
          "description": "Ao ser atingido por Ataques aplica o estado de Condutividade de Arco Violeta aos inimigos.",
          "descriptions": []
        },
        {
          "key": "p3",
          "title": "Campo de Eletricidade Estática",
          "description": "Inimigos acertados por Rosa do Relâmpago têm sua DEF diminuída em 15% por 10 segundos.",
          "descriptions": []
        }
      ],
      "constellations": [
        {
          "key": "c1",
          "title": "Circuito Infinito",
          "description": "Lisa regenera 2 de Energia para cada oponente atingido ao manter o Arco Violeta pressionado. É possível regenerar um máximo de 10 de Energia desta maneira por vez.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c2",
          "title": "Campo Eletromagnético",
          "description": "Mantendo pressionado o Arco Violeta possui os seguintes efeitos:",
          "secondDescription": null,
          "descriptions": [
            "Aumenta a DEF em 25%.",
            "Aumenta a RES a interrupção de Lisa."
          ]
        },
        {
          "key": "c3",
          "title": "Relampago Ressonante",
          "description": "Aumenta o nivel da Rosa do Relâmpago em 3. O nivel máximo de elevação é 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c4",
          "title": "Erupção de Plasma",
          "description": "Aumenta o número de raios lançados pela Rosa Relâmpago em 1 a 3.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c5",
          "title": "Eletrocutar",
          "description": "Aumenta o nivel do Arco Violeta em 3. O nivel máximo de elevação é 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c6",
          "title": "Bruxa Pulsante",
          "description": "Quando a Lisa entra em campo, ela aplica 3 cargas do estado de Condução do Arco Violeta nos inimigos ao redor. Este efeito pode ser ativado uma vez a cada 5s.",
          "secondDescription": null,
          "descriptions": []
        }
      ]
    },
    {
      "key": "Mona",
      "name": "Mona",
      "description": "Uma jovem astróloga misteriosa que proclama a si mesma como a \"Granda Astróloga Mona\" e que possui as habilidades para o título. Uma pessoa erudita, mas orgulhosa.",
      "skills": [
        {
          "key": "s1",
          "title": "Ripple of Fate",
          "description": null,
          "abilities": [
            {
              "key": "a1",
              "description": "Performs up to 4 water splash attacks that deal Hydro DMG.",
              "descriptions": []
            },
            {
              "key": "a2",
              "description": "Consumes a certain amount of Stamina and deals AoE Hydro DMG after a short casting time.",
              "descriptions": []
            },
            {
              "key": "a3",
              "description": "Gathering the might of Hydro, Mona plunges towards the ground from mid-air, damaging all enemies in her path. Deals AoE Hydro DMG upon impact with the ground.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s2",
          "title": "Mirror Reflection of Doom",
          "description": "Creates an illusory Phantom of fate from coalesced waterspouts.",
          "abilities": [
            {
              "name": "",
              "description": "The Phantom has the following special properties:",
              "descriptions": [
                "Continuously taunts nearby enemies, attracting their fire.",
                "Continuously deals Hydro DMG to nearby enemies.",
                "When its duration expires, the Phantom explodes, dealing AoE Hydro DMG."
              ]
            },
            {
              "key": "a2",
              "description": "Utilizes water currents to move backwards swiftly before conjuring a Phantom. Only one Phantom created by Mirror Reflection of Doom can exist at any time.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s3",
          "title": "Stellaris Phantasm",
          "description": "Mona summons the sparkling waves and creates a reflection of the starry sky, applying the Illusory Bubble status to opponents in a large AoE.",
          "abilities": [
            {
              "name": "Illusory Bubble",
              "description": "Traps opponents inside a pocket of destiny and also makes them Wet. Renders weaker opponents immobile. When an opponent affected by Illusory Bubble sustains DMG, the following effects are produced:",
              "descriptions": [
                "Applies an Omen to the opponent, which gives a DMG Bonus, also increasing the DMG of the attack that causes it.",
                "Removes the Illusory Bubble, dealing Hydro Elemental DMG in the process. The DMG Bonus does not apply to the Hydro Elemental DMG dealt in this instance."
              ]
            },
            {
              "name": "Omen",
              "description": "During its duration, increases DMG taken by enemies.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s4",
          "title": "Illusory Torrent",
          "description": null,
          "abilities": [
            {
              "name": "Alternate Spirit",
              "description": "Mona cloaks herself within the water’s flow, consuming Stamina to move rapidly. When under the effect of Illusory Torrent, Mona can move at high speed on water. Applies the Wet status to nearby enemies when she reappears.",
              "descriptions": []
            }
          ]
        }
      ],
      "passives": [
        {
          "key": "p1",
          "title": "Principium of Astrology",
          "description": "When Mona crafts Weapon Ascension Materials, she has a 25% chance to refund a portion of the crafting materials used.",
          "descriptions": []
        },
        {
          "key": "p2",
          "title": "Come ’n’ Get Me, Hag!",
          "description": "After she has used Illusory Torrent for 2s, if there are any enemies nearby, Mona will automatically create a Phantom. A Phantom created in this manner lasts for 2s, and its explosion DMG is equal to 50% of Mirror Reflection of Doom.",
          "descriptions": []
        },
        {
          "key": "p3",
          "title": "Waterborne Destiny",
          "description": "Increases Mona’s Hydro DMG Bonus by a degree equivalent to 20% of her Energy Recharge rate.",
          "descriptions": []
        }
      ],
      "constellations": [
        {
          "key": "c1",
          "title": "Profecia da Submersão",
          "description": "Os efeitos de Reações Elementais relacionadas a Hydro agora são aprimorados por 8 segundos depois que o seu próprio personagem de equipe atingir um inimigo afetado por um Presságio:",
          "secondDescription": null,
          "descriptions": [
            "Dano Eletricamente Carregado é aumentado em 15%.",
            "Dano de Vaporizar é aumentado em 15%.",
            "Dano de Redemoinho é aumentado em 15%.",
            "A duração em que os inimigos ficam congelados é aumentada em 15%."
          ]
        },
        {
          "key": "c2",
          "title": "Corrente Lunar",
          "description": "Quando um Ataque Normal acerta, existem 20% de chance que ele será automaticamente seguido de um Ataque Carregado. Esse efeito pode ocorrer apenas uma vez a cada 5s",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c3",
          "title": "Revolução Incessante",
          "description": "Aumenta o nível da Órbita Divina em 3. O nível de elevação é 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c4",
          "title": "Profecia do Fim",
          "description": "Quando todos os personagens na equipe atacarem um inimigo afetado pelo Status do Presságio, sua Taxa Crítica é aumentada em 15%.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c5",
          "title": "Zombaria da Fortuna",
          "description": "Aumenta o nível da Água Ilusória em 3. O nível de elevação é 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c6",
          "title": "Retórica da Calamidade",
          "description": "Ao entrar em Vicissitude, Mona ganha um aumento de 60% de Dano em seu próximo Ataque carregado por segundo. Um máximo de 180% de Dano adicional pode ser atingido desta maneira, e este efeito dura por não mais que 8s.",
          "secondDescription": null,
          "descriptions": []
        }
      ]
    },
    {
      "key": "Ningguang",
      "name": "Ningguang",
      "description": "Tianquan dos \"Qixing de Liyue\". Sua fortuna é insuperável em todo Teyvat.",
      "skills": [
        {
          "key": "s1",
          "title": "Dispersão Espumante",
          "description": null,
          "abilities": [
            {
              "key": "a1",
              "description": "Dispara gemas que causam Dano Geo. Ao acertar, concede a Ningguang 1 Jade de Estrela.",
              "descriptions": []
            },
            {
              "key": "a2",
              "description": "Consome uma certa quantidade de Stamina para disparar uma gema gigante que causa Dano Geo. Se Ningguang possui Jades de Estrela. ao liberar um Ataque Carregado farà com que os Jades de Estrelas sejam disparados contra um inimigo também, causando Dano adicional.",
              "descriptions": []
            },
            {
              "key": "a3",
              "description": "Reunindo o poder de Geo, Ningguang mergulha em direção ao solo no ar, causando Dano a todos os inimigos em seu caminho. Causa Dano Geo AdE com o impacto no solo.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s2",
          "title": "Tela de Jade",
          "description": "Ningguang cria uma Tela de Jade a partir do ouro, obsidiana e sua grande opulência, infligindo Dano Geo em uma AdE.",
          "abilities": [
            {
              "name": "Tela de Jade",
              "description": "Tela de Jade é considerada uma Construção Geo e pode ser usada para bloquear alguns ataques, mas não pode ser escalada. Apenas uma Tela de Jade pode existir ao mesmo tempo.",
              "descriptions": [
                "Bloqueia projéteis inimigos.",
                "Resistência aumenta com base na Vida Máxima de Ningguang."
              ]
            }
          ]
        },
        {
          "key": "s3",
          "title": "Quebrador de Estrelas",
          "description": "Recolhendo um grande número de gemas, Ningguang espalha todas de uma vez, enviando projéteis perseguidores em seus inimigos que causam Dano Geo massivo. Se o Quebrador de Estrelas é lançado enquanto a Tela de Jade está próxima, a Tela de Jade irá disparar projéteis de gemas perseguidoras adicionais ao mesmo tempo.",
          "abilities": []
        }
      ],
      "passives": [
        {
          "key": "p1",
          "title": "Registro dos Tesouros Maravilhosos",
          "description": "Mostra a localização de uma jazida de minerais (Ferro, Ferro Branco, Cristal e Cristal mágico, Minério de Prata Estrelada) no mapa.",
          "descriptions": []
        },
        {
          "key": "p2",
          "title": "Plano B",
          "description": "Quando Ningguang estiver em posse das Jades de Estrela, seu Ataque Carregado não consome Stamina.",
          "descriptions": []
        },
        {
          "key": "p3",
          "title": "Reserva Estratégica",
          "description": "Um personagem que passa pela Tela de Jade ganhará 12% de Bônus de Dano GEO por 10s.",
          "descriptions": []
        }
      ],
      "constellations": [
        {
          "key": "c1",
          "title": "Fragmentos Perfurantes",
          "description": "Ao acertar um Ataque Normal, causara Dano de AdE.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c2",
          "title": "Efeito de Choque",
          "description": "Quando a Tela de Jade for quebrada, o tempo de recarga é redefinido. Este efeito pode ser ativado uma vez a cada 6s.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c3",
          "title": "Majestosa seja a Formação das Estrelas",
          "description": "Aumenta o nivel do Quebrador de Estrelas em 3. O nivel máximo da elevação é 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c4",
          "title": "Requintado seja o Jade, brilhando por todo o lado",
          "description": "A Tela de Jade aumenta a RES Elemental dos personagens próximos em 10%.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c5",
          "title": "Invencível seja a Tela de Jade",
          "description": "Aumenta o nível da Tela de Jade em 3. O nível máximo de elevação é 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c6",
          "title": "Grandiosas sejam as Sete Estrelas",
          "description": "Quando o Quebrador de Estrelas for usado, Ningguang ganha 7 Estrelas de Jade..",
          "secondDescription": null,
          "descriptions": []
        }
      ]
    },
    {
      "key": "Noelle",
      "name": "Noelle",
      "description": "Uma empregada em serviço dos Cavaleiros de Favonius que sonha em se juntar aos cavaleiros um dia.",
      "skills": [
        {
          "key": "s1",
          "title": "Técnica de Espada de Favonius - Empregada",
          "description": null,
          "abilities": [
            {
              "key": "a1",
              "description": "Realiza até 4 golpes consecutivos.",
              "descriptions": []
            },
            {
              "key": "a2",
              "description": "Drena Stamina ao longo do tempo para realizar um ataque giratório continuo contra todos os inimigos próximos. Ao final da sequência, realiza um corte poderoso.",
              "descriptions": []
            },
            {
              "key": "a3",
              "description": "Mergulha em pleno ar para golpear o chão, danificando inimigos em seu caminho e infligindo Dano em uma AdE durante o impacto.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s2",
          "title": "Guardião do Coração",
          "description": "Invoca uma armadura protetora, infligindo Dano Geo nos inimigos próximos e criando um escudo. A Absorção de Dano do escudo aumenta baseado na DEF de Noelle.",
          "abilities": [
            {
              "name": "",
              "description": "O escudo tem as seguintes propriedades:",
              "descriptions": [
                "Quando os Ataques Normais e Ataques Carregados da Noelle acertarem um alvo, eles terão uma certa chance de recuperar a Vida de todos os personagens, dentro e fora do campo. A quantidade de Vida curada quando a recuperação é desencadeada é baseada na DEF de Noelle.",
                "Aplica o elemento Geo ao personagem.",
                "Possui 150% de Eficiência em Absorção contra todos os danos elementais."
              ]
            }
          ]
        },
        {
          "key": "s3",
          "title": "Grande Limpeza",
          "description": "Reunindo a força da pedra em sua arma, Noelle ataca os inimigos ao seu redor com uma grande AdE, causando Dano Geo.",
          "abilities": [
            {
              "name": "",
              "description": "Em seguida, Noelle ganha os seguintes efeitos:",
              "descriptions": [
                "Aumenta o Ataque AdE de Noelle.",
                "Converte o Dano ATQ para Dano Geo. O efeito dessa conversão elemental não pode ser anulado por nenhuma outra conversão elemental.",
                "Seu ATQ aumenta com base na sua DEF."
              ]
            }
          ]
        }
      ],
      "passives": [
        {
          "key": "p1",
          "title": "Dedicação da Empregada",
          "description": "Quando uma Culinária Perfeita é feita em uma comida de aumento de DEF, Noelle tem uma chance de 12% de receber o dobro de produção.",
          "descriptions": []
        },
        {
          "key": "p2",
          "title": "Devoção",
          "description": "Quando Noelle não estiver em combate, e a Vida do personagem selecionado cair para menos de 30%, o seguinte efeito acontecerá automaticamente: A Vida do Personagem em uso receberá imediatamente um escudo de duração de 20s que absorve um dano equivalenta a 400% da DEF de Noelle. O escudo tem 150% de eficiência contra Dano de todos os Elementos e Dano Fisico. Este efeito só pode ocorrer uma vez a cada 60s.",
          "descriptions": []
        },
        {
          "key": "p3",
          "title": "Limpo e Eficaz",
          "description": "Cada 4 Ataques Normais ou Carregados aumentam a Recarga de Guardião do Coração em 1s. Atingindo múltiplos inimigos com um único ataque apenas conta como 1 golpe.",
          "descriptions": []
        }
      ],
      "constellations": [
        {
          "key": "c1",
          "title": "Estou na sua Retaguarda",
          "description": "Enquanto ambos Grande Limpeza e Guardião do Coração estiverem em efeito, a chance de ativação de cura do Guardião do Coração aumenta em 100%.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c2",
          "title": "Empregada do Redemoinho",
          "description": "Diminui o Consumo de Stamina dos Ataques Carregados de Noelle em 20% e aumenta o Dano do seu Ataque Carregado em 15%.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c3",
          "title": "Empregada Invulnerável",
          "description": "Aumenta o nivel do Guardião do Coração em 3. O nivel máximo de elevação é 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c4",
          "title": "A Ser Limpo",
          "description": "Quando o Guardião do Coração termina ou se rompe, causa 400% de ATQ como Dano Geo aos inimigos ao redor.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c5",
          "title": "Governanta de Favonius",
          "description": "Aumenta o nivel da Grande Limpeza em 3. O nivel máximo de elevação é 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c6",
          "title": "Deve Ser Impecável",
          "description": "A Grande Limpeza aumenta o ATQ de Noelle em um adicional de 50% de sua DEF. Durante esta habilidade, adiciona 1s de tempo de duração para cada oponente derrotado, até 10s.",
          "secondDescription": null,
          "descriptions": []
        }
      ]
    },
    {
      "key": "Qiqi",
      "name": "Qiqi",
      "description": "Uma aprendiz e colhedora de ervas na Farmácia Bubu. Uma morta-viva com pele branca como osso, ela raramente tem ou emoções.",
      "skills": [
        {
          "key": "s1",
          "title": "Ancient Sword Art",
          "description": null,
          "abilities": [
            {
              "key": "a1",
              "description": "Performs up to 5 rapid strikes.",
              "descriptions": []
            },
            {
              "key": "a2",
              "description": "Consumes a certain amount of Stamina to unleash 2 rapid sword strikes.",
              "descriptions": []
            },
            {
              "key": "a3",
              "description": "Plunges from mid-air to strike the ground below, damaging enemies along the path and dealing AoE DMG upon impact.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s2",
          "title": "Adeptus Art: Herald of Frost",
          "description": "Using the Icevein Talisman, Qiqi brings forth the Herald of Frost, dealing Cryo DMG to nearby enemies.",
          "abilities": [
            {
              "name": "Herald of Frost",
              "description": "",
              "descriptions": [
                "When Qiqi hits a target with her Normal or Charged Attacks, she regenerates HP for all party members and all nearby allied characters. Healing scales based on Qiqi’s ATK.",
                "Regenerates HP for current character at regular intervals.",
                "Follows the character around, dealing Cryo DMG to enemies in its path."
              ]
            }
          ]
        },
        {
          "key": "s3",
          "title": "Adeptus Art: Preserver of Fortune",
          "description": "Qiqi releases the adeptus power sealed within her body, marking nearby enemies with a Fortune-Preserving Talisman that deals Cryo DMG.",
          "abilities": [
            {
              "name": "Fortune-Preserving Talisman",
              "description": "When enemies affected by this Talisman take DMG, the character that dealt this DMG regenerates HP.",
              "descriptions": []
            }
          ]
        }
      ],
      "passives": [
        {
          "key": "p1",
          "title": "Former Life Memories",
          "description": "Displays the location of nearby resources unique to Liyue on the mini-map.",
          "descriptions": []
        },
        {
          "key": "p2",
          "title": "Life-Prolonging Methods",
          "description": "When a character under the effects of Adeptus Art: Herald of Frost triggers an Elemental Reaction, their Incoming Healing Bonus is increased by 20% for 8s.",
          "descriptions": []
        },
        {
          "key": "p3",
          "title": "A Glimpse into Arcanum",
          "description": "When Qiqi hits enemies with her Normal and Charged Attacks, she has a 50% chance to apply a Fortune-Preserving Talisman to them for 6s. This effect can only occur once every 30s.",
          "descriptions": []
        }
      ],
      "constellations": [
        {
          "key": "c1",
          "title": "Ascéticos de Gelo",
          "description": "Quando o Arauto da Floresta atinge um inimigo marcado pelo Amuleto da Preservação da Sorte, Qiqi regenera 2 de Energia.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c2",
          "title": "Congelando até os Ossos",
          "description": "O Dano do Ataque Normal e Ataque Carregado de Qiqi contra os inimigos afetados por Cryo aumentam em 15%.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c3",
          "title": "Elogio Ascendente",
          "description": "Aumenta o Nível de Arte do Adeptus: Preservador da Fortuna em 3. Pode ser elevado até Nv. 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c4",
          "title": "Supressão Divina",
          "description": "Os alvos marcados com o Talismã da Preservação da Fortuna terão seu ATQ reduzidos em 20%.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c5",
          "title": "Flor de Lótus Carmesim",
          "description": "Aumenta o Nível de Arauto da Floresta em 3. Pode ser elevado até Nv. 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c6",
          "title": "Ritual de Ressurreição",
          "description": "Ao usar a Arte do Adeptus: Preservador da Fortuna, revive todos os personagens da equipe caídos ao redor e regenera 50% da Vida deles. Este efeito pode ocorrer apenas uma vez a cada 15s.",
          "secondDescription": null,
          "descriptions": []
        }
      ]
    },
    {
      "key": "Razor",
      "name": "Razor",
      "description": "Um garoto que vive entre os lobos no Reino dos Lobos em Mondstadt, longe da civilização. E ágil como um relâmpago.",
      "skills": [
        {
          "key": "s1",
          "title": "Steel Fang",
          "description": null,
          "abilities": [
            {
              "key": "a1",
              "description": "Performs up to 4 consecutive strikes.",
              "descriptions": []
            },
            {
              "key": "a2",
              "description": "Drains Stamina over time to perform continuous swirling attacks against all nearby enemies. At end of the sequence, perform a more powerful slash.",
              "descriptions": []
            },
            {
              "key": "a3",
              "description": "Plunges from mid-air to strike the ground below, damaging enemies along the path and dealing AoE DMG upon impact.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s2",
          "title": "Claw and Thunder",
          "description": "Hunts his prey using the techniques taught to him by his master and his Lupical.",
          "abilities": [
            {
              "key": "a1",
              "description": "Swings the Thunder Wolf Claw, dealing Electro DMG to enemies in front of Razor. Upon striking an enemy, Razor will gain an Electro Sigil, which increases his Energy Recharge rate. Razor can have up to 3 Electro Sigils simultaneously, and gaining a new Electro Sigil refreshes their duration.",
              "descriptions": []
            },
            {
              "key": "a2",
              "description": "Gathers Electro energy to unleash a lightning storm over a small AoE, causing massive Electro DMG, and clears all of Razor’s Electro Sigils. Each Electro Sigil cleared in this manner will be converted into Energy for Razor.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s3",
          "title": "Lightning Fang",
          "description": "Summons the Wolf Within which deals Electro DMG to all nearby opponents. This clears all of Razor’s Electro Sigils, which will be converted into elemental energy for him. The Wolf Within will fight alongside Razor for the skill’s duration.",
          "abilities": [
            {
              "name": "The Wolf Within",
              "description": "These effects end when Razor leaves the battlefield. When Razor leaves the field, a maximum of 10 Energy will be returned to him based off the duration remaining on this skill.",
              "descriptions": [
                "Strikes alongside Razor’s normal attacks, dealing Electro DMG.",
                "Raises Razor’s ATK SPD and Electro RES.",
                "Causes Razor to be immune to DMG inflicted by the Electro-Charged status.",
                "Disables Razor’s Charged Attacks.",
                "Increases Razor's resistance to interruption."
              ]
            }
          ]
        }
      ],
      "passives": [
        {
          "key": "p1",
          "title": "Wolvensprint",
          "description": "Decreases all party member’s sprinting Stamina Consumption by 20%.",
          "descriptions": []
        },
        {
          "key": "p2",
          "title": "Awakening",
          "description": "Decreases Claw and Thunder’s CD by 18%. Using Lightning Fang resets the CD of Claw and Thunder.",
          "descriptions": []
        },
        {
          "key": "p3",
          "title": "Hunger",
          "description": "When Razor’s Energy is below 50%, increases Energy Recharge by 30%.",
          "descriptions": []
        }
      ],
      "constellations": [
        {
          "key": "c1",
          "title": "Natureza do Lobo",
          "description": "Ao obter um Orbe Elemental ou Partícula Elemental, aumenta o Dano de Razor em 10% por 8s.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c2",
          "title": "Supressão",
          "description": "Aumenta a Taxa Crítica contra inimigos com menos de 30% de Vida em 10%.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c3",
          "title": "Espírito Animal",
          "description": "Aumenta o nível do Dente de Relâmpago em 3. O nível máximo de elevação é 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c4",
          "title": "Mordida Ao lanças",
          "description": "a Garra e Trovão, diminui a DEF dos inimigos acertados em 15% por 7s..",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c5",
          "title": "Garras Afiadas",
          "description": "Aumenta o nível da Garra e Trovão em 3. O nível máximo de elevação é 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c6",
          "title": "Lupus Fulguris",
          "description": "A cada 10s, a espada de Razor recarrega, fazendo com que o próximo Ataque Normal libere um relâmpago que causa 100% de Dano Electro do ATQ de Razor. Quando Razer não estiver usando o Dente de Relâmpago, um golpe de relâmpago contra o inimigo concederá um Selo Electro a Razor pela Garra e Trovão.",
          "secondDescription": null,
          "descriptions": []
        }
      ]
    },
    {
      "key": "Rosaria",
      "name": "Rosaria",
      "description": "A nun who, outside of her garb, seems nothing at all like a person of the cloth. Known for her sharp, cold words and manner, she often works alone.",
      "skills": [
        {
          "key": "s1",
          "title": "Spear of Worship",
          "abilities": [
            {
              "key": "a1",
              "description": "Performs up to five consecutive spear strikes.",
              "descriptions": []
            },
            {
              "key": "a2",
              "description": "Consumes a certain amount of Stamina to lunge forward, dealing damage to opponents along the way.",
              "descriptions": []
            },
            {
              "key": "a3",
              "description": "Plunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s2",
          "title": "Ravaging Confession",
          "description": "Rosaria swiftly shifts her position to appear behind her opponent, then stabs and slashes them with her polearm, dealing Cyro DMG.\nThis ability cannot be used to travel behind opponents of a larger build.",
          "abilities": []
        },
        {
          "key": "s3",
          "title": "Rites of Termination",
          "description": "Rosaria's unique take on this prayer ritual: First, she swings her weapon to slash surrounding opponents; then, she summons a frigid Ice Lance that strikes the ground. Both actions deal Cryo DMG.\nWhile active, the Ice Lance periodically releases a blast of cold air, dealing Cryo DMG to surrounding opponents.",
          "abilities": []
        }
      ],
      "passives": [
        {
          "key": "p1",
          "title": "Night Walk",
          "description": "At night (18:00–6:00), increases the Movement SPD of your own party members by 10%.\nDoes not take effect in Domains, Trounce Domains, or Spiral Abyss. Not stackable with Passive Talents that provide the exact same effects.",
          "descriptions": []
        },
        {
          "key": "p2",
          "title": "Extracted Confession",
          "description": "When Rosaria strikes an opponent from behind using Ravaging Confession, Rosaria's CRIT Rate increases by 12% for 5s.",
          "descriptions": []
        },
        {
          "key": "p3",
          "title": "Shadow Samaritan",
          "description": "Casting Rites of Termination increases CRIT Rate of all nearby party members (except Rosaria herself) by 15% of Rosaria's CRIT Rate for 10s.\nCRIT Rate Bonus gained this way cannot exceed 15%.",
          "descriptions": []
        }
      ],
      "constellations": [
        {
          "key": "c1",
          "title": "Unholy Revelation",
          "description": "When Rosaria deals a CRIT Hit, her ATK SPD increases by 10% and her Normal Attack DMG increases by 10% for 4s.",
          "descriptions": []
        },
        {
          "key": "c2",
          "title": "Land Without Promise",
          "description": "The duration of the Ice Lance created by Rites of Termination is increased by 4s.",
          "descriptions": []
        },
        {
          "key": "c3",
          "title": "Sacrament of Penance",
          "description": "Increases the Level of Ravaging Confessionby 3. Maximum upgrade level is 15.",
          "descriptions": []
        },
        {
          "key": "c4",
          "title": "Amazing Disgrace",
          "description": "Ravaging Confession's Crit Hits regenerate 5 Energy for Rosaria. Can only be triggered once each time Ravaging Confession is cast.",
          "descriptions": []
        },
        {
          "key": "c5",
          "title": "Extreme Unction",
          "description": "Increases the Level of Rites of Termination by 3. Maximum upgrade level is 15.",
          "descriptions": []
        },
        {
          "key": "c6",
          "title": "Divine Retribution",
          "description": "Rites of Termination' attack decreases opponents' Physical RES by 20% for 10s.",
          "descriptions": []
        }
      ]
    },
    {
      "key": "Sucrose",
      "name": "Sucrose",
      "description": "Uma alquimista cheia de curiosidade sobre todas as coisas. O pesquisador na prática da bioalquimia.",
      "skills": [
        {
          "key": "s1",
          "title": "Wind Spirit Creation",
          "description": null,
          "abilities": [
            {
              "key": "a1",
              "description": "Performs up to 4 attacks using Wind Spirits, dealing Anemo DMG.",
              "descriptions": []
            },
            {
              "key": "a2",
              "description": "Consumes a certain amount of Stamina and deals AoE Anemo DMG after a short casting time.",
              "descriptions": []
            },
            {
              "key": "a3",
              "description": "Calling upon the power of her Wind Spirits, Sucrose plunges towards the ground from mid-air, damaging all enemies in her path. Deals AoE Anemo DMG upon impact with the ground.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s2",
          "title": "Astable Anemohypostasis Creation - 6308",
          "description": "Creates a small Wind Spirit that deals Anemo DMG to enemies in an AoE, pulling them towards the location of the Wind Spirit before launching them.",
          "abilities": []
        },
        {
          "key": "s3",
          "title": "Forbidden Creation - Isomer 75 / Type II",
          "description": "Sucrose hurls an unstable concoction that creates a Large Wind Spirit. While it persists, the Large Wind Spirit will continuously pull and launch nearby enemies, dealing AoE Anemo DMG.",
          "abilities": [
            {
              "key": "a1",
              "description": "If the Wind Spirit comes into contact with Hydro / Pyro / Cryo / Electro elements, it will deal additional DMG of that type. Elemental Absorption may only occur once per use.",
              "descriptions": []
            }
          ]
        }
      ],
      "passives": [
        {
          "key": "p1",
          "title": "Astable Invention",
          "description": "When Sucrose crafts Character and Weapon Enhancement Materials, she has a 10% to obtain double the product.",
          "descriptions": []
        },
        {
          "key": "p2",
          "title": "Catalyst Conversion",
          "description": "When Sucrose triggers a Swirl effect, characters in the party with the matching element have their Elemental Mastery increased by 50 for 8s.",
          "descriptions": []
        },
        {
          "key": "p3",
          "title": "Mollis Favonius",
          "description": "When Astable Anemohypostatis Creation - 6308 or Forbidden Creation - Isomer 75 / Type II hit an enemy, increases other party member’s Elemental Mastery based on 20% of Sucrose’s Elemental Mastery for 8s.",
          "descriptions": []
        }
      ],
      "constellations": [
        {
          "key": "c1",
          "title": "Campo de Vácuo Acumulado",
          "description": "Criação do Espírito do Vento: Experimento 6308 ganha 1 carga adicional.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c2",
          "title": "Beth - Forma Não-consolidada",
          "description": "A duração da Criação do Espírito do Vento: Isomórfico-75 Tipo II é aumentada em 2 segundos.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c3",
          "title": "Alquimista Perfeita",
          "description": "Aumenta o nível do Criação do Espírito do Vento: Experimento 6308 em 3. O nível de elevação é 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c4",
          "title": "Alquimania",
          "description": "A cada 7 Ataques Normais e Carregados, Sucrose irá reduzir o Tempo de Recarga do Criação do Espírito do Vento: Experimento 6308 em 1-7 s.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c5",
          "title": "Atenção: Frasco Comum",
          "description": "Aumenta o Nível da Criação do Espírito do Vento: Isomórfico-75 Tipo II em 3. O nível máximo de elevação é 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c6",
          "title": "Entropía Caótica",
          "description": "Se Criação do Espírito do Vento: Isomórfico-75 Tipo II aciona uma Absorção Elemental, todos os membros de equipe ganham 20% de Bônus de Dano Elemental para o elemento correspondente absorvido enquanto a habilidade estiver em duração.",
          "secondDescription": null,
          "descriptions": []
        }
      ]
    },
    {
      "key": "Tartaglia",
      "name": "Tartaglia",
      "description": "O N° 11 dos Fatui, também conhecido como \"Childe\". O seu nome é bastante temido em campos de batalha.",
      "skills": [
        {
          "key": "s1",
          "title": "Intercepção de Chuva",
          "description": null,
          "abilities": [
            {
              "key": "a1",
              "description": "Realiza até 6 disparos consecutivos com o arco.",
              "descriptions": []
            },
            {
              "key": "a2",
              "description": "Realiza um Disparo com Mira com dano aumentado. Na hora do Disparo com Mira, o Elemento Hydro pode se acumular na flecha. Uma flecha totalmente carregada que acertar o inimigo causará Dano Hydro e Interceptação de Fluxo.",
              "descriptions": []
            },
            {
              "name": "Interceptação de Fluxo",
              "description": "Inimigos sob a influência da Interceptação de Fluxo receberão vários tipos de ataque de Tartaglia que causarão Dano Hydro AdE. Os danos são considerados Ataques Normais.",
              "descriptions": [
                "Interceptação de Fluxo - Instantâneo: Um Disparo com Mira carregado que acertar um inimigo afetado pela Interceptação de Fluxo causará Dano AdE consecutivo. A Interceptação de Fluxo · Instantâneo só pode ser ativada uma vez a cada 0.7 segundos.",
                "Interceptação de Fluxo - Explosão: Derrotar um inimigo afetado pela Interceptação de Fluxo causará uma explosão Hydro que infligirá o efeito Interceptação de Fluxo nos inimigos ao redor."
              ]
            },
            {
              "key": "a4",
              "description": "Dispara uma chuva de flechas no ar antes de cair e impactar o chão, causando dano AoE no impacto. Se estiver no estado corpo-a-corpo em Legado do Mal - Ondas de Fúria, não pode apresentar o Ataque Imersivo.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s2",
          "title": "Armas Demoniacas: Marés Raivosas",
          "description": "Lança armas feitas de água, causando Dano Hydro nos inimigos ao redor e entra na Posição Corpo-a-Corpo. Nessa posição, os ataques Normais e Carregados de Tartaglia são convertidos para Dano Hydro que não podem ser anulados por outros elementos e mudam para o seguinte:",
          "abilities": [
            {
              "key": "a1",
              "description": "Realiza até 6 ataques Hydro consecutivos.",
              "descriptions": []
            },
            {
              "key": "a2",
              "description": "Consome uma certa quantia de Stamina para realizar dois cortes que causam Dano Hydro.",
              "descriptions": []
            },
            {
              "name": "Interceptação de Fluxo - Corte",
              "description": "Atingir um inimigo afetado pela Interceptação de Fluxo com um ataque corpo-a-corpo libera um Corte de Interceptação de Fluxo que causa Dano Hydro AdE. Dano causado nesta maneira é considerado Dano de uma Habilidade Elemental, e só pode ocorrer uma vez a cada 1.5s. Depois de 30s, ou quando a habilidade é lançada novamente, esse efeito se encerrará. Tartaglia retornará para sua Posição À Distância e essa habilidade entrará no seu tempo de recarga. Quanto mais tempo Tartaglia permanecer na Posição Corpo-a-Corpo, maior a recarga. Se o retorno a Posição À Distância acontecer automaticamente depois de 30s, o tempo de recarga é ainda maior.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s3",
          "title": "Devastação: Obliteração",
          "description": "Realiza ataques diferentes baseado em qual Posição Tartaglia está quando os lança.",
          "abilities": [
            {
              "name": "Posição À Distância: Clarão da Devastação",
              "description": "Dispara uma flecha Hydro, causando Dano Hydro AoE e aplicando o efeito Interceptação de Fluxo. Regenera uma porção de seu Consumo de Energia após o uso.",
              "descriptions": []
            },
            {
              "name": "Posição Corpo-a-Corpo: Luz da Obliteração",
              "description": "Realiza um corte com uma grande AdE, causando Dano Hydro massivo para os inimigos ao redor, desencadeando Interceptação de Fluxo - Explosão.",
              "descriptions": []
            },
            {
              "name": "Interceptação de Fluxo - Explosão",
              "description": "Quando as águas obliteradoras atingem inimigos afetados pela Interceptação de Fluxo, acaba com esse efeito e desencadeia Explosões Hydro que causam Dano Hydro AdE. O dano de Interceptação de Fluxo - Explosão é tratado como um dano de Supremo.",
              "descriptions": []
            }
          ]
        }
      ],
      "passives": [
        {
          "key": "p1",
          "title": "Mestre do Armamento",
          "description": "O nível do Ataque Normal de seu próprio personagem aumenta 1 nivel.",
          "descriptions": []
        },
        {
          "key": "p2",
          "title": "Infinito Sem-fim",
          "description": "A duração da Interceptação de Fluxo será estendida por 8s.",
          "descriptions": []
        },
        {
          "key": "p3",
          "title": "Espada das Torrentes",
          "description": "Quando Tartaglia estiver na posição de corpo-a-corpo das Armas Demoníacas - Marés Raivosas, ou se seus Ataques Normais ou Carregados causarem Dano Critico, eles aplicarão o efeito de Interceptação de Fluxo no inimigo acertado.",
          "descriptions": []
        }
      ],
      "constellations": [
        {
          "key": "c1",
          "title": "Armas Demoniacas: Ondas Calmas",
          "description": "Diminui a Recarga de Legado do Mal: Ondas de Fúria por 20%.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c2",
          "title": "Armas Demoniacas: Submarino",
          "description": "Quando os inimigos afetados pela Interceptacão de Fluxo forem derrotados, Tartaglia ganha 4 de Energia Elemental.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c3",
          "title": "Caos Abissal: Vórtice da Turbulência",
          "description": "Aumenta o nivel de Legado do Mal: Ondas de Fúria em 3. O nivel máximo de elevação é 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c4",
          "title": "Caos Abissal: Hydroexplosão",
          "description": "Quando Interceptação de Fluxo é infligida por Tartaglia a cada 4s, se Tartaglia estiver na posição corpo-a-corpo de Legado do Mal - Ondas de Fúria ativa Interceptação de Fluxo: Corte. Caso contrario, ativa Dano da Interceptação de Fluxo Instantâneo. A Interceptação de Fluxo Corte e Interceptação de Fluxo - Instantâneo não têm limitações de intervalo de ativação e não são afetados por outro intervalo de ativação.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c5",
          "title": "Devastação: Lamina Sem Forma",
          "description": "Aumenta o nivel da  Devastação: Obliteração em 3. O nivel máximo de elevação é 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c6",
          "title": "Devastação: Aniquilação",
          "description": "Quando Devastação: Obliteração é lançada na Posição Corpo-a-Corpo, o Tempo de Recarga de Legado do Mal - Ondas de Fúria termina imediatamente. Esse efeito só acontecerá quando Tartaglia retornar à sua Posição à Distancia.",
          "secondDescription": null,
          "descriptions": []
        }
      ]
    },
    {
      "key": "Traveler (Anemo)",
      "name": "Traveler (Anemo)",
      "description": "Um viajante de outro mundo que teve sua ente querida levada e foi forçado a embarcar em uma jornada em busca dos sete",
      "skills": [
        {
          "key": "s1",
          "title": "Foreign Ironwind",
          "description": null,
          "abilities": [
            {
              "key": "a1",
              "description": "Performs up to 5 consecutive strikes.",
              "descriptions": []
            },
            {
              "key": "a2",
              "description": "Consumes a certain amount of Stamina to unleash 2 rapid sword strikes.",
              "descriptions": []
            },
            {
              "key": "a3",
              "description": "Plunges from mid-air to strike the ground below, damaging enemies along the path and dealing AoE DMG upon impact.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s2",
          "title": "Palm Vortex",
          "description": "Grasping the wind’s might, you form a vortex of vacuum in your palm, causing continuous Anemo DMG to enemies in front of you. The vacuum vortex explodes when the skill duration ends, causing a greater amount of Anemo DMG over a larger area.",
          "abilities": [
            {
              "key": "a1",
              "description": "DMG and AoE will gradually increase",
              "descriptions": []
            },
            {
              "key": "a2",
              "description": "If the vortex comes in contact with Hydro/Pyro/Cryo/Electro elements, it will deal additional elemental DMG of that type. Elemental Absorption may only occur once per use.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s3",
          "title": "Gust Surge",
          "description": "Guiding the path of the wind currents, you summon a forward-moving tornado that pulls objects and opponents towards itself, dealing continuous Anemo DMG.",
          "abilities": [
            {
              "key": "a1",
              "description": "If the tornado comes in contact with Hydro/Pyro/Cryo/Electro elements, it will deal additional elemental DMG of that type. Elemental Absorption may only occur once per use.",
              "descriptions": []
            }
          ]
        }
      ],
      "passives": [
        {
          "key": "p2",
          "title": "Slitting Wind",
          "description": "The last hit of a Normal Attack combo unleashes a wind blade, dealing 60% of ATK as Anemo DMG to all opponents in its path.",
          "descriptions": []
        },
        {
          "key": "p3",
          "title": "Second Wind",
          "description": "Palm Vortex kills renegerate 2% HP for 5s. This effect can only occur once every 5s.",
          "descriptions": []
        }
      ],
      "constellations": [
        {
          "key": "c1",
          "title": "Vórtice da Fúria",
          "description": "A Palma da Vórtice puxa os inimigos e objetos dentro de um raio de 5 metros.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c2",
          "title": "Turbilhão da Revolta",
          "description": "Aumenta a Recarga da Energia em 16%.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c3",
          "title": "Rajada Arrebatadora",
          "description": "Aumenta o nível das Ondas de Rajadas em 3. O nível de elevação é 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c4",
          "title": "Brisa Protetora",
          "description": "Reduz o Dano recebido enquanto lança a Vórtice da Palma em 10%.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c5",
          "title": "Vórtice Stellaris",
          "description": "Aumenta o nível do Vórtice da Palma em 3. O nível de elevação é 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c6",
          "title": "Ventos Entrelaçados",
          "description": "Os alvos que recebem Dano de Ondas de Rajadas possuem sua RES Anemo reduzido em 20%. Se ocorrer uma Absorção ELementa, então sua RES do Elemento correspondente tamém diminuirá 20%.",
          "secondDescription": null,
          "descriptions": []
        }
      ]
    },
    {
      "key": "Traveler (Geo)",
      "name": "Traveler (Geo)",
      "description": "A traveler from another world who had their only kin taken away, forcing them to embark on a journey to find The Seven.",
      "skills": [
        {
          "key": "s1",
          "title": "Foreign Rockblade",
          "description": null,
          "abilities": [
            {
              "key": "a1",
              "description": "Performs up to 5 consecutive strikes.",
              "descriptions": []
            },
            {
              "key": "a2",
              "description": "Consumes a certain amount of Stamina to unleash 2 rapid sword strikes.",
              "descriptions": []
            },
            {
              "key": "a3",
              "description": "Plunges from mid-air to strike the ground below, damaging enemies along the path and dealing AoE DMG upon impact.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s2",
          "title": "Starfell Sword",
          "description": "You disgorge a meteorite from the depths of the earth, dealing AoE Geo DMG. The meteorite is considered a Geo Construct, and can be climbed or used to block attacks.",
          "abilities": [
            {
              "key": "a1",
              "description": "The skill’s positioning may be adjusted.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s3",
          "title": "Wake of Earth",
          "description": "Energizing the Geo elements deep underground, you set off expanding shockwaves. Launches surrounding enemies back and deals AoE Geo DMG. A stone wall is erected at the edges of the shockwave. The stone wall is considered a Geo Construct, and may be used to block attacks.",
          "abilities": []
        }
      ],
      "passives": [
        {
          "key": "p2",
          "title": "Shattered Darkrock",
          "description": "Reduces Starfell Sword’s CD by 2s.",
          "descriptions": []
        },
        {
          "key": "p3",
          "title": "Frenzied Rockslide",
          "description": "The final hit of a Normal Attack combo triggers a collapse, dealing 60% of ATK as AoE Geo DMG.",
          "descriptions": []
        }
      ],
      "constellations": [
        {
          "key": "c1",
          "title": "Invincible Stonewall",
          "description": "Allies within the radius of Wake of Earth have their CRIT Rate increased by 10% and have increased resistance against interruption.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c2",
          "title": "Rockcore Meltdown",
          "description": "When the meteorite created by Starfell Sword is destroyed, it will also explode, dealing additional AoE Geo DMG equal to the amount of damage dealt by Starfell Sword.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c3",
          "title": "Will of the Rock",
          "description": "Increases the Level of Wake of Earth by 3. Maximum upgrade level is 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c4",
          "title": "Reaction Force",
          "description": "The shockwave triggered by Wake of Earth regenerates 5 Energy for every enemy hit. A maximum of 25 Energy can be recovered in this manner at any one time.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c5",
          "title": "Meteorite Impact",
          "description": "Increase the Level of Starfell Sword by 3. Maximum upgrade level is 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c6",
          "title": "Everlasting Boulder",
          "description": "The barrier created by Wake of Earth lasts 5s longer. The meteorite created by Starfell Sword lasts 10s longer.",
          "secondDescription": null,
          "descriptions": []
        }
      ]
    },
    {
      "key": "Venti",
      "name": "Venti",
      "description": "Um dos muitos bardos de Mondstadt, que vagueia livremente pelas ruas e becos da cidade.",
      "skills": [
        {
          "key": "s1",
          "title": "Divine Marksmanship",
          "description": null,
          "abilities": [
            {
              "key": "a1",
              "description": "Performs up to 6 consecutive shots with a bow.",
              "descriptions": []
            },
            {
              "key": "a2",
              "description": "Perform a more precise Aimed Shot with increased DMG. While aiming, favorable winds will accumulate on the arrowhead. A fully charged arrow will deal Anemo DMG.",
              "descriptions": []
            },
            {
              "key": "a3",
              "description": "Fires off a shower of arrows in mid-air before falling and striking the ground, dealing AoE DMG upon impact.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s2",
          "title": "Skyward Sonnet",
          "description": "O wind upon which all hymns and songs fly, bear these earth-walkers up into the sky!",
          "abilities": [
            {
              "key": "a1",
              "description": "Summons a Wind Domain at the enemy’s location, dealing AoE Anemo DMG and launching enemies into the air.",
              "descriptions": []
            },
            {
              "key": "a2",
              "description": "Summons an even larger Wind Domain with Venti as the epicenter, dealing AoE Anemo DMG and launching affected enemies into the air. After unleashing the Hold version of this ability, Venti rides the wind into the air. Enemies hit by Skyward Sonnet will fall to the ground slowly.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s3",
          "title": "Wind’s Grand Ode",
          "description": "Fires off an arrow made of countless coalesced winds, creating a huge Stormeye that sucks in objects and enemies along its path, dealing continuous Anemo DMG.",
          "abilities": [
            {
              "key": "a1",
              "description": "If the Stormeye comes into contact with Hydro/Pyro/Cryo/Electro elements, it will deal additional elemental DMG of that type. Elemental Absorption may only occur once per use.",
              "descriptions": []
            }
          ]
        }
      ],
      "passives": [
        {
          "key": "p1",
          "title": "Windrider",
          "description": "Decreases all party member’s gliding Stamina Consumption by 20%.",
          "descriptions": []
        },
        {
          "key": "p2",
          "title": "Embrace of Winds",
          "description": "Holding Skyward Sonnet creates an upcurrent that lasts for 20s.",
          "descriptions": []
        },
        {
          "key": "p3",
          "title": "Stormeye",
          "description": "Regenerates 15 Energy for Venti after the effects of Wind’s Grand Ode end. If an Elemental Absorption occurred, this also restores 15 Energy to all characters of that corresponding element.",
          "descriptions": []
        }
      ],
      "constellations": [
        {
          "key": "c1",
          "title": "Splitting Gale",
          "description": "Fires 2 additional arrows per Aimed Shot, each dealing 33% of the original arrow’s DMG.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c2",
          "title": "Breeze of Reminiscence",
          "description": "Skyward Sonnet decreases enemy Anemo RES by 12% for 10s. Enemies launched by Skyward Sonnet suffer an additional 12% Anemo RES and Physical RES decrease while airborne.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c3",
          "title": "Ode to Thousand Winds",
          "description": "Increases the Level of Wind’s Grand Ode by 3. Maximum upgrade level is 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c4",
          "title": "Hurricane of Freedom",
          "description": "When Venti picks up an Elemental Orb or Particle, he receives a 25% Anemo DMG Bonus for 10s.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c5",
          "title": "Concierto dal Cielo",
          "description": "Increase the Level of Skyward Sonnet by 3. Maximum upgrade level is 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c6",
          "title": "Storm of Defiance",
          "description": "Targets who take DMG from Wind’s Grand Ode have their Anemo RES decreased by 20%. If an Elemental Absorption occurred, then their RES towards the corresponding Element is also decreased by 20%.",
          "secondDescription": null,
          "descriptions": []
        }
      ]
    },
    {
      "key": "Xiangling",
      "name": "Xiangling",
      "description": "A renowned chef from Liyue. She’s extremely passionate about cooking and excels at making her signature hot and spicy dishes.",
      "skills": [
        {
          "key": "s1",
          "title": "Dough-Fu",
          "description": null,
          "abilities": [
            {
              "key": "a1",
              "description": "Performs up to 5 consecutive spear strikes.",
              "descriptions": []
            },
            {
              "key": "a2",
              "description": "Consumes a certain amount of Stamina to lunge forward, dealing damage to enemies along the way.",
              "descriptions": []
            },
            {
              "key": "a3",
              "description": "Plunges from mid-air to strike the ground below, damaging enemies along the path and dealing AoE DMG upon impact.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s2",
          "title": "Guoba Attack",
          "description": "Summons Guoba the Panda. Guoba continuously breathes fire, dealing AoE Pyro DMG.",
          "abilities": []
        },
        {
          "key": "s3",
          "title": "Pyronado",
          "description": "Displaying her mastery over both fire and polearms, Xiangling sends a Pyronado whirling around her. The Pyronado will move with your character for so long as the ability persists, dealing Pyro DMG to all enemies in its path.",
          "abilities": []
        }
      ],
      "passives": [
        {
          "key": "p1",
          "title": "Chef de Cuisine",
          "description": "When Xiangling cooks an ATK-boosting dish perfectly, she has a 12% chance to receive double the product.",
          "descriptions": []
        },
        {
          "key": "p2",
          "title": "Crossfire",
          "description": "Increases the flame range of Guoba by 20%.",
          "descriptions": []
        },
        {
          "key": "p3",
          "title": "Beware, It’s Super Hot!",
          "description": "When Guoba Attack’s effect ends, Guoba leaves a chili pepper on the spot where it disappeared. Picking up a chili pepper increases ATK by 10% for 10s.",
          "descriptions": []
        }
      ],
      "constellations": [
        {
          "key": "c1",
          "title": "Crispy Outside, Tender Inside",
          "description": "Enemies hit by Guoba’s attacks have their Pyro RES reduced by 15% for 6s.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c2",
          "title": "Oil Meets Fire",
          "description": "The last attack in a Normal Attack sequence applies the Implode status onto the enemy for 2s. An explosion will occur once this duration ends, dealing 75% of Xiangling’s ATK as AoE Pyro DMG.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c3",
          "title": "Deepfry",
          "description": "Increases the Level of Pyronado by 3. Maximum upgrade level is 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c4",
          "title": "Slowbake",
          "description": "Pyronado’s duration is increased by 40%.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c5",
          "title": "Guoba Mad",
          "description": "Increase the Level of Guoba Attack by 3. Maximum upgrade level is 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c6",
          "title": "Condensed Pyronado",
          "description": "For the duration of Pyronado, all party members receive a 15% Pyro DMG Bonus.",
          "secondDescription": null,
          "descriptions": []
        }
      ]
    },
    {
      "key": "Xiao",
      "name": "Xiao",
      "description": "A yaksha adeptus who defends Liyue. Also heralded as the \"Conqueror of Demons\" or \"Vigilant Yaksha.\"",
      "skills": [
        {
          "key": "s1",
          "title": "Whirlwind Thrust",
          "abilities": [
            {
              "key": "a1",
              "description": "Perform up to 6 rapid strikes.",
              "descriptions": []
            },
            {
              "key": "a2",
              "description": "Consumes a certain amount of Stamina to perform an upward thrust.",
              "descriptions": []
            },
            {
              "key": "a3",
              "description": "Plunges from mid-air to strike the ground below, damaging enemies along the path and dealing AoE DMG upon impact.\nXiao does not take DMG from performing Plunging Attacks.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s2",
          "title": "Lemniscatic Wind Cycling",
          "description": "Xiao lunges forward, dealing Anemo DMG to opponents in his path.\nCan be used in mid-air.\nStarts with 2 charges.",
          "abilities": []
        },
        {
          "key": "s3",
          "title": "Bane of All Evil",
          "description": "Xiao dons the Yaksha Mask that set gods and demons trembling millennia ago.",
          "abilities": [
            {
              "description": "Yaksha's Mask",
              "descriptions": [
                "Greatly increases Xiao's jumping ability.",
                "Increases his attack AoE and attack DMG.",
                "Converts attack DMG into Anemo DMG, which cannot be overridden by any other elemental infusion. In this state, Xiao will continuously lose HP.",
                "The effects of this skill end when Xiao leaves the field."
              ]
            }
          ]
        }
      ],
      "passives": [
        {
          "key": "p1",
          "title": "Transcension: Gravity Defier",
          "description": "Decreases climbing Stamina consumption for your own party members by 20%.\nNot stackable with Passive Talents that provide the exact same effects.",
          "descriptions": []
        },
        {
          "key": "p2",
          "title": "Conqueror of Evil: Tamer of Demons",
          "description": "While under the effects of Bane of All Evil, all DMG dealt by Xiao increases by 5%. DMG increases by a further 5% for every 3s the ability persists.\nThe maximum DMG Bonus is 25%.",
          "descriptions": []
        },
        {
          "key": "p3",
          "title": "Dissolution Eon: Heaven Fall",
          "description": "Using Lemniscatic Wind Cycling increases the DMG of subsequent uses of Lemniscatic Wind Cycling by 15%.\n This effect lasts for 7s, and has a maximum of 3 stacks. Gaining a new stack refreshes the effect's duration.",
          "descriptions": []
        }
      ],
      "constellations": [
        {
          "key": "c1",
          "title": "Dissolution Eon: Destroyer of Worlds",
          "description": "Increases Lemniscatic Wind Cycling’s charges by 1.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c2",
          "title": "Annihilation Eon: Blossom of Kaleidos",
          "description": "When in the party and not on the field, Xiao's Energy Recharge is increased by 25%.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c3",
          "title": "Conqueror of Evil: Wrath Deity",
          "description": "Increases the Level of Lemniscatic Wind Cycling by 3. Maximum upgrade level is 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c4",
          "title": "Transcension: Extinction of Suffering",
          "description": "When Xiao's HP falls below 50%, he gains a 100% DEF Bonus.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c5",
          "title": "Evolution Eon: Origin of Ignorance",
          "description": "Increase the Level of Bane of All Evil by 3. Maximum upgrade level is 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c6",
          "title": "Conqueror of Evil: Guardian Yaksha",
          "description": "While under the effects of Bane of All Evil, hitting at least 2 opponents with Xiao's Plunging Attack will immediately grant him 1 charge of Lemniscatic Wind Cycling, and for the next 1s, he may use Lemniscatic Wind Cycling while ignoring its CD.",
          "secondDescription": null,
          "descriptions": []
        }
      ]
    },
    {
      "key": "Xingqiu",
      "name": "Xingqiu",
      "description": "Um jovem carregando uma espada longa que frequentemente visto em estantes de livros. Ele tem um coração de ouro e anseia por justiça e equidade para todos.",
      "skills": [
        {
          "key": "s1",
          "title": "Guhua Style",
          "description": null,
          "abilities": [
            {
              "key": "a1",
              "description": "Performs up to 5 consecutive spear strikes.",
              "descriptions": []
            },
            {
              "key": "a2",
              "description": "Consumes a certain amount of Stamina to unleash 2 rapid sword strikes.",
              "descriptions": []
            },
            {
              "key": "a3",
              "description": "Plunges from mid-aur to strike the ground below, damaging enemies along the path and dealing AoE DMG upon impact.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s2",
          "title": "Guhua Sword - Fatal Rainscreen",
          "description": "Xingqiu performs twin strikes with his sword, dealing Hydro DMG. At the same time, this ability creates the maximum number of Rain Swords, which will orbit the character. 20% of Xingqiu’s Hydro DMG Bonus will be converted to additional DMG Reduction for the Rain Swords. The maximum amount of additional DMG Reduction that can be gained this way is 24%. The initial maximum number of Rain Swords is 3. Using this ability applies the Wet status onto the character.",
          "abilities": [
            {
              "name": "",
              "description": "The Rain Swords have the following properties:",
              "descriptions": [
                "When a character takes DMG, the Rain Sword will shatter, reducing the amount of DMG taken.",
                "Increases the character’s resistance to interruption."
              ]
            }
          ]
        },
        {
          "key": "s3",
          "title": "Guhua Sword - Raincutter",
          "description": "Initiate Rainbow Bladework and fight using an illusory sword rain, while creating the maximum number of Rain Swords.",
          "abilities": [
            {
              "name": "Rainbow Bladework",
              "description": "These effects carry over to other characters.",
              "descriptions": [
                "Normal Attacks will trigger consecutive sword rain attacks, dealing Hydro DMG.",
                "Rain Swords will remain at the maximum number throughout the ability’s duration."
              ]
            }
          ]
        }
      ],
      "passives": [
        {
          "key": "p1",
          "title": "Flash of Genius",
          "description": "When Xingqiu crafts Character Talent Materials, he has a 25% chance to refund a portion of the crafting materials used.",
          "descriptions": []
        },
        {
          "key": "p2",
          "title": "Hydropathic",
          "description": "When a Rain Sword is shattered or when its duration expires, it regenerates the current character’s HP based on 6% of Xingqiu’s Max HP.",
          "descriptions": []
        },
        {
          "key": "p3",
          "title": "Blades Amidst Raindrops",
          "description": "Xingqiu gains a 20% Hydro DMG Bonus.",
          "descriptions": []
        }
      ],
      "constellations": [
        {
          "key": "c1",
          "title": "The Scent Remained",
          "description": "Increases the maximum number of Rain Swords by 1.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c2",
          "title": "Rainbow Upon the Azure Sky",
          "description": "Extends the duration of Guhua Sword - Raincutter by 3s. Decreases the Hydro RES of enemies hit by sword rain attacks by 15% for 4s.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c3",
          "title": "Weaver of Verses",
          "description": "Increases the Level of Guhua Sword - Raincutter by 3. Maximum upgrade level is 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c4",
          "title": "Evilsoother",
          "description": "Throughout the duration of Guhua Sword: Raincutter, the DMG dealt by Guhua Sword: Fatal Rainscreen is increased by 50%.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c5",
          "title": "Embrace of Rain",
          "description": "Increase the Level of Guhua Sword - Fatal Rainscreen by 3. Maximum upgrade level is 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c6",
          "title": "Hence, Call Them My Own Verses",
          "description": "Activating 2 of Guhua Sword - Raincutter’s sword rain attacks greatly increases the DMG of the third. Xingqiu regenerates 3 Energy when sword rain attacks hit enemies.",
          "secondDescription": null,
          "descriptions": []
        }
      ]
    },
    {
      "key": "Xinyan",
      "name": "Xinyan",
      "description": "A única roqueira do Porto de Liyue, ela usa sua música e canções apaixonadas para resistir aos preconceitos.",
      "skills": [
        {
          "key": "s1",
          "title": "Dance on Fire",
          "description": null,
          "abilities": [
            {
              "key": "a1",
              "description": "Performs up to 4 consecutive strikes.",
              "descriptions": []
            },
            {
              "key": "a2",
              "description": "Drains Stamina over time to perform continuous spinning attacks against all nearby enemies. At the end of the sequence, perform a more powerful slash.",
              "descriptions": []
            },
            {
              "key": "a3",
              "description": "Plunges from mid-air to strike the ground, damaging enemies along the path and dealing AoE DMG upon impact.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s2",
          "title": "Sweeping Fervor",
          "description": "Xinyan brandishes her instrument, dealing Pyro DMG on nearby enemies, forming a shield made out of her audience’s passion.",
          "abilities": [
            {
              "name": "",
              "description": "The shield’s DMG Absorption scales based on Xinyan’s DEF and on the number of enemies hit:",
              "descriptions": [
                "Hitting 0-1 enemies grants Shield Level 1: Ad Lib.",
                "Hitting 2 enemies grants Shield Level 2: Lead-In.",
                "Hitting 3 or more enemies grants Shield Level 3: Rave, which will also deal intermittent Pyro DMG to nearby enemies."
              ]
            },
            {
              "name": "",
              "description": "The shield has the following special properties:",
              "descriptions": [
                "When unleashed, it infuses Xinyan with Pyro.",
                "It has 250% DMG Absorption effectiveness against Pyro DMG."
              ]
            }
          ]
        },
        {
          "key": "s3",
          "title": "Riff Revolution",
          "description": "Strumming rapidly, Xinyan launches nearby enemies and deals Physical DMG to them, hyping up the crowd. The sheer intensity of the atmosphere will cause explosions that deal Pyro DMG to nearby enemies.",
          "abilities": []
        }
      ],
      "passives": [
        {
          "key": "p1",
          "title": "A Rad Recipe",
          "description": "When a Perfect Cooking is achieved on an DEF-boosting dish, Xinyan has a 12% chance to obtain double the product.",
          "descriptions": []
        },
        {
          "key": "p2",
          "title": "\"The Show Goes On, Even Without an Audience...\"",
          "description": "Decreases the number of enemies Sweeping Fervor must hit to trigger each level of shielding.",
          "descriptions": [
            "Shield Level 2: Lead-In requirement reduced to 1 enemy hit.",
            "Shield Level 3: Rave requirement reduced to 2 enemies hit or more."
          ]
        },
        {
          "key": "p3",
          "title": "\"...Now That’s Rock ’N’ Roll!\"",
          "description": "Characters shielded by Sweeping Fervor deal 15% increased Physical DMG.",
          "descriptions": []
        }
      ],
      "constellations": [
        {
          "key": "c1",
          "title": "Fatal Acceleration",
          "description": "Upon scoring a CRIT hit, increases ATK SPD of Xinyan’s Normal and Charged Attacks by 12% for 5s. Can only occur once every 5s.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c2",
          "title": "Impromptu Opening",
          "description": "Riff Revolution Physical DMG has its Crit rate increased by 100%, and will form a shield at Shield Level 3: Rave when cast.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c3",
          "title": "Double Stop",
          "description": "Increases the Level of Sweeping Fervor by 3. Maximum upgrade level is 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c4",
          "title": "Wildfire Rhythm",
          "description": "Sweeping Fervor’s swing DMG decrease opponents Physical RES by 15% for 12s.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c5",
          "title": "Screamin’ for an Encore",
          "description": "Increases the Level of Riff Revolution by 3. Maximum upgrade level is 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c6",
          "title": "Rockin’ in a Flaming World",
          "description": "Decrease the stamina consumption of Xinyan Charged Attacks by 30%. Additionally, Xinyan Charged Attack gain an ATK bonus equal to 50% of her DEF.",
          "secondDescription": null,
          "descriptions": []
        }
      ]
    },
    {
      "key": "Zhongli",
      "name": "Zhongli",
      "description": "Um convidado misterioso da Funerária Wangsheng. Sabe de muita coisa.",
      "skills": [
        {
          "key": "s1",
          "title": "Rain of Stone",
          "description": null,
          "abilities": [
            {
              "key": "a1",
              "description": "Performs up to 6 consecutive spear strikes.",
              "descriptions": []
            },
            {
              "key": "a2",
              "description": "Consumes a certain amount of Stamina to lunge forward, causing stone spears to fall along his path.",
              "descriptions": []
            },
            {
              "key": "a3",
              "description": "Plunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s2",
          "title": "Dominus Lapidis",
          "description": "Every mountain, rock and inch of land is filled with the power of Geo, but those who can wield such powers freely are few and far between.",
          "abilities": [
            {
              "key": "a1",
              "description": "Commands the power of earth to create a Stone Stele.",
              "descriptions": []
            },
            {
              "key": "a2",
              "description": "Causes nearby Geo energy to explode, causing the following effects:",
              "descriptions": [
                "If their maximum number hasn't been reached, creates a Stone Stele.",
                "Creates a shield of jade. The shield's DMG Absorption scales based on Zhongli's Max HP.",
                "Deals AoE Geo DMG.",
                "If there are nearby targets with the Geo element, it will drain a large amount of Geo element from a maximum of 2 such targets. This effect does not cause DMG."
              ]
            },
            {
              "name": "Stone Stele",
              "description": "When created, deals AoE Geo DMG.\nAdditionally, it will intermittently resonate with other nearby Geo constructs, dealing Geo DMG to nearby opponents.\n1The Stone Stele is considered a Geo construct that can both be climbed and used to block attacks.\nOnly one Stele created by Zhongli himself may initially exist at any one time",
              "descriptions": []
            },
            {
              "name": "Jade Shield",
              "description": "Possesses 150% DMG Absorption against all Elemental and Physical DMG.\nCharacters protected by the Jade Shield will decrease the Elemental RES and Physical RES of opponents in a small AoE by 20%. This effect cannot be stacked.",
              "descriptions": []
            }
          ]
        },
        {
          "key": "s3",
          "title": "Planet Befall",
          "description": "Brings a falling meteor down to earth, dealing massive Geo DMG to opponents caught in its AoE and applying the Petrification status to them.",
          "abilities": [
            {
              "name": "Petrification",
              "description": "Opponents affected by the Petrification status cannot move.",
              "descriptions": []
            }
          ]
        }
      ],
      "passives": [
        {
          "key": "p1",
          "title": "Arcanum of Crystal",
          "description": "Refunds 15% of the ores used when crafting Polearm-type weapons.",
          "descriptions": []
        },
        {
          "key": "p2",
          "title": "Resonant Waves",
          "description": "When the Jade Shield takes DMG, it will Fortify:",
          "descriptions": [
            "Fortified characters have 5% increased Shield Strength.",
            "Can stack up to 5 times, and lasts until the Jade Shield disappears."
          ]
        },
        {
          "key": "p3",
          "title": "Dominance of Earth",
          "description": "Zhongli deals bonus DMG based on his Max HP:",
          "descriptions": [
            "Normal Attack, Charged Attack, and Plunging Attack DMG is increased by 1.39% of Max HP.",
            "Dominus Lapidis' Stone Stele, resonance, and hold DMG is increased by 1.9% of Max HP.",
            "Planet Befall's DMG is increased by 33% of Max HP."
          ]
        }
      ],
      "constellations": [
        {
          "key": "c1",
          "title": "Rock, the Backbone of Earth",
          "description": "Increases the maximum number of Stone Steles created by Dominus Lapidis that may exist simultaneously by 2.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c2",
          "title": "Stone, the Cradle of Jade",
          "description": "Planet Befall grants nearby characters on the field a Jade Shield when it descends.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c3",
          "title": "Jade, Shimmering through Darkness",
          "description": "Increases the Level of Dominus Lapidis by 3. Maximum upgrade level is 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c4",
          "title": "Topaz, Unbreakable and Fearless",
          "description": "Increases Planet Befall’s AoE by 20% and increases the duration of Planet Befall’s Petrification effect by 2s.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c5",
          "title": "Lazuli, Herald of the Order",
          "description": "Increase the Level of Planet Befall by 3. Maximum upgrade level is 15.",
          "secondDescription": null,
          "descriptions": []
        },
        {
          "key": "c6",
          "title": "Chrysos, Bounty of Dominator",
          "description": "When the Jade Shield takes DMG, 40% of that incoming DMG is converted to HP for the current character.\nA single instance of regeneration cannot exceed 8% of that character’s Max HP.",
          "secondDescription": null,
          "descriptions": []
        }
      ]
    }
  ],
  "weapons": [
    {
      "key": "Hunter’s Bow",
      "name": "Hunter’s Bow",
      "description": "A hunter’s music consists of but two sounds: the twang of the bowstring and the whoosh of soaring arrows.",
      "refinement": null
    },
    {
      "key": "Seasoned Hunter’s Bow",
      "name": "Seasoned Hunter’s Bow",
      "description": "A bow that has been well-polished by time and meticulously cared for by its owner. It feels almost like an extension of the archer’s arm.",
      "refinement": null
    },
    {
      "key": "Ebony Bow",
      "name": "Ebony Bow",
      "description": "A longbow made of ebony wood with stiffer limbs than ordinary bows. It is also a far more powerful weapon.",
      "refinement": "Increases DMG against mechanoid Ruin enemies by {{0}}%"
    },
    {
      "key": "Messenger",
      "name": "Messenger",
      "description": "A basic wooden bow. It is said to have once been used as a tool for long-distance communication.",
      "refinement": "Charged Attack hits on weak points deal an additional {{0}}% ATK DMG as CRIT DMG. Can only occur once every 10s."
    },
    {
      "key": "Raven Bow",
      "name": "Raven Bow",
      "description": "Ravens are known to be the ferrymen of the dead. This bow’s limb is decorated with raven feathers, which forebode the imminent death of its target.",
      "refinement": "Increases DMG against enemies affected by Hydro or Pyro by {{0}}%"
    },
    {
      "key": "Recurve Bow",
      "name": "Recurve Bow",
      "description": "It is said that this bow can shoot down eagles in flight, but ultimately how true that is depends on the skill of the archer.",
      "refinement": "Defeating an opponent restores {{0}}% HP"
    },
    {
      "key": "Sharpshooter’s Oath",
      "name": "Sharpshooter’s Oath",
      "description": "This superior bow once belonged to a master archer. However, it gives off a strong scent, thus making it unsuitable for hunting.",
      "refinement": "Increases DMG against weak spots by {{0}}%"
    },
    {
      "key": "Slingshot",
      "name": "Slingshot",
      "description": "A bow, despite the name. After countless experiments and improvements to the design, the creator of the ultimate slingshot found himself to have made what was actually a bow.",
      "refinement": "If a Normal or Charged Attack hits a target within 0.3s of being fired, increases DMG by {{0}}%. Otherwise, decreases DMG by 10%."
    },
    {
      "key": "The Stringless",
      "name": "The Stringless",
      "description": "A bow that once served as an extraordinary instrument. It is no longer capable of getting people up and dancing.",
      "refinement": "Increases Elemental Skill and Elemental Burst DMG by {{0}}%."
    },
    {
      "key": "Alley Hunter",
      "name": "Alley Hunter",
      "description": "An intricate, opulent longbow. It once belonged to a gentleman thief who was never caught.",
      "refinement": "While the character equipped with this weapon is in the party but not on the field, their DMG increases by {{0}}% every second up to a max of {{1}}%. When the character is on the field for more than 4s, the aforementioned DMG buff decreases by {{2}}% per second until it reaches 0%."
    },
    {
      "key": "Blackcliff Warbow",
      "name": "Blackcliff Warbow",
      "description": "A bow made of blackcliff that features extremely sturdy bow limbs. It requires an archer with a strong bow arm to use.",
      "refinement": "After defeating an enemy, ATK is increased by {{0}}% for 30s. This effect has a maximum of 3 stacks, and the duration of each stack is independent of the others."
    },
    {
      "key": "Compound Bow",
      "name": "Compound Bow",
      "description": "An exotic metallic bow from a distant land. Though extremely difficult to maintain, it is easy to nock and fires with tremendous force.",
      "refinement": "Normal Attack and Charged Attack hits increase ATK by {{0}}% and Normal ATK SPD by {{1}}% for 6s. Max 4 stacks. Can only occur once every 0.3s."
    },
    {
      "key": "Favonius Warbow",
      "name": "Favonius Warbow",
      "description": "A standard-issue recurve bow of the Knights of Favonius. Only the best archers can unleash its full potential.",
      "refinement": "CRIT Hits have a {{0}}% chance to generate a small amount of Elemental Particles, which will regenerate 6 Energy for the character. Can only occur once every {{1}}s."
    },
    {
      "key": "Prototype Crescent",
      "name": "Prototype Crescent",
      "description": "A prototype longbow discovered in the Blackcliff Forge. The arrow fired from this bow glimmers like a ray of moonlight.",
      "refinement": "Charged Attack hits on weak points increase Movement SPD by 10% and ATK by {{0}}% for 10s."
    },
    {
      "key": "Royal Bow",
      "name": "Royal Bow",
      "description": "An old royal longbow that belonged to the erstwhile rulers of Mondstadt. Countless generations later, the bowstring is still tight and can still fire arrows with great force.",
      "refinement": "Upon damaging an opponent, increases CRIT Rate by {{0}}%. Max 5 stacks. A CRIT hit removes all stacks."
    },
    {
      "key": "Rust",
      "name": "Rust",
      "description": "A completely rusted iron greatbow. The average person would lack the strength to even lift it, let alone fire it.",
      "refinement": "Increases Normal Attack DMG by {{0}}% but decreases Charged Attack DMG by 10%."
    },
    {
      "key": "Sacrificial Bow",
      "name": "Sacrificial Bow",
      "description": "A ceremonial hunting bow that has become petrified over time. The trinkets on it are still visible. It grants the wielder the power to withstand the winds of time.",
      "refinement": "After damaging an opponent with an Elemental Skill, the skill has a {{0}}% chance to end its own CD. Can only occur once every {{1}}s"
    },
    {
      "key": "The Viridescent Hunt",
      "name": "The Viridescent Hunt",
      "description": "A pure green hunting bow. This once belonged to a certain hunter whose home was the forest.",
      "refinement": "Upon hit, Normal and Aimed Shot Attacks have a 50% chance to generate a Cyclone, which will continuously attract surrounding enemies, dealing {{0}}% of ATK as DMG to these enemies every 0.5s for 4s. This effect can only occur once every {{1}}s"
    },
    {
      "key": "Skyward Harp",
      "name": "Skyward Harp",
      "description": "A greatbow that symbolizes Dvalin’s affiliation with the Anemo Archon. The sound of the bow firing is music to the Anemo Archon’s ears. It contains the power of the sky and wind within.",
      "refinement": "Increases CRIT DMG by {{0}}%. Hits have a {{1}}% chance to inflict a small AoE attack, dealing 125% Physical ATK DMG. Can only occur once every {{2}}s."
    },
    {
      "key": "Amos’ Bow",
      "name": "Amos’ Bow",
      "description": "An extremely ancient bow that has retained its power despite its original master being long gone. It draws power from everyone and everything in the world, and the further away you are from that which your heart desires, the more powerful it is.",
      "refinement": "Increases Normal and Charged Attack DMG by {{0}}%. Normal and Charged Attack DMG increases by {{1}}% every 0.1s for up to 5 times."
    },
    {
      "key": "Dreams of Dragonfell",
      "name": "Dreams of Dragonfell",
      "description": "A great bow that once shot clean through a giant dragon. Once released, the impetus of its bowstring resembles a peal of thunder.",
      "refinement": "Increases Shield Strength by {{0}}%. Scoring hits on opponents increases ATK by {{1}}% for 8s. Max 5 stacks. Can only occur once every 0.3s. While protected by a shield, this ATK increase effect is increased by 100%."
    },
    {
      "key": "Dull Blade",
      "name": "Dull Blade",
      "description": "Youthful dreams and the thrill of adventure. If this isn’t enough, then make it up with valiance.",
      "refinement": null
    },
    {
      "key": "Silver Sword",
      "name": "Silver Sword",
      "description": "A sword for exorcising demons. Everyone knows it’s made of a silver alloy, not pure silver.",
      "refinement": null
    },
    {
      "key": "Cool Steel",
      "name": "Cool Steel",
      "description": "A reliable steel-forged weapon that serves as a testament to the great adventures of its old master.",
      "refinement": "Increases DMG against enemies affected by Hydro or Cryo by {{0}}%"
    },
    {
      "key": "Dark Iron Sword",
      "name": "Dark Iron Sword",
      "description": "A perfectly ordinary iron sword, just slightly darker than most.",
      "refinement": "Upon causing an Overloaded, Superconduct, Electro-Charged, or an Electro-infused Swirl reaction, ATK is increased by {{0}}% for 12s."
    },
    {
      "key": "Fillet Blade",
      "name": "Fillet Blade",
      "description": "A sharp filleting knife. The blade is long, thin, and incredibly sharp.",
      "refinement": "On hit, has a 50% chance to deal {{0}}% ATK DMG to a single enemy. Can only occur once every {{1}}s."
    },
    {
      "key": "Harbinger of Dawn",
      "name": "Harbinger of Dawn",
      "description": "A sword that once shone like the sun. The wielder of this sword will be blessed with a \"feel-good\" buff. The reflective material on the blade has long worn off.",
      "refinement": "When HP is above 90%, increases CRIT Rate by {{0}}%."
    },
    {
      "key": "Skyrider Sword",
      "name": "Skyrider Sword",
      "description": "A reliable steel sword. The legendary Skyrider once tried to ride it as a flying sword...",
      "refinement": "Using an Elemental Burst grants a {{0}}% increase in ATK and Movement SPD for 15s."
    },
    {
      "key": "Traveler’s Handy Sword",
      "name": "Traveler’s Handy Sword",
      "description": "A handy steel sword which contains scissors, a magnifying glass, tinder, and other useful items in its sheath.",
      "refinement": "Each Elemental Orb or Particle collected restores {{0}}% HP."
    },
    {
      "key": "Blackcliff Longsword",
      "name": "Blackcliff Longsword",
      "description": "A sword made of a material known as \"blackcliff.\" It has a dark crimson glow on its black blade.",
      "refinement": "After defeating an enemy, ATK is increased by {{0}}% for 30s. This effect has a maximum of 3 stacks, and the duration of each stack is independent of the others."
    },
    {
      "key": "Favonius Sword",
      "name": "Favonius Sword",
      "description": "A standard-issue longsword of the Knights of Favonius. When you’re armed with this agile and sharp weapon, channeling the power of the elements has never been so easy!",
      "refinement": "CRIT Hits have a {{0}}% chance to generate a small amount of Elemental Particles, which will regenerate 6 Energy for the character. Can only occur once every {{1}}s."
    },
    {
      "key": "Iron Sting",
      "name": "Iron Sting",
      "description": "An exotic long-bladed rapier that somehow found its way into Liyue via foreign traders. It is light, agile, and sharp.",
      "refinement": "Dealing Elemental DMG increases all DMG by {{0}}% for 6s. Max 2 stacks. Can occur once every 1s."
    },
    {
      "key": "Lion’s Roar",
      "name": "Lion’s Roar",
      "description": "A sharp blade with extravagant carvings that somehow does not compromise on durability and sharpness. It roars like a lion as it cuts through the air.",
      "refinement": "Increases DMG against enemies affected by Pyro or Electro by {{0}}%"
    },
    {
      "key": "Prototype Rancour",
      "name": "Prototype Rancour",
      "description": "An ancient longsword discovered in the Blackcliff Forge that cuts through rocks like a hot knife through butter.",
      "refinement": "On hit, Normal or Charged Attacks increase ATK and DEF by {{0}}% for 6s. Max 4 stacks. This effect can only occur once every 0.3s."
    },
    {
      "key": "Royal Longsword",
      "name": "Royal Longsword",
      "description": "An old longsword that belonged to the erstwhile rulers of Mondstadt. Exquisitely crafted, the carvings and embellishments testify to the stature of its owner.",
      "refinement": "Upon damaging an opponent, increases CRIT Rate by {{0}}%. Max 5 stacks. A CRIT hit removes all stacks."
    },
    {
      "key": "Sacrificial Sword",
      "name": "Sacrificial Sword",
      "description": "A ceremonial sword that has become petrified over time. The trinkets on it are still visible. It grants the wielder the power to withstand the winds of time.",
      "refinement": "After damaging an opponent with an Elemental Skill, the skill has a {{0}}% chance to end its own CD. Can only occur once every {{1}}s"
    },
    {
      "key": "The Alley Flash",
      "name": "The Alley Flash",
      "description": "A straight sword as black as the night. It once belonged to a thief who roamed the benighted streets.",
      "refinement": "Increases DMG dealt by the character equipping this weapon by {{0}}%. Taking DMG disables this effect for 5s."
    },
    {
      "key": "The Black Sword",
      "name": "The Black Sword",
      "description": "A pitch-black longsword that thirsts for violence and conflict. It is said that this weapon can cause its user to become drunk on the red wine of slaughter.",
      "refinement": "Increases DMG dealt by Normal and Charged Attacks by {{0}}%. Additionally, regenerates {{1}}% of ATK as HP when Normal and Charged Attacks score a CRIT Hit. This effect can occur once every 5s."
    },
    {
      "key": "The Flute",
      "name": "The Flute",
      "description": "Beneath its rusty exterior is a lavishly decorated thin blade. It swings as swiftly as the wind.",
      "refinement": "Normal or Charged Attacks grant a Harmonic on hits. Gaining 5 Harmonics triggers the power of music and deals {{0}}% ATK DMG to surrounding enemies. Harmonics last up to 30s, and a maximum of 1 can be gained every 0.5s."
    },
    {
      "key": "Sword of Descension",
      "name": "Sword of Descension",
      "description": "A sword of unique craftsmanship. It does not appear to belong to this world.",
      "refinement": "Hitting opponents with Normal and Charged Attacks grants a {{0}}% chance to deal 200% ATK as DMG in a small AoE. This effect can only occur once every 10s. Additionally, if the Traveler equips the Sword of Descension, their ATK is increased by {{1}}."
    },
    {
      "key": "Festering Desire",
      "name": "Festering Desire",
      "description": "A creepy straight sword that almost seems to yearn for life. It drips with a shriveling venom that could even corrupt a mighty dragon.",
      "refinement": "Increases Elemental Skill DMG by {{0}}% and Elemental Skill CRIT Rate by {{1}}%."
    },
    {
      "key": "Aquila Favonia",
      "name": "Aquila Favonia",
      "description": "The soul of the Knights of Favonius. Millennia later, it still calls on the winds of swift justice to vanquish all evil  just like the last heroine who wielded it.",
      "refinement": "ATK is increased by {{0}}%. Triggers on taking DMG: the soul of the Falcon of the West awakens, holding the banner of resistance aloft, regenerating HP equal to {{1}}% of ATK and dealing {{2}}% of ATK as DMG to surrounding enemies. This effect can only occur once every 15s."
    },
    {
      "key": "Skyward Blade",
      "name": "Skyward Blade",
      "description": "The sword of a knight that symbolizes the restored honor of Dvalin. The blessings of the Anemo Archon rest on the fuller of the blade, imbuing the sword with the powers of the sky and the wind.",
      "refinement": "CRIT Rate increased by {{0}}%. Gains Skypiercing Might upon using an Elemental Burst: Increases Movement SPD by 10%, increases ATK SPD by 10%, and increases the DMG of Normal and Charged Attack hits by {{1}}% for 12s."
    },
    {
      "key": "Summit Shaper",
      "name": "Summit Shaper",
      "description": "A symbol of a legendary pact, this sharp blade once cut off the peak of a mountain.",
      "refinement": "Increases Shield Strength by {{0}}%. Scoring hits on opponents increases ATK by {{1}}% for 8s. Max 5 stacks. Can only occur once every 0.3s. While protected by a shield, this ATK increase effect is increased by 100%."
    },
    {
      "key": "Apprentice’s Notes",
      "name": "Apprentice’s Notes",
      "description": "Notes left behind by a top student. Many useful spells are listed, and the handwriting is beautiful.",
      "refinement": null
    },
    {
      "key": "Pocket Grimoire",
      "name": "Pocket Grimoire",
      "description": "A carefully compiled notebook featuring the essentials needed to pass a magic exam.",
      "refinement": null
    },
    {
      "key": "Amber Bead",
      "name": "Amber Bead",
      "description": "A catalyst carved out of amber that gains a warm halo under the sun.",
      "refinement": "Normal Attack hits increase all Elemental DMG by {{0}}% for 6s. Max 2 stacks."
    },
    {
      "key": "Emerald Orb",
      "name": "Emerald Orb",
      "description": "A catalyst carved out of the hard jade from Jueyun Karst north of Liyue. It is small, light, and durable.",
      "refinement": "Upon causing a Vaporize, Electro-Charged, Frozen, or a Hydro-infused Swirl reaction, increases ATK by {{0}}% for 12s."
    },
    {
      "key": "Magic Guide",
      "name": "Magic Guide",
      "description": "Version 12. A reprint featuring corrections to Version 11 and brand-new additions based on recent developments.",
      "refinement": "Increases DMG against enemies affected by Hydro or Electro by {{0}}%."
    },
    {
      "key": "Otherworldly Story",
      "name": "Otherworldly Story",
      "description": "A cheap fantasy novel with no value whatsoever. Any claim that it possesses the power of catalysis is also pure fantasy.",
      "refinement": "Picking up an Elemental Energy Orb/Particle recovers {{0}}% HP."
    },
    {
      "key": "Thrilling Tales of Dragon Slayers",
      "name": "Thrilling Tales of Dragon Slayers",
      "description": "A fictional story of a band of five heroes who go off on a dragon hunt. It is poorly written and structurally incoherent. Its value lies in the many lessons that can be learned from failure.",
      "refinement": "When switching characters, the new character taking the field has their ATK increased by {{0}}% for 10s. This effect can only occur once every 20s."
    },
    {
      "key": "Twin Nephrite",
      "name": "Twin Nephrite",
      "description": "A jade pendant formed by piecing together two jade stones.",
      "refinement": "Defeating an enemy increases Movement SPD and ATK by {{0}}% for 15s."
    },
    {
      "key": "Blackcliff Agate",
      "name": "Blackcliff Agate",
      "description": "A mysterious catalyst made of a material known as \"blackcliff.\" It has an ominous crimson glow that seems to pulse in synchronization with the tremors from deep within the earth.",
      "refinement": "After defeating an enemy, ATK is increased by {{0}}% for 30s. This effect has a maximum of 3 stacks, and the duration of each stack is independent of the others."
    },
    {
      "key": "Favonius Codex",
      "name": "Favonius Codex",
      "description": "A secret tome that belonged to the scholars of the Knights of Favonius. It describes the logic and power of elements and matter.",
      "refinement": "CRIT Hits have a {{0}}% chance to generate a small amount of Elemental Particles, which will regenerate 6 Energy for the character. Can only occur once every {{1}}s."
    },
    {
      "key": "Mappa Mare",
      "name": "Mappa Mare",
      "description": "A nautical chart featuring nearby currents and climates that somehow found its way into Liyue via foreign traders.",
      "refinement": "Triggering an Elemental reaction grants a {{0}}% Elemental DMG Bonus for 10s. Max 2 stacks."
    },
    {
      "key": "Prototype Amber",
      "name": "Prototype Amber",
      "description": "A dully gilded catalyst secretly guarded in the Blackcliff Forge. It seems to glow with the very light from the sky.",
      "refinement": "Using an Elemental Burst regenerates {{0}} Energy every 2s for 6s. All party members will regenerate {{1}}% HP every 2s for this duration."
    },
    {
      "key": "Royal Grimoire",
      "name": "Royal Grimoire",
      "description": "A book that once belonged to a royal mage of Mondstadt. It contains faithful and comprehensive historical accounts as well as magic spells.",
      "refinement": "Upon damaging an opponent, increases CRIT Rate by {{0}}%. Max 5 stacks. A CRIT hit removes all stacks."
    },
    {
      "key": "Sacrificial Fragments",
      "name": "Sacrificial Fragments",
      "description": "A weathered script, the text of which is no longer legible. A cursed item eroded by the winds of time.",
      "refinement": "After damaging an opponent with an Elemental Skill, the skill has a {{0}}% chance to end its own CD. Can only occur once every {{1}}s."
    },
    {
      "key": "Solar Pearl",
      "name": "Solar Pearl",
      "description": "A dull, golden pearl made of an unknown substance that harbors the light of the sun and the moon, and pulses with a warm strength.",
      "refinement": "Normal Attack hits increase Elemental Skill and Elemental Burst DMG by {{0}}% for 6s. Likewise, Elemental Skill or Elemental Burst hits increase Normal Attack DMG by {{1}}% for 6s."
    },
    {
      "key": "The Widsith",
      "name": "The Widsith",
      "description": "A heavy notebook filled with musical scores. Though suffering from moth damage and heavy wear-and-tear, there is still much power to be found among the hand-written words within.",
      "refinement": "When the character takes the field, they will gain a random theme song for 10s. This can only occur once every 30s. Recitative: ATK is increased by {{0}}%. Aria: Increases all Elemental DMG by {{1}}%. Interlude: Elemental Mastery is increased by {{2}}."
    },
    {
      "key": "Wine and Song",
      "name": "Wine and Song",
      "description": "A songbook from the bygone aristocratic era, whose composer has become forgotten. It chronicles the tale of a certain heroic outlaw.",
      "refinement": "Hitting an opponent with a Normal Attack decreases the Stamina consumption of Sprint or Alternate Sprint by {{0}}% for 5s. Additionally, using a Sprint or Alternate Sprint ability increases ATK by {{1}}% for 5s."
    },
    {
      "key": "Eye of Perception",
      "name": "Eye of Perception",
      "description": "A dim black glaze pearl that is said to have the power to read the purity of one’s heart.",
      "refinement": "Normal and Charged Attacks have a 50% chance to fire a Bolt of Perception, dealing {{0}}% ATK as DMG. This bolt can bounce between enemies a maximum of 4 times. This effect can occur once every {{1}}s."
    },
    {
      "key": "Frostbearer",
      "name": "Frostbearer",
      "description": "A fruit that possesses a strange, frosty will. A faint sense of agony emanates from it.",
      "refinement": "Hitting an enemy with Normal and Charged Attacks has a {{0}}% chance of forming and dropping an Everfrost Icicle above them, dealing {{1}}% AoE ATK DMG. Can only occur once every 10s. Enemies affected by Cryo are dealt {{2}}% ATK DMG. Can only occur once every 10s."
    },
    {
      "key": "Lost Prayer to the Sacred Winds",
      "name": "Lost Prayer to the Sacred Winds",
      "description": "An educational tome written by anonymous early inhabitants who worshiped the wind. It has been blessed by the wind for its faithfulness and influence over the millennia.",
      "refinement": "Increases Movement SPD by 10%. When in battle, gain an {{0}}% Elemental DMG Bonus every 4s. Max 4 stacks. Lasts until the character falls or leaves combat."
    },
    {
      "key": "Skyward Atlas",
      "name": "Skyward Atlas",
      "description": "A cloud atlas symbolizing Dvalin and its former master, the Anemo Archon. It details the winds and clouds of the northern regions and contains the powers of the sky and wind.",
      "refinement": "Increases Elemental DMG Bonus by {{0}}%. Normal Attack hits have a 50% chance to earn the favor of the clouds, which actively seek out nearby enemies to attack for 15s, dealing {{1}}% ATK DMG. Can only occur once every 30s."
    },
    {
      "key": "Memory of Dust",
      "name": "Memory of Dust",
      "description": "A stone dumbbell containing distant memories. Its endless transformations reveal the power within.",
      "refinement": "Increases Shield Strength by {{0}}%. Scoring hits on opponents increases ATK by {{1}}% for 8s. Max 5 stacks. Can only occur once every 0.3s. While protected by a shield, this ATK increase effect is increased by 100%."
    },
    {
      "key": "Waster Greatsword",
      "name": "Waster Greatsword",
      "description": "A sturdy sheet of iron that may be powerful enough to break apart mountains if wielded with enough willpower.",
      "refinement": null
    },
    {
      "key": "Old Merc’s Pal",
      "name": "Old Merc’s Pal",
      "description": "A battle-tested greatsword that has seen better days and worse.",
      "refinement": null
    },
    {
      "key": "Bloodtainted Greatsword",
      "name": "Bloodtainted Greatsword",
      "description": "A steel sword that is said to have been coated with dragon blood, rendering it invulnerable to damage. This effect is not extended to its wielder, however.",
      "refinement": "Increases DMG dealt against enemies affected by Pyro or Electro by {{0}}%"
    },
    {
      "key": "Debate Club",
      "name": "Debate Club",
      "description": "A handy club made of fine steel. The most persuasive line of reasoning in any debater’s arsenal.",
      "refinement": "After using an Elemental Skill, Normal or Charged Attacks, on hit, deal an additional {{0}}% ATK DMG in a small area. Effect lasts 15s. DMG can only occur once every 3s."
    },
    {
      "key": "Ferrous Shadow",
      "name": "Ferrous Shadow",
      "description": "A replica of the famed sword of Arundolyn, the Lion of Light. Feel the power of a legendary hero as you hold this sword in your hand! Imagine yourself as the great warrior himself! Note: Daydreaming not recommended in live combat.",
      "refinement": "When HP falls below {{0}}%, increases Charged Attack DMG by {{1}}% and Charged Attacks become harder to interrupt."
    },
    {
      "key": "Quartz",
      "name": "Quartz",
      "description": "A simple but heavy greatsword made of polished black quartz with a golden gilt. It has an air of elegance and dignity about it.",
      "refinement": "Upon causing an Overloaded, Melt, Burning, Vaporize, or a Pyro-infused Swirl reaction, ATK is increased by {{0}}% for 12s."
    },
    {
      "key": "Skyrider Greatsword",
      "name": "Skyrider Greatsword",
      "description": "A reliable steel sword. The legendary Skyrider once tried to ride it as a flying sword... for the second time.",
      "refinement": "On hit, Normal or Charged Attacks increase ATK by {{0}}% for 6s. Max 4 stacks. Can occur once every 0.5s."
    },
    {
      "key": "White Iron Greatsword",
      "name": "White Iron Greatsword",
      "description": "A claymore made from white iron. Lightweight without compromising on power. Effective even when wielded by one of average strength, it is extremely deadly in the hands of a physically stronger wielder.",
      "refinement": "Defeating an opponent restores {{0}}% HP."
    },
    {
      "key": "Blackcliff Slasher",
      "name": "Blackcliff Slasher",
      "description": "An extremely sturdy greatsword from the Blackcliff Forge. It has a dark crimson color from the blade to pommel.",
      "refinement": "After defeating an enemy, ATK is increased by {{0}}% for 30s. This effect has a maximum of 3 stacks, and the duration of each stack is independent of the others."
    },
    {
      "key": "Favonius Greatsword",
      "name": "Favonius Greatsword",
      "description": "A heavy ceremonial sword of the Knights of Favonius. It channels elemental power easily and is highly destructive.",
      "refinement": "CRIT Hits have a {{0}}% chance to generate a small amount of Elemental Particles, which will regenerate 6 Energy for the character. Can only occur once every {{1}}s."
    },
    {
      "key": "Lithic Blade",
      "name": "Lithic Blade",
      "description": "A greatsword carved and chiseled from the very bedrock of Liyue.",
      "refinement": "For every character in the party who hails from Liyue, the character who equips this weapon gains a {{0}}% ATK increase and a {{1}}% CRIT Rate increase. This effect stacks up to 4 times."
    },
    {
      "key": "Prototype Archaic",
      "name": "Prototype Archaic",
      "description": "An ancient greatsword discovered in the Blackcliff Forge. It swings with such an immense force that one feels it could cut straight through reality itself.",
      "refinement": "On hit, Normal or Charged Attacks have a 50% chance to deal an additional {{0}}% ATK DMG to enemies within a small AoE. Can only occur once every 15s."
    },
    {
      "key": "Rainslasher",
      "name": "Rainslasher",
      "description": "A fluorescent greatsword with no sharp edge that crushes enemies with brute force and raw power.",
      "refinement": "Increases DMG against enemies affected by Hydro or Electro by {{0}}%"
    },
    {
      "key": "Royal Greatsword",
      "name": "Royal Greatsword",
      "description": "An old greatsword that belonged to the erstwhile rulers of Mondstadt. It is made from the finest-quality materials and has stood the test of time. A weapon for use by royals only.",
      "refinement": "Upon damaging an opponent, increases CRIT Rate by {{0}}%. Max 5 stacks. A CRIT hit removes all stacks."
    },
    {
      "key": "Serpent Spine",
      "name": "Serpent Spine",
      "description": "A rare weapon whose origin is the ancient ocean. One can hear the sound of the ageless waves as one swings it.",
      "refinement": "Every 4s a character is on the field, they will deal {{0}}% more DMG and take {{1}}% more DMG. This effect has a maximum of 5 stacks and will not be reset if the character leaves the field, but will be reduced by 1 stack when the character takes DMG."
    },
    {
      "key": "The Bell",
      "name": "The Bell",
      "description": "A heavy greatsword. A clock is embedded within it, though its internal mechanisms have long been damaged.",
      "refinement": "Taking DMG generates a shield which absorbs DMG up to {{0}}% of Max HP. This shield lasts for 10s or until broken, and can only be triggered once every 45s. While protected by the shield, the character gains {{1}}% increased DMG."
    },
    {
      "key": "Whiteblind",
      "name": "Whiteblind",
      "description": "An exotic sword with one section of the blade left blunt. It made its way into Liyue via the hands of foreign traders. Incredibly powerful in the hands of someone who knows how to use it.",
      "refinement": "On hit, Normal or Charged Attacks increase ATK and DEF by {{0}}% for 6s. Max 4 stacks. This effect can only occur once every 0.5s."
    },
    {
      "key": "Sacrificial Greatsword",
      "name": "Sacrificial Greatsword",
      "description": "A ceremonial greatsword that has become petrified over time. The trinkets on it are still visible. It grants the wielder the power to withstand the winds of time.",
      "refinement": "After damaging an opponent with an Elemental Skill, the skill has a {{0}}% chance to end its own CD. Can only occur once every {{1}}s."
    },
    {
      "key": "Snow-Tombed Starsilver",
      "name": "Snow-Tombed Starsilver",
      "description": "An ancient greatsword that was stored between frescoes. Forged from Starsilver, it has the power to cleave through ice and snow.",
      "refinement": "Hitting an enemy with Normal and Charged Attacks has a {{0}}% chance of forming and dropping an Everfrost Icicle above them, dealing {{1}}% AoE ATK DMG. Can only occur once every 10s. Enemies affected by Cryo are dealt {{2}}% ATK DMG. Can only occur once every 10s."
    },
    {
      "key": "Skyward Pride",
      "name": "Skyward Pride",
      "description": "A claymore that symbolizes the pride of Dvalin soaring through the skies. When swung, it emits a deep hum as the full force of Dvalin’s command of the sky and the wind is unleashed.",
      "refinement": "Increases all DMG by {{0}}%. After using an Elemental Burst, Normal or Charged Attack, on hit, creates a vacuum blade that does {{1}}% of ATK as DMG to enemies along its path. Lasts for 20s or 8 vacuum blades."
    },
    {
      "key": "Wolf’s Gravestone",
      "name": "Wolf’s Gravestone",
      "description": "A longsword used by the Wolf Knight. Originally just a heavy sheet of iron given to the knight by a blacksmith from the city, it became endowed with legendary power owing to his friendship with the wolves.",
      "refinement": "Increases ATK by {{0}}%. On hit, attacks against enemies with less than 30% HP increase all party members’ ATK by {{1}}% for 12s. Can only occur once every 30s."
    },
    {
      "key": "The Unforged",
      "name": "The Unforged",
      "description": "Capable of driving away evil spirits and wicked people alike, this edgeless claymore seems to possess divine might.",
      "refinement": "Increases Shield Strength by {{0}}%. Scoring hits on opponents increases ATK by {{1}}% for 8s. Max 5 stacks. Can only occur once every 0.3s. While protected by a shield, this ATK increase effect is increased by 100%."
    },
    {
      "key": "Beginner’s Protector",
      "name": "Beginner’s Protector",
      "description": "A polearm as straight as a flag pole. Well suited to most combat situations, it has an imposing presence when swung.",
      "refinement": null
    },
    {
      "key": "Iron Point",
      "name": "Iron Point",
      "description": "Sharp and pointy at one end, it is a balanced weapon that is quite popular among travelers.",
      "refinement": null
    },
    {
      "key": "Black Tassel",
      "name": "Black Tassel",
      "description": "An exceptionally powerful polearm that also offers a simple but elegant solution to the issue of the easily stained white tassel.",
      "refinement": "Increases DMG against slimes by {{0}}%"
    },
    {
      "key": "Halberd",
      "name": "Halberd",
      "description": "A polearm with an axe blade mounted on top that can deal quite a lot of damage. It’s favored by the Millelith officers.",
      "refinement": "Normal Attacks deal an additional {{0}}% DMG. Can only occur once every 10s."
    },
    {
      "key": "White Tassel",
      "name": "White Tassel",
      "description": "A standard-issue weapon of the Millelith soldiers. It has a sturdy shaft and sharp spearhead. It’s a reliable weapon.",
      "refinement": "Increases Normal Attack DMG by {{0}}%."
    },
    {
      "key": "Blackcliff Pole",
      "name": "Blackcliff Pole",
      "description": "A weapon made of blackcliff and aerosiderite. There is a dark crimson glow on its cold black sheen.",
      "refinement": "After defeating an enemy, ATK is increased by {{0}}% for 30s. This effect has a maximum of 3 stacks, and the duration of each stack is independent of the others."
    },
    {
      "key": "Crescent Pike",
      "name": "Crescent Pike",
      "description": "An exotic weapon with an extremely long blade on the top and a crescent blade at the bottom. It found its way into Liyue through foreign traders. With practice, it can deal heavy damage.",
      "refinement": "After picking up an Elemental Orb/Particle, Normal and Charged Attacks deal an additional {{0}}% ATK DMG for 5s."
    },
    {
      "key": "Deathmatch",
      "name": "Deathmatch",
      "description": "A sharp crimson polearm that was once a gladiator’s priceless treasure. Its awl has been stained by the blood of countless beasts and men.",
      "refinement": "If are there at least 2 enemies nearby, ATK is increased by {{0}}% and DEF is increased by {{1}}%. If there are less than 2 enemies nearby, ATK is increased by {{2}}%"
    },
    {
      "key": "Dragon’s Bane",
      "name": "Dragon’s Bane",
      "description": "A polearm decorated with an entwining golden dragon. Light and sharp, this weapon may very well kill dragons with ease.",
      "refinement": "Increases DMG against enemies affected by Hydro or Pyro by {{0}}%"
    },
    {
      "key": "Lithic Spear",
      "name": "Lithic Spear",
      "description": "A spear forged from the rocks of the Guyun Stone Forest. Its hardness knows no equal.",
      "refinement": "For every character in the party who hails from Liyue, the character who equips this weapon gains a {{0}}% ATK increase and a {{1}}% CRIT Rate increase. This effect stacks up to 4 times."
    },
    {
      "key": "Prototype Starglitter",
      "name": "Prototype Starglitter",
      "description": "A grudge discovered in the Blackcliff Forge. The glimmers along the sharp edge are like stars in the night.",
      "refinement": "After using an Elemental Skill, increases Normal and Charged Attack DMG by {{0}}% for 12s. Max 2 stacks."
    },
    {
      "key": "Favonius Lance",
      "name": "Favonius Lance",
      "description": "A polearm made in the style of the Knights of Favonius. Its shaft is straight, and its tip flows lightly like the wind.",
      "refinement": "CRIT Hits have a {{0}}% chance to generate a small amount of Elemental Particles, which will regenerate 6 Energy for the character. Can only occur once every {{1}}s."
    },
    {
      "key": "Royal Spear",
      "name": "Royal Spear",
      "description": "This polearm was once cherished by a member of the old nobility that governed Mondstadt long ago. Although it has never seen the light of day, it is still incomparably sharp.",
      "refinement": "Upon damaging an opponent, increases CRIT Rate by {{0}}%. Max 5 stacks. A CRIT hit removes all stacks."
    },
    {
      "key": "Dragonspine Spear",
      "name": "Dragonspine Spear",
      "description": "A spear created from the fang of a dragon. It is oddly warm to the touch.",
      "refinement": "Hitting an enemy with Normal and Charged Attacks has a {{0}}% chance of forming and dropping an Everfrost Icicle above them, dealing {{1}}% AoE ATK DMG. Can only occur once every 10s. Enemies affected by Cryo are dealt {{2}}% ATK DMG. Can only occur once every 10s."
    },
    {
      "key": "Vortex Vanquisher",
      "name": "Vortex Vanquisher",
      "description": "This sharp polearm can seemingly pierce through anything. When swung, one can almost see the rift it tears in the air.",
      "refinement": "Increases Shield Strength by {{0}}%. Scoring hits on opponents increases ATK by {{1}}% for 8s. Max 5 stacks. Can only occur once every 0.3s. While protected by a shield, this ATK increase effect is increased by 100%."
    },
    {
      "key": "Primordial Jade Winged-Spear",
      "name": "Primordial Jade Winged-Spear",
      "description": "A jade polearm made by the archons, capable of slaying ancient beasts.",
      "refinement": "On hit, increases ATK by {{0}}% for 6s. Max 7 stacks. This effect can only occur once every 0.3s. While in possession of the maximum possible stacks, DMG dealt is increased by {{1}}%."
    },
    {
      "key": "Skyward Spine",
      "name": "Skyward Spine",
      "description": "A polearm that symbolizes Dvalin’s firm resolve. The upright shaft of this weapon points towards the heavens, clad in the might of sky and wind.",
      "refinement": "Increases CRIT Rate by {{0}}% and increases Normal ATK SPD by 12%. Additionally, Normal and Charged Attacks hits on enemies have a 50% chance to trigger a vacuum blade that deals {{1}}% of ATK as DMG in a small AoE. This effect can occur no more than once every 2s."
    },
    {
      "key": "Primordial Jade Cutter",
      "name": "Primordial Jade Cutter",
      "description": "A ceremonial sword masterfully carved from pure jade. There almost seems to be an audible sigh in the wind as it is swung.",
      "refinement": "HP increased by {{0}}%. Additionally, provides an ATK Bonus based on {{1}}% of the wielder's Max HP."
    },
    {
      "key": "Staff of Homa",
      "name": "Staff of Homa",
      "description": "A \"firewood staff\" that was once used in ancient and long-lost rituals.",
      "refinement": "HP increased by {{0}}%. Additionally, provides an ATK Bonus based on {{1}}% of the wielder's Max HP. When the wielder's HP is less than 50%, this ATK Bonus is increased by an additional {{2}}% of Max HP."
    },
    {
      "key": "Windblume Ode",
      "name": "Windblume Ode",
      "description": "A bow adorned with nameless flowers that bears the earnest hopes of an equally nameless person.",
      "refinement": "After using an Elemental Skill, receive a boon from the ancient wish of the Windblume, increasing ATK by {{0}}% for 6s."
    },
    {
      "key": "Elegy for the End",
      "name": "Elegy for the End",
      "description": "A bow as lovely as any bard's lyre, its arrows pierce the heart like a lamenting sigh.",
      "refinement": "A part of the \"Millennial Movement\" that wanders amidst the winds. Increases Elemental Mastery by {{0}}. When the Elemental Skills or Elemental Bursts of the character wielding this weapon hit opponents, that character gains a Sigil of Remembrance. This effect can be triggered once every 0.2s and can be triggered even if said character is not on the field. When you possess 4 Sigils of Remembrance, all of them will be consumed and all nearby party members will obtain the \"Millennial Movement: Farewell Song\" effect for 12s. \"Millennial Movement: Farewell Song\" increases Elemental Mastery by {{1}} and increases ATK by {{2}}%. Once this effect is triggered, you will not gain Sigils of Remembrance for 20s. Of the many effects of the \"Millennial Movement,\" buffs of the same type will not stack."
    }
  ],
  "artifacts": [
    {
      "key": "Adventurer",
      "name": "Adventurer",
      "bonus": [
        {
          "key": "b1",
          "bonus": "Max HP increased by 1000."
        },
        {
          "key": "b2",
          "bonus": "Opening a chest regenerates 30% Max HP over 5s."
        }
      ]
    },
    {
      "key": "Traveling Doctor",
      "name": "Traveling Doctor",
      "bonus": [
        {
          "key": "b1",
          "bonus": "Increases incoming healing by 20%."
        },
        {
          "key": "b2",
          "bonus": "Using Elemental Burst restores 20% HP."
        }
      ]
    },
    {
      "key": "Lucky Dog",
      "name": "Lucky Dog",
      "bonus": [
        {
          "key": "b1",
          "bonus": "DEF increased by 100."
        },
        {
          "key": "b2",
          "bonus": "Picking up Mora restores 300 HP."
        }
      ]
    },
    {
      "key": "Resolution of Sojourner",
      "name": "Resolution of Sojourner",
      "bonus": [
        {
          "key": "b1",
          "bonus": "ATK +18%."
        },
        {
          "key": "b2",
          "bonus": "Increases Charged Attack CRIT Rate by 30%."
        }
      ]
    },
    {
      "key": "Tiny Miracle",
      "name": "Tiny Miracle",
      "bonus": [
        {
          "key": "b1",
          "bonus": "All Elemental RES increased by 20%."
        },
        {
          "key": "b2",
          "bonus": "Incoming elemental DMG increases corresponding Elemental RES by 30% for 10s. Can only occur once every 10s."
        }
      ]
    },
    {
      "key": "Brave Heart",
      "name": "Brave Heart",
      "bonus": [
        {
          "key": "b1",
          "bonus": "ATK +18%."
        },
        {
          "key": "b2",
          "bonus": "Increases DMG by 30% against enemies with more than 50% HP."
        }
      ]
    },
    {
      "key": "Defender’s Will",
      "name": "Defender’s Will",
      "bonus": [
        {
          "key": "b1",
          "bonus": "DEF +30%."
        },
        {
          "key": "b2",
          "bonus": "For each different element present in your own party, the wearer’s Elemental RES to that corresponding element is increased by 30%."
        }
      ]
    },
    {
      "key": "Martial Artist",
      "name": "Martial Artist",
      "bonus": [
        {
          "key": "b1",
          "bonus": "Increases Normal Attack and Charged Attack DMG by 15%."
        },
        {
          "key": "b2",
          "bonus": "After using Elemental Skill, increases Normal Attack and Charged Attack DMG by 25% for 8s."
        }
      ]
    },
    {
      "key": "Gambler",
      "name": "Gambler",
      "bonus": [
        {
          "key": "b1",
          "bonus": "Increases Elemental Skill DMG by 20%."
        },
        {
          "key": "b2",
          "bonus": "Defeating an enemy has a 100% chance to remove Elemental Skill CD. Can only occur once every 15s."
        }
      ]
    },
    {
      "key": "Scholar",
      "name": "Scholar",
      "bonus": [
        {
          "key": "b1",
          "bonus": "Energy Recharge +20%."
        },
        {
          "key": "b2",
          "bonus": "Gaining Elemental Particles or Orbs gives 3 Energy to all party members who have a bow or a catalyst equipped. Can only occur once every 3s."
        }
      ]
    },
    {
      "key": "Berserker",
      "name": "Berserker",
      "bonus": [
        {
          "key": "b1",
          "bonus": "CRIT Rate +12%."
        },
        {
          "key": "b2",
          "bonus": "When HP is below 70%, CRIT Rate increases by an additional 24%."
        }
      ]
    },
    {
      "key": "Instructor",
      "name": "Instructor",
      "bonus": [
        {
          "key": "b1",
          "bonus": "Increases Elemental Mastery by 80."
        },
        {
          "key": "b2",
          "bonus": "Upon triggering an Elemental Reaction, increases all party members’ Elemental Mastery by 120 for 8s."
        }
      ]
    },
    {
      "key": "The Exile",
      "name": "The Exile",
      "bonus": [
        {
          "key": "b1",
          "bonus": "Energy Recharge +20%."
        },
        {
          "key": "b2",
          "bonus": "Using an Elemental Burst regenerates 2 Energy for all party members (excluding the wearer) every 2s for 6s. This effect cannot stack."
        }
      ]
    },
    {
      "key": "Thundering Fury",
      "name": "Thundering Fury",
      "bonus": [
        {
          "key": "b1",
          "bonus": "Electro DMG Bonus +15%."
        },
        {
          "key": "b2",
          "bonus": "Increases damage caused by Overloaded, Electro-Charged and Superconduct by 40%. Triggering such effects decreases Elemental Skill CD by 1s. Can only occur once every 0.8s."
        }
      ]
    },
    {
      "key": "Thundersoother",
      "name": "Thundersoother",
      "bonus": [
        {
          "key": "b1",
          "bonus": "Electro RES increased by 40%."
        },
        {
          "key": "b2",
          "bonus": "Increases DMG against enemies affected by Electro by 35%."
        }
      ]
    },
    {
      "key": "Viridescent Venerer",
      "name": "Viridescent Venerer",
      "bonus": [
        {
          "key": "b1",
          "bonus": "Anemo DMG Bonus +15%."
        },
        {
          "key": "b2",
          "bonus": "Increases Swirl DMG by 60%. Decreases opponent’s Elemental RES to the element infused in the Swirl by 40% for 10s."
        }
      ]
    },
    {
      "key": "Maiden Beloved",
      "name": "Maiden Beloved",
      "bonus": [
        {
          "key": "b1",
          "bonus": "Character Healing Effectiveness +15%."
        },
        {
          "key": "b2",
          "bonus": "Using an Elemental Skill or Burst increases healing received by all party members by 20% for 10s."
        }
      ]
    },
    {
      "key": "Archaic Petra",
      "name": "Archaic Petra",
      "bonus": [
        {
          "key": "b1",
          "bonus": "Gain a 15% Geo DMG Bonus."
        },
        {
          "key": "b2",
          "bonus": "Upon obtaining an Elemental Shard created through a Crystallize Reaction, all party members gain a 35% DMG Bonus for that particular element for 10s. Only one form of Elemental DMG Bonus can be gained in this manner at any one time."
        }
      ]
    },
    {
      "key": "Retracing Bolide",
      "name": "Retracing Bolide",
      "bonus": [
        {
          "key": "b1",
          "bonus": "Increases Shield Strength by 35%."
        },
        {
          "key": "b2",
          "bonus": "While protected by a shield, gain an additional 40% Normal and Charged Attack DMG."
        }
      ]
    },
    {
      "key": "Crimson Witch of Flames",
      "name": "Crimson Witch of Flames",
      "bonus": [
        {
          "key": "b1",
          "bonus": "Pyro DMG Bonus +15%."
        },
        {
          "key": "b2",
          "bonus": "Increases Overloaded and Burning DMG by 40%. Increases Vaporize and Melt DMG by 15%. Using an Elemental Skill increases 2-Piece Set effects by 50% for 10s. Max 3 stacks."
        }
      ]
    },
    {
      "key": "Lavawalker",
      "name": "Lavawalker",
      "bonus": [
        {
          "key": "b1",
          "bonus": "Pyro RES increased by 40%."
        },
        {
          "key": "b2",
          "bonus": "Increases DMG against enemies affected by Pyro by 35%."
        }
      ]
    },
    {
      "key": "Bloodstained Chivalry",
      "name": "Bloodstained Chivalry",
      "bonus": [
        {
          "key": "b1",
          "bonus": "Physical DMG +25%."
        },
        {
          "key": "b2",
          "bonus": "After defeating an opponent, increases Charged Attack DMG by 50%, and reduces its Stamina cost to 0 for 10s."
        }
      ]
    },
    {
      "key": "Noblesse Oblige",
      "name": "Noblesse Oblige",
      "bonus": [
        {
          "key": "b1",
          "bonus": "Elemental Burst DMG +20%."
        },
        {
          "key": "b2",
          "bonus": "Using an Elemental Burst increases all party members’ ATK by 20% for 12s. This effect cannot stack."
        }
      ]
    },
    {
      "key": "Gladiator’s Finale",
      "name": "Gladiator’s Finale",
      "bonus": [
        {
          "key": "b1",
          "bonus": "ATK +18%."
        },
        {
          "key": "b2",
          "bonus": "If the wielder of this artifact set uses a Sword, Claymore or Polearm, increases their Normal Attack DMG by 35%."
        }
      ]
    },
    {
      "key": "Wanderer’s Troupe",
      "name": "Wanderer’s Troupe",
      "bonus": [
        {
          "key": "b1",
          "bonus": "Increases Elemental Mastery by 80."
        },
        {
          "key": "b2",
          "bonus": "Increases Charged Attack DMG by 35% if the character uses a Catalyst or a Bow."
        }
      ]
    },
    {
      "key": "Prayers for Illumination",
      "name": "Prayers for Illumination",
      "bonus": [
        {
          "key": "b1",
          "bonus": "Affected by Pyro for 40% less time."
        }
      ]
    },
    {
      "key": "Prayers for Destiny",
      "name": "Prayers for Destiny",
      "bonus": [
        {
          "key": "b1",
          "bonus": "Affected by Hydro for 40% less time."
        }
      ]
    },
    {
      "key": "Prayers for Wisdom",
      "name": "Prayers for Wisdom",
      "bonus": [
        {
          "key": "b1",
          "bonus": "Affected by Electro for 40% less time."
        }
      ]
    },
    {
      "key": "Prayers to Springtime",
      "name": "Prayers to Springtime",
      "bonus": [
        {
          "key": "b1",
          "bonus": "Affected by Cryo for 40% less time."
        }
      ]
    },
    {
      "key": "Blizzard Strayer",
      "name": "Blizzard Strayer",
      "bonus": [
        {
          "key": "b1",
          "bonus": "Cryo DMG Bonus +15%."
        },
        {
          "key": "b2",
          "bonus": "When a character attacks an enemy affected by Cryo, their CRIT Rate is increased by 20%. If the enemy is Frozen, CRIT Rate is increased by an additional 20%."
        }
      ]
    },
    {
      "key": "Heart of Depth",
      "name": "Heart of Depth",
      "bonus": [
        {
          "key": "b1",
          "bonus": "Hydro DMG Bonus +15%."
        },
        {
          "key": "b2",
          "bonus": "After using Elemental Skill, increases Normal Attack and Charged Attack DMG by 30% for 15s."
        }
      ]
    },
    {
      "key": "Glacier and Snowfield",
      "name": "Glacier and Snowfield",
      "bonus": [
        {
          "key": "b1",
          "bonus": "Cryo DMG Bonus +15%."
        },
        {
          "key": "b2",
          "bonus": "Increases Superconduct DMG by 100%. Increases Melt DMG by 15%. Using an Elemental Burst increases Cryo DMG Bonus by 30% for 10s."
        }
      ]
    },
    {
      "key": "Prayers to the Firmament",
      "name": "Prayers to the Firmament",
      "bonus": [
        {
          "key": "b1",
          "bonus": "Affected by Anemo for 40% less time."
        }
      ]
    }
  ],
  "materials": [
    {
      "key": "FreedomA",
      "name": "Teachings of Freedom"
    },
    {
      "key": "FreedomB",
      "name": "Guide to Freedom"
    },
    {
      "key": "FreedomC",
      "name": "Philosophies of Freedom"
    },
    {
      "key": "ProsperityA",
      "name": "Teachings of Prosperity"
    },
    {
      "key": "ProsperityB",
      "name": "Guide to Prosperity"
    },
    {
      "key": "ProsperityC",
      "name": "Philosophies of Prosperity"
    },
    {
      "key": "DilligenceA",
      "name": "Teachings of Dilligence"
    },
    {
      "key": "DilligenceB",
      "name": "Guide to Dilligence"
    },
    {
      "key": "DilligenceC",
      "name": "Philosophies of Dilligence"
    },
    {
      "key": "ResistanceA",
      "name": "Teachings of Resistance"
    },
    {
      "key": "ResistanceB",
      "name": "Guide to Resistance"
    },
    {
      "key": "ResistanceC",
      "name": "Philosophies of Resistance"
    },
    {
      "key": "BalladA",
      "name": "Teachings of Ballad"
    },
    {
      "key": "BalladB",
      "name": "Guide to Ballad"
    },
    {
      "key": "BalladC",
      "name": "Philosophies of Ballad"
    },
    {
      "key": "GoldA",
      "name": "Teachings of Gold"
    },
    {
      "key": "GoldB",
      "name": "Guide to Gold"
    },
    {
      "key": "GoldC",
      "name": "Philosophies of Gold"
    },
    {
      "key": "Tail of Boreas",
      "name": "Tail of Boreas",
      "bossName": "Andrius"
    },
    {
      "key": "Ring of Boreas",
      "name": "Ring of Boreas",
      "bossName": "Andrius"
    },
    {
      "key": "Spirit Locket of Boreas",
      "name": "Spirit Locket of Boreas",
      "bossName": "Andrius"
    },
    {
      "key": "Dvalin's Plume",
      "name": "Dvalin's Plume",
      "bossName": "Dvalin"
    },
    {
      "key": "Dvalin's Claw",
      "name": "Dvalin's Claw",
      "bossName": "Dvalin"
    },
    {
      "key": "Dvalin's Sigh",
      "name": "Dvalin's Sigh",
      "bossName": "Dvalin"
    },
    {
      "key": "Tusk of Monoceros Caeli",
      "name": "Tusk of Monoceros Caeli",
      "bossName": "Tartaglia"
    },
    {
      "key": "Shard of a Foul Legacy",
      "name": "Shard of a Foul Legacy",
      "bossName": "Tartaglia"
    },
    {
      "key": "Shadow of the Warrior",
      "name": "Shadow of the Warrior",
      "bossName": "Tartaglia"
    },
    {
      "key": "DecarabianA",
      "name": "Tile of Decarabian’s Tower"
    },
    {
      "key": "DecarabianB",
      "name": "Debris of Decarabian’s City"
    },
    {
      "key": "DecarabianC",
      "name": "Fragment of Decarabian’s Epic"
    },
    {
      "key": "DecarabianD",
      "name": "Scattered Piece of Decarabian’s Dream"
    },
    {
      "key": "GuyunA",
      "name": "Luminous Sands from Guyun"
    },
    {
      "key": "GuyunB",
      "name": "Lustrous Stone from Guyun"
    },
    {
      "key": "GuyunC",
      "name": "Relic from Guyun"
    },
    {
      "key": "GuyunD",
      "name": "Divine Body from Guyun"
    },
    {
      "key": "ElixirA",
      "name": "Mist Veiled Lead Elixir"
    },
    {
      "key": "ElixirB",
      "name": "Mist Veiled Mercury Elixir"
    },
    {
      "key": "ElixirC",
      "name": "Mist Veiled Gold Elixir"
    },
    {
      "key": "ElixirD",
      "name": "Mist Veiled Primo Elixir"
    },
    {
      "key": "BorealWolfA",
      "name": "Boreal Wolf’s Milk Tooth"
    },
    {
      "key": "BorealWolfB",
      "name": "Boreal Wolf’s Cracked Tooth"
    },
    {
      "key": "BorealWolfC",
      "name": "Boreal Wolf’s Broken Fang"
    },
    {
      "key": "BorealWolfD",
      "name": "Boreal Wolf's Nostalgia"
    },
    {
      "key": "AerosideriteA",
      "name": "Grain of Aerosiderite"
    },
    {
      "key": "AerosideriteB",
      "name": "Piece of Aerosiderite"
    },
    {
      "key": "AerosideriteC",
      "name": "Bit of Aerosiderite"
    },
    {
      "key": "AerosideriteD",
      "name": "Chunk of Aerosiderite"
    },
    {
      "key": "GladiatorA",
      "name": "Fetters of the Dandelion Gladiator"
    },
    {
      "key": "GladiatorB",
      "name": "Chains of the Dandelion Gladiator"
    },
    {
      "key": "GladiatorC",
      "name": "Shackles of the Dandelion Gladiator"
    },
    {
      "key": "GladiatorD",
      "name": "Dream of the Dandelion Gladiator"
    },
    {
      "key": "Crown of Insight",
      "name": "Crown of Insight"
    },
    {
      "key": "SacrificialKnifeA",
      "name": "Hunter's Sacrificial Knife"
    },
    {
      "key": "SacrificialKnifeB",
      "name": "Agent's Sacrificial Knife"
    },
    {
      "key": "SacrificialKnifeC",
      "name": "Inspector's Sacrificial Knife"
    },
    {
      "key": "HornA",
      "name": "Heavy Horn"
    },
    {
      "key": "HornB",
      "name": "Black Bronze Horn"
    },
    {
      "key": "HornC",
      "name": "Black Crystal Horn"
    },
    {
      "key": "ChaosA",
      "name": "Chaos Device"
    },
    {
      "key": "ChaosB",
      "name": "Chaos Circuit"
    },
    {
      "key": "ChaosC",
      "name": "Chaos Core"
    },
    {
      "key": "LeyLineA",
      "name": "Dead Ley Line Branch"
    },
    {
      "key": "LeyLineB",
      "name": "Dead Ley Line Leaves"
    },
    {
      "key": "LeyLineC",
      "name": "Ley Line Sprout"
    },
    {
      "key": "MistGrassA",
      "name": "Mist Grass Pollen"
    },
    {
      "key": "MistGrassB",
      "name": "Mist Grass"
    },
    {
      "key": "MistGrassC",
      "name": "Mist Grass Wick"
    },
    {
      "key": "BoneShardA",
      "name": "Fragile Bone Shard"
    },
    {
      "key": "BoneShardB",
      "name": "Sturdy Bone Shard"
    },
    {
      "key": "BoneShardC",
      "name": "Fossilized Bone Shard"
    },
    {
      "key": "MaskA",
      "name": "Damaged Mask"
    },
    {
      "key": "MaskB",
      "name": "Stained Mask"
    },
    {
      "key": "MaskC",
      "name": "Ominous Mask"
    },
    {
      "key": "StatuetteA",
      "name": "Gloomy Statuette"
    },
    {
      "key": "StatuetteB",
      "name": "Dark Statuette"
    },
    {
      "key": "StatuetteC",
      "name": "Deathly Statuette"
    },
    {
      "key": "ScrollA",
      "name": "Divining Scroll"
    },
    {
      "key": "ScrollB",
      "name": "Sealed Scroll"
    },
    {
      "key": "ScrollC",
      "name": "Forbidden Curse Scroll"
    },
    {
      "key": "NectarA",
      "name": "Whopperflower Nectar"
    },
    {
      "key": "NectarB",
      "name": "Shimmering Nectar"
    },
    {
      "key": "NectarC",
      "name": "Energy Nectar"
    },
    {
      "key": "ArrowHeadA",
      "name": "Firm Arrowhead"
    },
    {
      "key": "ArrowHeadB",
      "name": "Sharp Arrowhead"
    },
    {
      "key": "ArrowHeadC",
      "name": "Weathered Arrowhead"
    },
    {
      "key": "CircularInsigniaA",
      "name": "Treasure Hoarder Insignia"
    },
    {
      "key": "CircularInsigniaB",
      "name": "Silver Raven Insignia"
    },
    {
      "key": "CircularInsigniaC",
      "name": "Golden Raven Insignia"
    },
    {
      "key": "InsigniaA",
      "name": "Recruit's Insignia"
    },
    {
      "key": "InsigniaB",
      "name": "Sergeant's Insignia"
    },
    {
      "key": "InsigniaC",
      "name": "Lieutenant's Insignia"
    },
    {
      "key": "SlimeA",
      "name": "Slime Condensate"
    },
    {
      "key": "SlimeB",
      "name": "Slime Secretions"
    },
    {
      "key": "SlimeC",
      "name": "Slime Concentrate"
    },
    {
      "key": "Mora",
      "name": "Mora"
    },
    {
      "key": "BasaltPillar",
      "name": "Basalt Pillar"
    },
    {
      "key": "CleansingHeart",
      "name": "Cleansing Heart"
    },
    {
      "key": "EverflameSeed",
      "name": "Everflame Seed"
    },
    {
      "key": "HoarfrostCore",
      "name": "Hoarfrost Core"
    },
    {
      "key": "HurricaneSeed",
      "name": "Hurricane Seed"
    },
    {
      "key": "LightningPrism",
      "name": "Lightning Prism"
    },
    {
      "key": "AgateA",
      "name": "Agnidus Agate Sliver"
    },
    {
      "key": "AgateB",
      "name": "Agnidus Agate Fragment"
    },
    {
      "key": "AgateC",
      "name": "Agnidus Agate Chunk"
    },
    {
      "key": "AgateD",
      "name": "Agnidus Agate Gemstone"
    },
    {
      "key": "DiamondA",
      "name": "Brilliant Diamond Sliver"
    },
    {
      "key": "DiamondB",
      "name": "Brilliant Diamond Fragment"
    },
    {
      "key": "DiamondC",
      "name": "Brilliant Diamond Chunk"
    },
    {
      "key": "DiamondD",
      "name": "Brilliant Diamond Gemstone"
    },
    {
      "key": "EmeraldA",
      "name": "Nagadus Emerald Sliver"
    },
    {
      "key": "EmeraldB",
      "name": "Nagadus Emerald Fragment"
    },
    {
      "key": "EmeraldC",
      "name": "Nagadus Emerald Chunk"
    },
    {
      "key": "EmeraldD",
      "name": "Nagadus Emerald Gemstone"
    },
    {
      "key": "TopazA",
      "name": "Prithiva Topaz Sliver"
    },
    {
      "key": "TopazB",
      "name": "Prithiva Topaz Fragment"
    },
    {
      "key": "TopazC",
      "name": "Prithiva Topaz Chunk"
    },
    {
      "key": "TopazD",
      "name": "Prithiva Topaz Gemstone"
    },
    {
      "key": "JadeA",
      "name": "Shivada Jade Sliver"
    },
    {
      "key": "JadeB",
      "name": "Shivada Jade Fragment"
    },
    {
      "key": "JadeC",
      "name": "Shivada Jade Chunk"
    },
    {
      "key": "JadeD",
      "name": "Shivada Jade Gemstone"
    },
    {
      "key": "AmethystA",
      "name": "Vajrada Amethyst Sliver"
    },
    {
      "key": "AmethystB",
      "name": "Vajrada Amethyst Fragment"
    },
    {
      "key": "AmethystC",
      "name": "Vajrada Amethyst Chunk"
    },
    {
      "key": "AmethystD",
      "name": "Vajrada Amethyst Gemstone"
    },
    {
      "key": "LazuriteA",
      "name": "Varunada Lazurite Sliver"
    },
    {
      "key": "LazuriteB",
      "name": "Varunada Lazurite Fragment"
    },
    {
      "key": "LazuriteC",
      "name": "Varunada Lazurite Chunk"
    },
    {
      "key": "LazuriteD",
      "name": "Varunada Lazurite Gemstone"
    },
    {
      "key": "TurquoiseA",
      "name": "Vayuda Turquoise Sliver"
    },
    {
      "key": "TurquoiseB",
      "name": "Vayuda Turquoise Fragment"
    },
    {
      "key": "TurquoiseC",
      "name": "Vayuda Turquoise Chunk"
    },
    {
      "key": "TurquoiseD",
      "name": "Vayuda Turquoise Gemstone"
    },
    {
      "key": "CallaLily",
      "name": "Calla Lily"
    },
    {
      "key": "Cecilia",
      "name": "Cecilia"
    },
    {
      "key": "CorLapis",
      "name": "Cor Lapis"
    },
    {
      "key": "DandelionSeed",
      "name": "Dandelion Seed"
    },
    {
      "key": "GlazeLily",
      "name": "Glaze Lily"
    },
    {
      "key": "JueyunChili",
      "name": "Jueyun Chili"
    },
    {
      "key": "NoctilousJade",
      "name": "Noctilucous Jade"
    },
    {
      "key": "PhilanemoMushroom",
      "name": "Philanemo Mushroom"
    },
    {
      "key": "Qingxin",
      "name": "Qingxin"
    },
    {
      "key": "SilkFlower",
      "name": "Silk Flower"
    },
    {
      "key": "SmallLampGrass",
      "name": "Small Lamp Grass"
    },
    {
      "key": "Starconch",
      "name": "Starconch"
    },
    {
      "key": "Valberry",
      "name": "Valberry"
    },
    {
      "key": "Violetgrass",
      "name": "Violetgrass"
    },
    {
      "key": "WindwheelAster",
      "name": "Windwheel Aster"
    },
    {
      "key": "Wolfhook",
      "name": "Wolfhook"
    },
    {
      "key": "EnhancementOreA",
      "name": "Enhancement Ore"
    },
    {
      "key": "EnhancementOreB",
      "name": "Fine Enhancement Ore"
    },
    {
      "key": "EnhancementOreC",
      "name": "Mystic Enhancement Ore"
    },
    {
      "key": "CharExpA",
      "name": "Wanderer's Advice"
    },
    {
      "key": "CharExpB",
      "name": "Adventurer's Experience"
    },
    {
      "key": "CharExpC",
      "name": "Hero's Wit"
    }
  ],
  "debuffs": [
    {
      "key": "Engulfing Storm",
      "name": "Engulfing Storm",
      "effect": "Continuously drains Energy Recharge."
    },
    {
      "key": "Slowing Water",
      "name": "Slowing Water",
      "effect": "Increases skill CD durations."
    },
    {
      "key": "Smoldering Flames",
      "name": "Smoldering Flames",
      "effect": "Continuously inflicts damage over time."
    },
    {
      "key": "Condensed Ice",
      "name": "Condensed Ice",
      "effect": "Increases stamina consumption."
    }
  ],
  "reactions": [
    {
      "key": "Burning",
      "name": "Burning",
      "effect": "Deals Pyro DMG over time."
    },
    {
      "key": "Crystalize",
      "name": "Crystalize",
      "effect": "Creates a crystal that will provide a shield when picked up."
    },
    {
      "key": "Electro-Charged",
      "name": "Electro-Charged",
      "effect": "Deals Electro DMG over time."
    },
    {
      "key": "Frozen",
      "name": "Frozen",
      "effect": "Freezes the target."
    },
    {
      "key": "Melt",
      "name": "Melt",
      "effect": "Deals extra damage."
    },
    {
      "key": "Overloaded",
      "name": "Overloaded",
      "effect": "Deals AoE Pyro DMG."
    },
    {
      "key": "Superconduct",
      "name": "Superconduct",
      "effect": "Deals AoE Cryo DMG and reduces the target's Physical RES by 50%."
    },
    {
      "key": "Swirl",
      "name": "Swirl",
      "effect": "Deals extra elemental damage and spreads the effect."
    },
    {
      "key": "Vaporize",
      "name": "Vaporize",
      "effect": "Deals extra damage."
    }
  ],
  "resonance": [
    {
      "key": "Enduring Rock",
      "name": "Enduring Rock",
      "effect": "Increases shield strength by 15%. Aditionally, characters protected by a shield will have the following special characterists: DMG dealt increased by 15%, dealing DMG to enemeies will decrease their Geo RES by 20% for 15s."
    },
    {
      "key": "Fervent Flames",
      "name": "Fervent Flames",
      "effect": "Affected by Cryo for 40% less time. Increases ATK by 25%."
    },
    {
      "key": "Soothing Waters",
      "name": "Soothing Waters",
      "effect": "Affected by Pyro for 40% less time. Increases incoming healing by 30%."
    },
    {
      "key": "Impetuous Winds",
      "name": "Impetuous Winds",
      "effect": "Decreases Stamina Consumption by 15%. Increases Movement SPD by 10%. Shortens Skill CD by 5%."
    },
    {
      "key": "High Voltage",
      "name": "High Voltage",
      "effect": "Affected by Hydro for 40% less time. Superconduct, Overloaded, and Electro-Charged have a 100% chance to generate an Electro Elemental Particle (CD: 5s)."
    },
    {
      "key": "Shattering Ice",
      "name": "Shattering Ice",
      "effect": "Affected by Electro for 40% less time. Increases CRIT Rate against enemies that are Frozen or affected by Cryo by 15%."
    },
    {
      "key": "Protective Canopy",
      "name": "Protective Canopy",
      "effect": "All Elemental RES by 15%. Physical RES + 15%",
      "description": "Any 4 Unique Elements"
    }
  ]
}