Repository: Wolfteam/Shiori
Catalog: lib/l10n/intl_*.arb
Languages: de, es_es, fr, id, it_it, ja, uk, vi, zh_cn, zh_tw

# desiredX
source: Desired: {value}
de: Gewünscht: {value}
es_es: Deseado: {value}
fr: Désiré: {value}
id: Diinginkan: {value}
it_it: Desiderato: {value}
ja: 目標: {value}
uk: Необхідний: {value}
vi: Cấp cần: {value}
zh_cn: 需要：{value}
zh_tw: 需求: {value}

source: Current Ascension
de: Jetzige Stufe
es_es: Ascensión Actual
fr: Élévation actuelle
id: Ascension Saat ini
it_it: Ascensione attuale
ja: 現在の星座レベル
uk: Поточне Вознесіння
vi: Số sao hiện tại
zh_cn: 当前等级
zh_tw: 目前等級

source: Desired Ascension
de: Gewünschte Stufe
es_es: Ascención Deseada
fr: Élévation désirée
id: Ascension yang Diinginkan
it_it: Ascensione desiderata
ja: 目標の星座レベル
uk: Необхідне Вознесіння
vi: Số sao mong muốn
zh_cn: 需求等级
zh_tw: 需求等級

source: Choose a level
de: Wähle ein Level
es_es: Elige un nivel
fr: Choisir un niveau
id: Pilih level
it_it: Scegli un livello
ja: レベルを選択してください
uk: Оберіть рівень
vi: Chọn cấp độ
zh_cn: 选择一个等级
zh_tw: 選擇一個等級

source: Experience
de: Erfahrung
es_es: Experiencia
fr: Expérience
it_it: Esperienza
ja: 経験値
uk: Досвід
vi: Kinh nghiệm
zh_cn: 实验性
zh_tw: 經驗書

source: Approximate
de: Ungefähr
es_es: Aproximado
fr: Approximation
id: Perkiraan
it_it: valore approssimato
ja: 近似値
uk: Приблизно
vi: Gần đúng
zh_cn: 大约
zh_tw: 大約

source: Active
de: Aktiv
es_es: Activo
fr: Actif
id: Aktif
it_it: Attiva
ja: 有効化
uk: Активно
vi: Hoạt Động
zh_cn: 启用
zh_tw: 停用

source: Inactive
de: Inaktiv
es_es: Inactivo
fr: Inactif
id: Nonaktif
it_it: Disattiva
ja: 無効化
uk: Неактивно
vi: Không Hoạt Động
zh_cn: 不启用
zh_tw: 啟用

source: Game Codes
de: Gutscheincode
es_es: Códigos del Juego
fr: Codes Promotionnels
id: Kode Redeem
it_it: Codici di gioco
ja: ゲームコード
uk: Ігрові Промокоди
vi: Mã quà tặng
zh_cn: 兑换代码
zh_tw: 兌換代碼

source: Codes
es_es: Códigos
id: Kode
it_it: Codici
ja: コード
uk: Коди
vi: Mã
zh_cn: 代码
zh_tw: 代碼

source: Rewards
de: Belohnungen
es_es: Recompensas
fr: Récompenses
id: Hadiah
it_it: Ricompense
ja: 報酬
uk: Нагорода
vi: Thưởng
zh_cn: 奖励
zh_tw: 獎勵

# codeXWasCopied
source: Code {value} was copied to the clipboard
de: Code {value} wurde in die Zwischenabblage kopiert
es_es: El código {value} fue copiado al portapapeles
fr: Code {value} copié dans le presse papier
id: Kode {value} telah disalin ke clipboard
it_it: Codice {value} copiato negli appunti
ja: コード {value} がクリップボードにコピーされました
uk: Промокод: {value} було скопійовано в буфер обміну
vi: Mã đổi thưởng {value} đã được sao chép vào khay nhớ tạm
zh_cn: 代码 {value} 已复制到剪贴板
zh_tw: 已複製代碼 {value} 至剪貼簿

source: Expired Codes
de: Abgelaufene Codes
es_es: Códigos Expirados
fr: Codes expirés
id: Kode Kadaluarsa
it_it: Codici scaduti
ja: 期限切れコード
uk: Прострочені Коди
vi: Mã hết hạn
zh_cn: 过期代码
zh_tw: 逾期代碼

source: Working Codes
de: Funktionierende Codes
es_es: Códigos Funcionales
fr: Codes actifs
id: Kode yang Bekerja
it_it: Codici funzionanti
ja: 使用可能コード
uk: Робочі Коди
vi: Đang xử lý
zh_cn: 可用代码
zh_tw: 可用代碼

# seeAllInGameGameCodes
source: See all the game codes that you can use
de: Zeige alle Codes die im Spiel funktionieren
es_es: Ve todos los códigos del juego que puedes usar
fr: Voir tout les codes que vous pouvez utiliser
id: Lihat semua kode redeem yang dapat digunakan
it_it: Visualizza tutti i codici di gioco riscattabili
ja: 使用できるすべてのゲームコードを見る
uk: Ви можете переглянути всі ігрові промокоди тут
vi: Xem tất cả mã đổi mà bạn có thể sử dụng
zh_cn: 查看全部可用的兑换代码
zh_tw: 查看所有可用代碼

source: Ingredient
de: Zutaten
es_es: Ingrediente
fr: Ingrédient
id: Bahan
it_it: Ingredienti
ja: 素材
uk: Інгредієнт
vi: Khoáng vật
zh_cn: 原料
zh_tw: 食材

source: Talent
es_es: Talento
fr: Aptitude
id: Talenta
it_it: Materiale per i talenti
ja: 天賦
uk: Талант
vi: Nguyên liệu thiên phú
zh_cn: 天赋材料
zh_tw: 天賦

source: Local
de: Lokal
id: Lokal
it_it: Specialità locali
ja: 特産品
uk: Місцеві Дивовижі
vi: Địa Phương
zh_cn: 特产
zh_tw: 特產

source: Elemental Stone
de: Elementarer Stein
es_es: Piedra Elemental
fr: Pierre Élementaire
it_it: Pietre elementali
ja: 元素石
uk: Елементальний Камінь
vi: Đá nguyên tố
zh_cn: 元素材料
zh_tw: 元素石

source: Jewel
de: Juwel
es_es: Joya
fr: Joyau
it_it: Pietre preziose
ja: 宝石
uk: Коштовність
vi: Ngọc
zh_cn: 宝石
zh_tw: 寶石

# checkAllMaterials
source: Check all the available materials
de: Prüfe alle verfügbaren Materialien
es_es: Comprueba todos los materiales disponibles
fr: Voir tous les matériaux disponibles
id: Cek semua bahan yang tersedia
it_it: Visualizza tutti i materiali del gioco
ja: すべての素材が確認できます
uk: Подивитись всі наявні матеріали
vi: Kiểm tra các nguyên liệu có sẵn
zh_cn: 查看所有可用材料
zh_tw: 查看所有可用素材

source: Related
de: Verwandt
es_es: Relacionado
fr: En lien
id: Terkait
it_it: Correlati
ja: 関連
uk: Пов'язано
vi: Liên quan đến
zh_cn: 同类材料
zh_tw: 同類型素材

source: Obtained From
de: Erhalten von
es_es: Obtenido de
fr: Source
id: Didapatkan dari
it_it: Requisiti di creazione
ja: 鋳造素材
uk: Отримано З
vi: Lấy từ
zh_cn: 合成所需材料
zh_tw: 取得途徑

source: Sessions
de: Sitzungen
es_es: Sesiones
id: Sesi
it_it: Sessioni
ja: セッション
uk: Сесія
vi: Danh sách
zh_cn: 组别
zh_tw: 組合

source: Delete
de: Löschen
es_es: Borrar
fr: Supprimer
id: Hapus
it_it: Cancella
ja: 削除
uk: Видалити
vi: Xóa
zh_cn: 删除
zh_tw: 刪除

source: Edit
de: Bearbeiten
es_es: Editar
fr: Modifier
id: Ubah
it_it: Modifica
ja: 編集
uk: Редагувати
vi: Chỉnh sửa
zh_cn: 编辑
zh_tw: 編輯

# charactersX
source: {value} Character(s)
de: {value} Charakter(e)
es_es: {value} Personaje(s)
fr: {value} Personnage(s)
id: {value} Karakter
it_it: {value} personaggio(i)
ja: {value} キャラクター
uk: {value} Персонаж(и)
vi: {value} Nhân vật
zh_cn: 角色：{value}
zh_tw: {value} 角色

# weaponsX
source: {value} Weapon(s)
de: {value} Waffe(n)
es_es: {value} Arma(s)
fr: {value} Arme(s)
id: {value} Senjata
it_it: {value} arma(i)
ja: {value} 武器
uk: {value} Зброя(Ї)
vi: {value} Vũ khí
zh_cn: 武器：{value}
zh_tw: {value} 武器

source: Add session
de: Füge Sitzung hinzu
es_es: Agregar sesión
fr: Ajouter une session
id: Tambahkan Sesi
it_it: Aggiungi sessione
ja: セッションを追加
uk: Додати сесію
vi: Thêm 1 danh sách
zh_cn: 创建组别
zh_tw: 新增組合

source: Edit session
de: Bearbeite Sitzung
es_es: Editar sesión
fr: Modifier la session
id: Ubah Sesi
it_it: Modifica sessione
ja: セッションの編集
uk: Редагуваи сесію
vi: Chỉnh sửa danh sách
zh_cn: 编辑组别
zh_tw: 編輯組合

source: Delete session
de: Lösche Sitzung
es_es: Borrar sesión
fr: Supprimer la session
id: Hapus Sesi
it_it: Cancella sessione
ja: セッションの削除
uk: Видалити сесію
vi: Xóa danh sách
zh_cn: 删除组别
zh_tw: 刪除組合

source: Invalid value
de: Ungültiger Wert
es_es: Valor inválido
fr: Valeur incorrecte
id: Nilai tidak valid
it_it: Valore non valido
ja: 値が無効です
uk: Недійсне значення
vi: Giá trị không hợp lệ
zh_cn: 无效的值
zh_tw: 無效值

# confirmDeleteSessionX
source: Are you sure you wanna delete session: {value} ?
de: Bist du dir sicher, dass du die Sitzung löschen willst: {value} ?
es_es: ¿ Estás seguro que deseas borrar la sesión: {value} ?
fr: Êtes-vous sûr de vouloir supprimer la session : {value} ?
id: Apa kamu yakin ingin menghapus sesi ini: {value} ?
it_it: Sei sicuro di voler cancellare la sessione {value} ?
ja: セッション {value} を削除してもよろしいですか?
uk: Ви впевнені, що хочете видалити сесію: {value} ?
vi: Bạn chắc chắn xóa danh sách: "{value}" ?
zh_cn: 确定删除组别“{value}” ？
zh_tw: 您確定要刪除組合： {value} 嗎？

# noSessionsHaveBeenCreated
source: No sessions have been created. Start by creating one.
de: Keine Sitzung wurde gestartet. Starte indem du eine erstellst.
es_es: No se han creado sesiones. Comienza por crear una.
fr: Aucune session n'a été créée. Commencez par en créer une.
id: Tidak ada sesi yang dibuat. Mulai dengan membuat sesi.
it_it: Nessuna sessione trovata. Inizia creandone una!
ja: セッションがありません。 セッションを作成することから始めます。
uk: Сісію не було створено. Почніть створення.
vi: Không có danh sách nào được tạo Hãy tạo một cái đi.
zh_cn: 无组别。 点击+号创建一个
zh_tw: 尚未建立任何組合 點擊+建立一個

source: My Inventory
de: Mein Inventar
es_es: Mi Inventario
fr: Mon inventaire
id: Inventori saya
it_it: Il mio inventario
ja: インベントリ
uk: Мій інвентар
vi: Túi đồ
zh_cn: 我的物品栏
zh_tw: 我的背包

# addTheItemsYouGotInGame
source: Add the items you have got in the game
de: Füge die Items hinzu die du im Spiel besitzt
es_es: Añade los items que has obtenido en el juego
fr: Ajoutez les objets que vous avez en jeu
id: Tambahkan item yang kamu dapatkan di dalam game
it_it: Aggiungi i materiali che possiedi nel gioco
ja: ゲームで入手したアイテムを追加します
uk: Додайте предмети, які є в вас у грі
vi: Thêm các vật phẩm trong game
zh_cn: 添加在游戏中获得的物品
zh_tw: 加入您已擁有的物品

source: Quantity
de: Menge
es_es: Cantidad
fr: Quantité
id: Kuantitas
it_it: Quantità
ja: 数量
uk: Кількість
vi: Số lượng
zh_cn: 数量
zh_tw: 數量

# useMaterialsFromInventory
source: Use materials from my inventory
de: Benutzte Materialien aus dem Spiel
es_es: Usar materiales de mi inventario
fr: Utiliser matériaux de mon inventaire
id: Gunakan material dari inventori saya
it_it: Utilizza materiali dal mio inventario
ja: インベントリから材料を使用する
uk: Використати матеріали з мого інвентарю
vi: Sử dụng từ kho của tôi
zh_cn: 使用物品栏中的材料
zh_tw: 使用背包中的素材

source: Information
es_es: Información
id: Informasi
it_it: Informazioni
ja: 情報
uk: Інформація
vi: Thông tin
zh_cn: 说明
zh_tw: 說明

source: Priority
de: Priorität
es_es: Prioridad
fr: Priorité
id: Prioritas
it_it: Priorità
ja: 並び替え
uk: Пріоритет
vi: Ưu tiên
zh_cn: 优先级
zh_tw: 自訂排序

# holdToReorder
source: Hold and move to reorder
de: Halte und Bewege um einzuordnen
es_es: Presiona, mantén y mueve para reordenar
fr: Maintenir et glisser pour réorganiser
id: Tahan dan geser untuk menyusun ulang
it_it: Tieni premuto e muovi per riordinare
ja: 押し続けて並べ替える
uk: Утримуйте та переміщуйте, щоб змінити порядок
vi: Giữ và di chuyển để sắp xếp
zh_cn: 按住并拖动以排序
zh_tw: 按住並移動以重新排序

# calcSessionInfoMsgA
source: Sessions allows you to make calculations for specific characters or weapons.
de: Sitzungen erlauben die Rechnungen für bestimmte Charaktere oder Waffen zu machen.
es_es: Las sesiones te permiten hacer cálculos para personajes o armas específicas.
fr: Les sessions vous permettent de faire des calculs pour des personnages ou armes spécifiques.
id: Sesi memungkinkan kamu untuk membuat kalkulasi untuk karakter atau senjata tertentu.
it_it: Le sessioni permettono di calcolare i materiali necessari per determinate armi o personaggi.
ja: セッションでは、特定のキャラクターや武器の計算を行うことができます。
uk: Сесії дозволяють робити розрахунки для конкретних персонажів або зброї.
vi: Danh sách cho phép bạn tính toán tài nguyên cho các nhân vật và vũ khí cụ thể.
zh_cn: 组别允许你对特殊角色或武器进行计算。
zh_tw: 組合讓您能夠針對角色及武器計算所需素材

# calcSessionInfoMsgB
source: If you opted to use materials from your inventory, the order of the sessions will determine the priority in which they will be used.
de: Wenn Sie sich für die Verwendung von Materialien aus Ihrem Inventar entschieden haben, bestimmt die Reihenfolge der Sitzungen die Priorität, in der sie verwendet werden..
es_es: Si optaste por usar materiales de tu inventario, el orden de las sesiones determinará la prioridad en la que son usados.
fr: Si vous avez choisis d’utiliser les matériaux de votre inventaire, l’ordre des sessions va déterminer la priorité avec laquelle ils vont être utilisés.
id: Jika kamu memilih untuk menggunakan material dari invetory kamu, urutan sesi akan menentukan prioritas penggunaannya.
it_it: Se scegli di usare i materiali dal tuo inventario, l'ordine di collocamento delle sessioni determinerà la priorità d'uso di tali materiali.
ja: インベントリからの材料を使用することを選択した場合、セッションの順序によって、それらが使用される優先順位が決まります。
uk: Якщо ви вирішили використовувати матеріали зі свого інвентарю, порядок сеансів визначатиме пріоритет, у якому вони використовуватимуться.
vi: Nếu bạn chọn sử dụng tài nguyên từ túi của mình, thứ tự của các danh sách tự xếp dựa vào tổng nguyên liệu có trong túi.
zh_cn: 如果选择了“使用物品栏中的材料”，组别的顺序就会决定材料使用的优先级。
zh_tw: 如果您選擇「使用背包中的素材」，素材將會依組合排序優先使用

# calcSessionInfoMsgC
source: The order of the items inside a session is also considered as well.
de: Die Ordnung der Materialien in den Sitzungen wird auch beachtet.
es_es: El orden de los items dentro de una sesión también es considerado.
fr: L’ordre des objets dans une session est aussi pris en compte.
id: Urutan item di dalam sesi juga dipertimbangkan.
it_it: In questa assegnazione si considera anche l'ordine del contenuto (armi / personaggi) delle singole sessioni.
ja: セッション内のアイテムの順序も考慮されます。
uk: Порядок елементів у сесії також враховується.
vi: Thứ tự các mục trong danh sách cũng tương tự vậy.
zh_cn: 组别内部的物品也会纳入考虑。
zh_tw: 組合內的物品亦會納入考量

# calcSessionInfoMsgD
source: Changing the session's priority will automatically redistribute the materials only if you selected the " {useMaterialsFromInventory} " option.
de: Beim ändern der Sitzungspriorität wird automatisch die verteilung erneuert, jedoch nur wenn du die" {useMaterialsFromInventory} " Option gewählt hast.
es_es: Al cambiar la prioridad de una sesión, ocasionará que se redistribuyan los materiales solo si seleccionaste la opción " {useMaterialsFromInventory} " option.
fr: Changer la priorité d'une session va automatiquement redistribuer les matériaux seulement si vous avez sélectionné l’option "{useMaterialsFromInventory}".
id: Mengubah prioritas sesi akan secara otomatis mendistribusikan ulang material hanya jika kamu memilih opsi " {useMaterialsFromInventory} ".
it_it: Se hai selezionato l’opzione ' {useMaterialsFromInventory} ', quando cambi la priorità d’uso di una sessione i materiali saranno riassegnati automaticamente.
ja: セッションの優先度を変更すると、 " {useMaterialsFromInventory} " オプションを選択した場合にのみ、素材が自動的に再計算されます。
uk: Зміна пріоритету сесії призведе до автоматичного перерозподілу матеріалів, лише якщо ви вибрали опцію " {useMaterialsFromInventory} ".
vi: Việc thay đổi thứ tự danh sách sẽ phụ thuộc vào tùy chọn vào cài đặt " {useMaterialsFromInventory} ".
zh_cn: 仅当“{useMaterialsFromInventory}”被选中时，改变组别的优先级才会自动重新分配材料。
zh_tw: 當您選擇「使用背包中的素材」時，更改組合的排序將會重新分配優先使用順序

# calcSessionInfoMsgE
source: An indicator of the used materials by your sessions will be shown in the " {myInventory} " page.
de: Ein Indikator von den benutzten Materialien in ihrer Sitzung wird in der " {myInventory} " Seite angezeigt.
es_es: Un indicador de los materiales usados en tus sesiones será mostrado en la página " {myInventory} ".
fr: Un indicateur de matériaux utilisés par vos sessions sera affiché dans la page "{myInventory}".
id: Indikator material yang digunakan oleh sesi kamu akan ditampilkan pada halaman " {myInventory} ".
it_it: Un indicatore di quantità del materiale utilizzato nelle sessioni apparirà nella pagina " {myInventory} ".
ja: セッションで使用された材料の個数は、 " {myInventory} " ページに表示されます。
uk: Індикатор використаних матеріалів вашими сесіями буде показано на сторінці " {myInventory} ".
vi: Chỉ hiển thị các tài nguyên cần thiết.
zh_cn: 组别中已使用的材料会在“{myInventory}”页面中显示。
zh_tw: 已在組別中使用的素材將會顯示在「我的背包」頁面

source: Grouped
de: Gruppiert
es_es: Agrupado
fr: Groupé
id: Dikelompokkan
it_it: Raggruppato
ja: グループ化
uk: Згрупувати
vi: Nhóm lại
zh_cn: 分组
zh_tw: 分組

source: Copy
de: Kopiert
es_es: Copiar
fr: Copier
id: Salin
it_it: Copia
ja: コピー
uk: Копіювати
vi: Sao chép
zh_cn: 复制
zh_tw: 複製

source: Mark as used
de: Markiere als verwendet
es_es: Marcar como usado
fr: Marquer comme utilisé
id: Tandai sebagai digunakan
it_it: Segna come usato
ja: 使用済みとしてマーク
uk: Позначити як використовувані
vi: Đánh dấu đã sử dụng
zh_cn: 标记为已使用
zh_tw: 標示為已使用

source: Mark as unused
de: Markiere als noch nicht verwendet
es_es: Marcar como no usado
fr: Marquer comme inutilisé
id: Tandai sebagai tidak digunakan
it_it: Segna come non usato
ja: 未使用としてマーク
uk: Позначити як невикористовувані
vi: Đánh dấu chưa sử dụng
zh_cn: 标记为未使用
zh_tw: 標示為未使用

source: Monsters
de: Monster
es_es: Monstruos
fr: Monstres
id: Monster
it_it: Nemici e mostri
ja: モンスター
uk: Істоти
vi: Quái vật
zh_cn: 怪物
zh_tw: 討伐

# checkAllMonsters
source: Check all the available monsters
de: Überprüfe alle Verfügbaren Monster
es_es: Comprueba todos los monstruos disponibles
fr: Voir tous les monstres disponibles
id: Cek semua monster yang ada
it_it: Visualizza tutti i nemici e i mostri disponibili (in arrivo)
ja: すべてのモンスターが確認できます
uk: Переглянути всіх істот
vi: Kiểm tra thông tin các quái vật có sẵn
zh_cn: 检查所有可用怪物
zh_tw: 查看所有討伐對象

source: Abyss Order
de: Der Abgrund
es_es: Orden del Abismo
fr: Ordre de l’Abîme
ja: アビス教団
uk: Маги Безодні
vi: Quái vực sâu
zh_cn: 深渊教团
zh_tw: 深淵教團

source: Elemental LifeForm
de: Elementare Lebensformen
es_es: Formas de Vida Elemental
fr: Forme de vie élémentaire
id: Makhluk Elemental
it_it: Forme di vita elementali
ja: 元素生物
uk: Елементальні Істоти
vi: Quái nguyên tố
zh_cn: 元素生物
zh_tw: 元素生物

source: Human
de: Mensch
es_es: Humano
fr: Humain
id: Manusia
it_it: Esseri umani
ja: 宝盗団
uk: Люди
vi: Con người
zh_cn: 人类
zh_tw: 其他人類勢力

source: Magical Beast
de: Mystische Bestien
es_es: Bestia Mágica
fr: Monstre magique
id: Makhluk Mistis
it_it: Bestie mistiche
ja: 元素獣
uk: Містичні істоти
vi: Ma thú đột biến
zh_cn: 魔法怪物
zh_tw: 異種魔獸

source: Hilichurl
de: Hillichurl
fr: Brutocollinus
id: Suku Hilichurl
ja: ヒルチャール
uk: Хілічурли
zh_cn: 丘丘人
zh_tw: 丘丘人

source: Fatui
ja: ファデュイ
uk: Фатуі
zh_cn: 愚人众
zh_tw: 愚人眾

source: Automaton
de: Automata
es_es: Automata
fr: Automate
it_it: Automi
ja: 遺跡ボス
uk: Автоматони
vi: Cơ quan tự động
zh_cn: 自律机关
zh_tw: 遺跡機器人

source: Dropped by
de: Beute von
es_es: Dejado por
fr: Donné par
id: Dijatuhkan oleh
it_it: Origine
ja: アイテムドロップ
uk: Випадає З
vi: Rơi ra từ
zh_cn: 掉落于
zh_tw: 來源

source: Press once again to exit
de: Drücke ein weiteres Mal zum verlassen
es_es: Presiona una vez más para salir
fr: Réappuyer pour quitter
id: Tekan sekali lagi untuk keluar
it_it: Premi ancora per uscire
ja: もう一度押すと終了します
uk: Натисніть ще раз, щоб вийти
vi: Nhấn lần nữa để thoát
zh_cn: 再试一次以退出
zh_tw: 再點擊一次退出

source: Discord Server
es_es: Servidor de Discord
fr: Serveur Discord
id: Server Discord
it_it: Server Discord
ja: Discordサーバー
vi: Tham gia Discord
zh_cn: Discord 服务器
zh_tw: Discord 伺服器

source: Used item
de: Benutzter Gegenstand
es_es: Item usado
fr: Objet utilisé
id: Item digunakan
it_it: Materiale in uso
ja: 使用したアイテム
uk: Використаний предмет
vi: Vật phẩm đã sử dụng
zh_cn: 已使用的物品
zh_tw: 已使用的項目

# itemIsBeingUsedOnACalculation
source: This item is being used in one or more calculator sessions. The used quantity is {quantity}
de: Dieses Item wird bereits in anderen Listen verwendet. Die Benutzte Anzahl ist {quantity}
es_es: Este item está siendo usado en una o más sesiones de la calculadora. La cantidad usada es {quantity}
fr: Cet objet est utilisé dans une ou plusieurs sessions de calcul. La quantité utilisée est: {quantity}.
id: Item ini sedang digunakan dalam satu atau beberapa sesi kalkulator. Jumlah yang digunakan adalah {quantity}
it_it: Questo materiale è presente in una o più sessioni della calcolatrice. La quantità usata è {quantity}
ja: このアイテムは、1つ以上の計算機のセッションで使用されています。 使用された数量は {quantity} です。
uk: Цей предмет використовується в одному або кількох сеансах калькулятора. Використана кількість становить {quantity}
vi: Vật phẩm này đang được sử dụng trong danh sách. Số lượng là {quantity}
zh_cn: 该物品已在一个或多个组别中使用。 已使用数量：{quantity}
zh_tw: 該素材已在一個或多個計算器組合中使用。 已使用 {quantity} 個

# useOfficialMap
source: Use the official map
de: Benutze die offizielle Karte
es_es: Usar el mapa oficial
fr: Utiliser la carte officielle
id: Gunakan map official
it_it: Abilita la mappa ufficiale
ja: 公式マップを使用する
uk: Використовувати офіційну карту
vi: Sử dụng bản đồ chính thức của HoYoLAB
zh_cn: 使用官方地图
zh_tw: 使用官方地圖

source: Daily Check-In
de: Täglicher Check-In
es_es: Inicio de Sesión Diario
fr: Récompenses Quotidiennes
id: Check-In Harian
it_it: Check-In Giornaliero
ja: デイリーログインボーナス
uk: Щоденні відмітки
vi: Điểm danh ngày
zh_cn: 「原神」每日签到
zh_tw: 【原神】每日簽到

# dailyCheckInMsg
source: Don't forget to claim your daily rewards here !
de: Vergiss nicht deine Täglichen Belohnungen abzuholen!
es_es: ¡ No olvides reclamar tus recompensas diarias aqui !
fr: N'oubliez pas de récupérer vos récompenses quotidiennes ici !
id: Jangan lupa untuk mengklaim hadiah harian kamu disini !
it_it: Riscatta qui le tue ricompense giornaliere!
ja: 毎日の報酬を忘れずに受け取りましょう。
uk: Не забудьте отримати свою щоденну винагороду тут !
vi: Đừng quên nhận thưởng hằng ngày nhé!
zh_cn: 别忘了来这里看看你的每日奖励！
zh_tw: 別忘了領取您的每日獎勵！

# noGameCodesHaveBeenLoaded
source: No game codes have been loaded yet
de: Es wurden noch keine Codes geladen
es_es: Aún no han sido cargados los códigos del juego
fr: Aucun code promotionnel n’est disponible actuellement
id: Belum ada kode redeem yang dimuat
it_it: Nessun codice disponibile
ja: ゲームコードはまだロードされていません
uk: Промокоди гри ще не завантажились
vi: Chưa có mã đổi thưởng nào được tải lên
zh_cn: 未加载游戏兑换码
zh_tw: 尚未載入任何兌換碼

# addedOn
source: Added on: {date}
de: Hinzugefügt am: {date}
es_es: Agregado el: {date}
fr: Ajouté le: {date}
id: Ditambahkan pada: {date}
it_it: Aggiunto il: {date}
ja: 追加日: {date}
uk: Додано: {date}
vi: Thêm vào: {date}
zh_cn: 添加于: {date}
zh_tw: 新增日期： {date}

# expiredOn
source: Expired on: {date}
de: Abgelaufen am: {date}
es_es: Expirado el: {date}
fr: Expire le: {date}
id: Kadaluarsa pada: {date}
it_it: Scaduto il: {date}
ja: 有効期限: {date}
uk: Термін дії вийшов: {date}
vi: Hết hạn lúc: {date}
zh_cn: 过期于: {date}
zh_tw: 失效日期： {date}

# validUntil
source: Valid until: {date}
de: Gültig bis: {date}
es_es: Válido hasta el: {date}
fr: Valide jusqu’au: {date}
id: Valid sampai: {date}
it_it: Valido fino al: {date}
ja: 有効期限: {date}
uk: Дійсний до: {date}
vi: Có hiệu lức đến khi: {date}
zh_cn: 有效期至: {date}
zh_tw: 有效期限： {date}

# internetIsRequiredToRefreshItems
source: To refresh the content you need an internet connection
de: Du benötigst eine Internetverbindung um die Inhalte zu laden
es_es: Para refrescar el contenido necesitas estar conectado a internet
fr: Une connexion internet est requise pour actualiser le contenu
id: Untuk me-refresh konten, kamu memerlukan koneksi internet
it_it: Per ricaricare i contenuti è necessaria una connessione a internet
ja: コンテンツを更新するには、インターネット接続が必要です
uk: Щоб оновити вміст, потрібне підключення до Інтернету
vi: Để làm mới nội dụng cần kết nối Internet
zh_cn: 需要连接网络以刷新内容
zh_tw: 連接網際網路以更新資訊

# pullToRefreshItems
source: Pull to refresh the content
de: Ziehe um die Inhalte zu aktualisieren
es_es: Desliza hacia abajo para actualizar el contenido
fr: Tirer pour actualiser le contenu
id: Tarik untuk me-refresh konten
it_it: Premi per ricaricare i contenuti
ja: 引っ張って更新
uk: Потягніть, щоб оновити вміст
vi: Kéo để làm mới nội dung
zh_cn: 下拉刷新内容
zh_tw: 下拉重新整理取得資訊

# onlyX
source: Only {value}
de: nur {value}
es_es: Solo {value}
fr: Seulement {value}
id: Hanya {value}
it_it: Solo {value}
ja: {value} サーバーのみ
uk: Тільки {value}
vi: Duy nhất {value}
zh_cn: 仅 {value}
zh_tw: 僅適用於{value}

source: Notifications
de: Benachrichtigungen
es_es: Notificaciones
id: Notifikasi
it_it: Notifiche
ja: 通知
uk: Сповіщення
vi: Thông báo
zh_cn: 通知
zh_tw: 提醒

source: Start by creating a notification
de: Beginne in dem du eine Benachrichtigung erstellst
es_es: Comienza por crear una notificación
fr: Commencez par créer une notification
id: Mulai dengan membuat notifikasi
it_it: Nessuna notifica trovata. Inizia creandone una!
ja: 通知を作成することから始めます
uk: Почніть створення сповіщення
vi: Bắt đầu bằng cách tạo một thông báo
zh_cn: 创建一个通知以继续
zh_tw: 點擊+建立一個提醒

source: Notification Type
de: Nachrichtentyp
es_es: Tipo de Notificación
fr: Type de notification
id: Tipe Notifikasi
it_it: Tipo di notifica
ja: 通知の種類
uk: Тип Сповіщення
vi: Loại
zh_cn: 通知类别
zh_tw: 提醒類別

source: Add Notification
de: Benachrichtigung hinzufügen
es_es: Agregar Notificación
fr: Ajouter une notification
id: Tambahkan Notifikasi
it_it: Crea
ja: 通知作成
uk: Додати Сповіщення
vi: Thêm thông báo
zh_cn: 添加通知
zh_tw: 新增提醒

source: Edit Notification
de: Benachrichtigung bearbeiten
es_es: Editar Notificación
fr: Modifier une notification
id: Ubah Notifikasi
it_it: Modifica
ja: 通知編集
uk: Редагувати Сповіщення
vi: Chỉnh sửa
zh_cn: 编辑通知
zh_tw: 編輯提醒
