Repository: Wolfteam/Shiori
Catalog: lib/l10n/intl_*.arb
Languages: de, es_es, fr, id, it_it, ja, uk, vi, zh_cn, zh_tw

# xHours
source: {value} hours
de: {value} Stunden
es_es: {value} horas
fr: {value} heure(s)
id: {value} Jam
it_it: {value} ora(e)
ja: {value} 時間
uk: {value} годин
vi: {value} Giờ
zh_cn: {value}小时
zh_tw: {value} 小時

# inXHours
source: In {value} hour(s)
de: In {value} Stunde(n)
es_es: En {value} hora(s)
fr: Dans {value} heure(s)
id: Dalam {value} jam
it_it: di {value} ora(e)
ja: {value} 時間後
uk: Через {value} годин(у)
vi: Trong {value} giờ(s)
zh_cn: 在{value}小时内
zh_tw: 在 {value} 小時後

# xEachHour
source: {value} each hour
de: {value} jede Stunde
es_es: {value} cada hora
fr: {value} par heure
id: {value} setiap jam
it_it: {value} ogni ora
ja: {value} 時間毎
uk: {value} кожну годину
vi: {value} mỗi giờ
zh_cn: {value}每小时
zh_tw: 每 {value} 小時

source: Show notification
de: Zeige Benachrichtigung
es_es: Mostrar notificación
fr: Afficher la notification
id: Tampilkan notifikasi
it_it: Mostra notifica
ja: 通知の表示
uk: Показати Сповіщення
vi: Hiển thị thông báo
zh_cn: 显示通知
zh_tw: 顯示通知

source: Expedition
es_es: Expedición
fr: Expédition
id: Ekspedisi
it_it: Spedizione
ja: 遠征
uk: Експедиція
vi: Phái Đi Thám Hiểm
zh_cn: 派遣
zh_tw: 探索派遣

source: Expedition Time
de: Expeditionsdauer
es_es: Tiempo de Expedición
fr: Durée d’expédition
id: Waktu Ekspedisi
it_it: Tempo della spedizione
ja: 遠征時間
uk: Час Експедиції
vi: Thời Gian
zh_cn: 派遣时长
zh_tw: 探索時長

source: Time
de: Zeit
es_es: Tiempo
fr: Temps
id: Waktu
it_it: Tempo
ja: 時間
uk: Час
vi: Thời Gian
zh_cn: 时间
zh_tw: 時間

source: Resin
de: Harz
es_es: Resina
fr: Résine
it_it: Resina
ja: 樹脂
uk: Смола
vi: Nhựa Nguyên Chất
zh_cn: 树脂
zh_tw: 樹酯

source: Farming
de: Farmen
es_es: Farmeo
fr: Approvisionnement
ja: 収集
uk: Добування
vi: Cày Cuốc
zh_cn: 野外
zh_tw: 採集

source: Gadget
de: Gerät
es_es: Artilugio
ja: 便利ツール
uk: Інстумент
vi: Đạo Cụ Nhỏ
zh_cn: 小道具
zh_tw: 參數質變儀

source: Furnishing
de: Einrichtung
es_es: Decoración
fr: Décorations
id: Furnitur
it_it: Decorazioni del Serenitea Pot
ja: 調度品
uk: Меблі
vi: Ấm Trần Ca
zh_cn: 家园建造
zh_tw: 製作擺設

source: Realm Currency
de: Kannentaler
es_es: Intramora
fr: Pièces du royaume
it_it: Moneta del regno
ja: 洞天宝銭
uk: Скарби Обителі
vi: Tiền Động Tiên
zh_cn: 洞天宝钱
zh_tw: 洞天寶錢

source: Realm Rank
es_es: Rango
fr: Niveau du royaume
it_it: Livello del regno
ja: 洞天仙力
uk: Рівень Сили Адептів
vi: Cấp Động Tiên Bảo Giám
zh_cn: 洞天仙力等阶
zh_tw: 洞天仙力

source: Trust Rank
de: Vertrauensstufe
es_es: Rango de Confianza
fr: Niveau de confiance
id: Tingkat Kepercayaan
it_it: Grado di fiducia
ja: 信頼ランク
uk: Рівень Довіри
vi: Cấp Tín Nhiệm
zh_cn: 信任等阶
zh_tw: 信任等階

source: Title
de: Titel
es_es: Título
fr: Titre
id: Judul
it_it: Titolo
ja: タイトル
uk: Заголовок
vi: Tiêu đề
zh_cn: 标题
zh_tw: 標題

source: Body
de: Körper
es_es: Cuerpo
fr: Corps
id: Isi
it_it: Corpo
ja: 本文
uk: Зміст
zh_cn: 内容
zh_tw: 內容

# twentyFivePercentTimeReduction
source: 25% Time Reduction
de: 25% Verkürzung der Zeit
es_es: 25% Reducción de Tiempo
fr: Réduction de temps de 25%
id: 25% Pengurangan Waktu
it_it: Bonus riduzione tempo del 25%
ja: 25％の時間短縮
uk: Скоротити час на 25%
vi: 25% Giảm Thời Gian
zh_cn: 减少 25% 时间
zh_tw: 減少25%時間

source: Invalid date
de: ungültiges Datum
es_es: Fecha inválida
fr: Date incorrecte
id: Tanggal tidak valid
it_it: Data non valida!
ja: 日付が無効です
uk: Невірна дата
vi: Thời gian không hợp lệ
zh_cn: 无效日期
zh_tw: 失效日期

source: Reset
de: Zurücksetzen
es_es: Reiniciar
fr: Réinitialiser
it_it: Resetta
ja: リセット
uk: Скидання
vi: Đặt lại
zh_cn: 重置
zh_tw: 重設

source: Stop
es_es: Detener
fr: Arrêter
it_it: Ferma
ja: ストップ
uk: Зупинити
vi: Dừng
zh_cn: 停止
zh_tw: 停止

source: Completed
de: Fertig
es_es: Completado
fr: Terminé
id: Selesai
it_it: Completato
ja: 完了
uk: Завершено
vi: Hoàn Thành
zh_cn: 完成
zh_tw: 完成

source: Select an artifact
de: Wähle ein Artefakt
es_es: Selecciona un artefacto
fr: Sélectionnez un artéfact
id: Pilih artefak
it_it: Seleziona un manufatto
ja: 聖遺物を選択
uk: Обрати Артефакт
vi: Chọn Thánh Di Vật
zh_cn: 选择圣遗物
zh_tw: 選擇一個聖遺物

source: Select a monster
de: Wähle ein Monster
es_es: Selecciona un monstruo
fr: Sélectionnez une créature
id: Pilih monster
it_it: Seleziona un nemico / mostro
ja: モンスターを選択
uk: Обрати Істоту
vi: Chọn Quái
zh_cn: 选择怪物
zh_tw: 選擇一個怪物

source: Select a material
de: Wähle ein Material
es_es: Selecciona un material
fr: Sélectionnez un matériau
id: Pilih material
it_it: Seleziona un materiale
ja: 材料を選択
uk: ОБрати Матеріал
vi: Chọn Nguyên Liệu
zh_cn: 选择材料
zh_tw: 選擇一個素材

source: Custom
de: Benutzerdefiniert
es_es: Personalizado
fr: Personnaliser
it_it: Personalizzato
ja: カスタム
uk: Свій
vi: Tùy Chọn
zh_cn: 自定义
zh_tw: 自定義

source: Create your custom notifications
de: Erstelle eine benutzerdefinierte Benachrichtigung
es_es: Crea tus notificaciones personalizadas
fr: Créez des notifications personnalisées
id: Buat custom notifikasi kamu
it_it: Crea notifiche personalizzate
ja: カスタム通知を作成できます
uk: Створіть власні сповіщення
vi: Tạo thông báo cho mình
zh_cn: 创建自定义通知
zh_tw: 建立一個自定義提醒

source: Bare Bones
de: Primitiv
es_es: Alojamiento Básico
fr: Logement rudimentaire
id: Lahan Kosong
it_it: Semplice ed essenziale
ja: 上漏下湿
uk: Порожньо
vi: Cũng Có Gian Phòng
zh_cn: 初有陋室

source: Humble Abode
de: Heimelig
es_es: Humilde Morada
fr: Humble demeure
id: Gubuk Sederhana
it_it: Umile dimora
ja: 環堵蕉然
uk: Скромно
vi: Đơn Sơ Giản Dị
zh_cn: 竹篱茅舍

source: Cozy
de: Gemütlich
es_es: Hogar Acogedor
fr: Maison confortable
id: Rumah Nyaman
it_it: Accogliente
ja: 蝸牛之庵
uk: Затишно
vi: Nhà Cửa Trang Nghiêm
zh_cn: 屋舍俨然

source: Queen Size
de: Vorzeigbar
es_es: Vivienda Espaciosa
fr: Pavillon spacieux
id: Rumah Besar
it_it: A misura di regina
ja: 土階茅茨
uk: Просторо
vi: Nhà Cao Cửa Rộng
zh_cn: 高门大屋

source: Elegant
de: Wunderschön
es_es: Residencia Elegante
fr: Résidence de charme
id: Rumah Elegan
it_it: Elegante
ja: 茅屋采椽
uk: Елегантно
vi: Bước Đầu Sang Trọng
zh_cn: 初显锦绣

source: Exquisite
de: Prächtig
es_es: Aposento Refinado
fr: Hôtel raffiné
id: Rumah Indah
it_it: Ricercato
ja: 大門高台
uk: Вишукано
vi: Đẹp Đẽ Hoành Tráng
zh_cn: 美轮美奂

source: Extraordinary
de: Luxuriös
es_es: Villa Espléndida
fr: Villa luxueuse
id: Rumah Megah
it_it: Straordinario
ja: 土木壮麗
uk: Надзвичайно
vi: Lộng Lẫy Tuyệt Vời
zh_cn: 富丽堂皇

source: Stately
de: Atemberaubend
es_es: Casa Señorial
fr: Maison de maître
id: Rumah Klasik
it_it: Imponente
ja: 光禄池台
uk: Багато
vi: Nguy Nga Tráng Lệ
zh_cn: 丹楹刻桷

source: Luxury
de: Königlich
es_es: Mansión Lujosa
fr: Manoir cossu
id: Rumah Mewah
it_it: Di lusso
ja: 桂殿蘭宮
uk: Велично
vi: Dinh Thự Xa Hoa
zh_cn: 广夏细旃

source: Fit For A King
de: Paradies
es_es: Palacio Real
fr: Palais royal
id: Istana Raja
it_it: Da re
ja: 玉楼金殿
uk: Розкішно
vi: Cung Vàng Điện Ngọc
zh_cn: 贝阙珠宫

# notifInfoMsgA
source: You can schedule notifications that reminds you particular things in the game.
de: Du kannst die Benachrichtigung so einstellen dass sie dich auf bestimmte Dinge im Spiel erinnern.
es_es: Puedes programar notificaciones que te recuerden cosas particulares en el juego.
fr: Vous pouvez programmer des notifications pour vous souvenir des choses à faire en jeu.
id: Kamu bisa menjadwal notifikasi yang mengingatkan kamu hal-hal tertentu di dalam game.
it_it: Puoi programmare notifiche per ricordarti di determinate cose nel gioco.
ja: ゲームの特定のことを思い出させる通知をスケジュールすることができます。
uk: Ви можете запланувати сповіщення, які нагадують вам про певні речі в грі.
vi: Bạn có thể lên lịch thông báo nhắc nhở những điều trong trò chơi.
zh_cn: 使用通知为游戏里的特殊物品设置提醒。
zh_tw: 為遊戲中各種事物建立提醒

# notifInfoMsgB
source: Some of these can be customized to suit your needs.
de: Manche können so modifiziert werden wie du es willst.
es_es: Algunas de estas pueden ser configuradas para satisfacer tus necesidades.
fr: Certaines notifications peuvent être personnalisées selon vos besoins.
id: Beberapa diantaranya dapat disesuaikan dengan kebutuhan kamu.
it_it: Alcune notifiche si possono personalizzare in base alle proprie esigenze.
ja: これらのいくつかは、ニーズに合わせてカスタマイズできます。
uk: Деякі з них можна налаштувати відповідно до ваших потреб.
vi: Trong này có thể tùy chỉnh để phù hợp với bạn hơn.
zh_cn: 可自定义部分内容以满足个性化需求。
zh_tw: 部分項目可自定義以滿足您的需求

# notifInfoMsgC
source: The bell icon indicates that a notification is scheduled to be shown on your device even when the app is not running.
de: Die Glocke zeigt dass eine Benachrichtigung auf deinem Telefon angezeigt wird, selbst wenn die App nicht läuft.
es_es: El ícono de la campana indica que una notificación esta programada para ser mostrada en tu equipo aun cuando la aplicación no está en ejecución.
fr: La cloche indique que la notification programmée apparaîtra sur votre appareil même lorsque l’application est fermée.
id: Ikon lonceng menunjukkan bahwa notifikasi telah dijadwalkan untuk ditampilkan di perangkat kamu bahkan saat aplikasi tidak berjalan.
it_it: La campanellina indica che la notifica è impostata per apparire sul tuo dispositivo anche quando l’app non è in esecuzione.
ja: ベルのアイコンは、アプリが実行されていないときでも、デバイスに通知が表示されるようにスケジュールされていることを示します。
uk: Піктограма дзвіночка вказує на те, що на вашому пристрої заплановано показ сповіщень, навіть якщо додаток не запущено.
vi: Biểu tượng "Chuông" cho biết rằng thông báo này có thể chạy cả khi ứng dụng không mở.
zh_cn: 铃铛图标表示即使此App未运行，通知也会显示在你的设备上。
zh_tw: 鈴鐺圖示代表即便本應用程式未啟動，設定的提醒也會透過推播通知提醒您。

# notifInfoMsgD
source: Some notifications allows you to change the showed image on the list
de: Bei manchen Benachrichtigungen kannst du das Bild ändern
es_es: Algunas notificaciones te permiten cambiar la imagen que se muestra en la lista
fr: Certaines notifications vous permettent de changer l’image associée dans la liste.
id: Beberapa notifikasi memungkinkan kamu untuk mengubah gambar yang ditampilkan pada daftar
it_it: Alcune notifiche permettono di cambiare l’immagine di anteprima nella lista
ja: 一部の通知では、リストに表示される画像を変更できます
uk: Деякі сповіщення дозволяють змінити зображення, що відображається у списку
vi: Một số thông báo có thể thay đổi icon hiển thị.
zh_cn: 部分通知允许你修改列表中显示的图片。
zh_tw: 您可以更改部分提醒所顯示的圖片

# notifInfoMsgE
source: Some Android OEMs have their own customized Android OS that can prevent applications from running in the background. Consequently, scheduled notifications may not work when the application is in the background on certain devices (e.g. by Xiaomi, Huawei). So if you encounter this problem, you may have to look for a setting that allows you to control which applications run in the background.
de: Einige Android-OEMs haben ihr eigenes angepasstes Android-Betriebssystem, das verhindern kann, dass Anwendungen im Hintergrund ausgeführt werden. Folgendlich funktionieren geplante Benachrichtigungen möglicherweise nicht, wenn sich die Anwendung auf bestimmten Geräten im Hintergrund befindet (z. B. von Xiaomi, Huawei). Wenn sie auf dieses Problem stoßen, müssen Sie möglicherweise nach einer Einstellung suchen, mit der Sie steuern können, welche Anwendungen im Hintergrund ausgeführt werden.
es_es: Algunos fabricantes de equipos con Android tienen su propia versión personalizada de Android lo cual puede evitar que aplicaciones corran en segundo plano. Por ende, las notificaciones programdas podrian no funcionar cuando la aplicación esta en segundo plano en ciertos dispositivos (por ejemplo: Xiaomi, Huawei). Si presentas este problema, puede que debas buscar una configuración que te permita controlar que aplicaciones corren en segundo plano.
fr: Les OEM de certains Android ont un système d'exploitation Android personnalisé et peuvent empêcher certaines applications de tourner en arrière-plan. Par conséquent, les notifications programmées pourraient ne pas fonctionner lorsque l'application tourne en arrière-plan sur certains appareils (Exemple : Xiaomi, Huawei, etc.). Si vous rencontrez ce problème, vérifiez le paramètre qui vous permet de contrôler quelles applications tournent en arrière-plan.
id: Beberapa OEM Android memiliki OS Android khusu mereka sendiri yang dapat mencegah aplikasi berjalan di belakang layar. Akibatnya, notifikasi yang terjadwal mungkin tidak berjalan saat aplikasi berada di belakang layar pada perangkat tertentu (misalnya Xiaomi, Huawei). Jadi, jika kamu mengalami masalah ini, kamu mungkin harus mencari pengaturan yang memungkinkan kamu mengontrol aplikasi mana yang dapat berjalan di belakang layar.
it_it: Alcuni Android OEMs (dispositivi) hanno un Sistema Operativo Android che impedisce di eseguire l’applicazione in background. Alcune notifiche programmate potrebbero non funzionare su alcuni dispositivi (es. Xiaomi, Huawei). Se riscontri questo problema cerca nell’impostazione che regola la gestione delle applicazioni in background.
ja: 一部の Android OEM は、アプリケーションがバックグラウンドで実行されないように独自にカスタマイズした Android OS を持っています。 その結果、特定のデバイス (Xiaomi、Huawei など) でアプリケーションがバックグラウンドにある場合、スケジュールされた通知が機能しない場合があります。 この問題を解決するには、バックグラウンドで実行するアプリケーションを制御できる設定を探す必要があります。
uk: В деяких OEM-виробників Android є власні налаштовання ОС Android, які можуть запобігати роботі додатку у фоновому режимі. Отже, заплановані сповіщення можуть не працювати, коли додаток працює у фоновому режимі на певних пристроях (наприклад, від Xiaomi, Huawei). Отже, якщо ви зіткнулися з цією проблемою, вам, можливо, доведеться шукати параметр, який дозволяє контролювати, які програми працюють у фоновому режимі.
vi: Một số thiết bị có thể ngăn ứng dụng chạy trong nền. Do đó các thông báo đã cài đặt sẽ không thể hoạt động trên những thiết bị này. Nếu bạn gặp vấn đề này thì tìm cài đặt cho phép ứng dụng chạy trong nền là được.
zh_cn: 部分 Android 厂商的系统会阻止应用在后台运行。 因此，当应用在后台运行时，通知在某些设备（如小米、华为）上不会正常工作。 如果你遇到了这个问题，你可能需要在设置中打开“允许该应用在后台运行”选项。
zh_tw: 部分使用 Android 系統的廠商有自己特殊的作業系統，本應用程式在某些裝置上（例如：小米、華為）處於後台時，預定的提醒可能會失效。 倘若您遇到了類似的問題，請至設定中允許本應用程式在背景中運作。

# swipeToSeeMoreOptions
source: You can swipe to the right or left to see more options on each item.
de: Ziehe nach Links oder Rechts um mehr Optionen für das Item zu sehen.
es_es: Puedes delizar hacia la derecha o izquierda para ver más opciones en cada item.
fr: Glissez vers la droite ou la gauche pour voir plus d’options sur chaque objet.
id: Kamu dapat menggeser ke kanan atau kiri untuk melihat lebih banyak opsi pada setiap item.
it_it: Scorri a destra o a sinistra per visualizzare più opzioni.
ja: 右または左にスワイプすると、各項目の詳細オプションが表示されます。
uk: Ви можете провести пальцем праворуч або ліворуч, щоб побачити більше параметрів для кожного елемента.
vi: Bạn có thể vuốt sang trái hoặc phải đế xem thêm các tùy chọn.
zh_cn: 左滑或右滑可查看每条通知的更多选项。
zh_tw: 左滑或右滑項目以查看更多選項

source: Reduce Time
de: verkürze Zeit
es_es: Reducir Tiempo
fr: Réduire le temps
id: Kurangi Waktu
it_it: Riduci tempo
ja: 時間を短縮
uk: Скоротити Час
vi: Giảm Thời Gian
zh_cn: 减少时间
zh_tw: 減少時間

source: Use 24 hour format on dates
de: Benutze das 24-Stunden Format
es_es: Usar formato de 24 horas en fechas
fr: Utiliser le format 24 heures pour les dates
id: Gunakan format waktu 24 jam pada tanggal
it_it: Utilizza il formato a 24 ore
ja: 日付に 24 時間形式を使用する
uk: Використовуйте 24-годинний формат для дат
vi: Sử dụng định dạng 24h
zh_cn: 使用24小时制
zh_tw: 使用24小時制

source: Delete all sessions
de: Lösche alle Seiten
es_es: Borrar todas las sesiones
fr: Supprimer toutes les sessions
it_it: Cancella tutte le sessioni
ja: すべてのセッションを削除します
uk: Видалити всі сесії
vi: Xóa tất cả phiên
zh_cn: 删除所有组别

source: Delete all items
de: Lösche alle Items
es_es: Borrar todos los items
fr: Supprimer tous les objets
it_it: Elimina tutti i materiali
ja: すべてのアイテムを削除します
uk: Видалити всі предмети
vi: Xóa tất cả vật phẩm
zh_cn: 删除所有物品

# confirmQuestion
source: Are you sure you wanna proceed ?
de: Bist du sicher du möchtest weitermachen?
es_es: ¿ Estás seguro que deseas continuar ?
fr: Êtes-vous sûr de vouloir continuer ?
it_it: Sei sicuro di voler procedere?
ja: 続行してもよろしいですか？
uk: Ви впевнені, що бажаєте продовжити?
vi: Bạn chắc chắn muốn tiếp tục ?
zh_cn: 确定要进行此操作吗？

source: Game specific
de: Spielspezifisch
es_es: Específicos del juego
fr: Spécificités du jeu
it_it: Specifiche del gioco
ja: ゲーム固有
uk: Довідник
vi: Thông tin chung
zh_cn: 游戏相关

source: Tools
de: Werkzeuge
es_es: Herramientas
fr: Outils
it_it: Strumenti
ja: ツール
uk: Інструменти
vi: Công cụ hỗ trợ
zh_cn: 工具

source: Rank
de: Stufe
fr: Rang
uk: Ранг
vi: Đột phá
zh_cn: 等级
zh_tw: 突破等級

# appVersion
source: Version: {version}
es_es: Versión: {version}
id: Versi: {version}
it_it: Versione: {version}
uk: Версія: {version}
vi: Phiên bản: {version}
zh_cn: 版本 {version}
zh_tw: 版本: {version}

source: About
de: Über
es_es: Acerca de
fr: À propos
id: Tentang
it_it: In breve
uk: Загальна інформація
vi: Thông tin
zh_cn: 关于
zh_tw: 關於

# brandNew
source: New
de: Neu
es_es: Nuevo
fr: Nouveau
id: Baru
it_it: Nuovo
uk: Новий
vi: Mới
zh_cn: 全新
zh_tw: 全新

source: Or
de: oder
es_es: O
fr: Ou
id: Atau
it_it: O
uk: Або
vi: Hoặc
zh_cn: 或
zh_tw: 或

source: N/A
uk: Н/Д
zh_tw: 不適用

source: English
id: Inggris
