Repository: Wolfteam/Shiori
Catalog: lib/l10n/intl_*.arb
Languages: de, es_es, fr, id, it_it, ja, uk, vi, zh_cn, zh_tw

# appName
source: GenshinDb
de: Shiori
es_es: Shiori
fr: Shiori
it_it: Shiori
ja: Shiori
uk: Shiori
vi: Shiori
zh_cn: Shiori
zh_tw: Shiori

source: Dark
de: Dunkel
es_es: Oscuro
fr: Sombre
id: Gelap
it_it: Scuro
ja: ダーク
uk: Темна
vi: Tối
zh_cn: 暗色
zh_tw: 深色

source: Light
de: Hell
es_es: Claro
fr: Clair
id: Terang
it_it: Chiaro
ja: ライト
uk: Світла
vi: Sáng
zh_cn: 亮色
zh_tw: 淺色

source: Spanish
id: Spanyol
ja: Español

source: French
id: Perancis
ja: Français

source: Russian
id: Rusia
ja: Русский

# simplifiedChinese
source: Chinese (Simplified)
id: Tiongkok (Disederhanakan)
ja: 简体中文

source: Portuguese
id: Portugis
ja: Português

source: Italian
id: Italia
ja: Italiano

source: Japanese
id: Jepang
ja: 日本

source: Vietnamese
ja: Tiếng Việt

source: Indonesian
ja: Bahasa Indonesia

source: Bow
de: Bogen
es_es: Arco
fr: Arc
it_it: Arco
ja: 弓
uk: Лук
vi: Cung'
zh_cn: 弓
zh_tw: 弓

source: Claymore
de: Zweihänder
es_es: Mandoble
fr: Épée à deux mains
ja: 両手剣
uk: Двуручний меч
vi: Trọng kiếm
zh_cn: 双手剑
zh_tw: 大劍

source: Sword
de: Einhänder
es_es: Espada
fr: Épée à une main
it_it: Spada
ja: 片手剣
uk: Меч
vi: Kiếm Đơn
zh_cn: 单手剑
zh_tw: 單手劍

source: Polearm
de: Stangenwaffe
es_es: Lanza
fr: Arme d'hast
it_it: Lancia
ja: 長柄武器
uk: Древкове
vi: Thương
zh_cn: 长柄武器
zh_tw: 長槍

source: Catalyst
de: Katalysator
es_es: Catalizador
fr: Catalyseur
it_it: Catalizzatore
ja: 法器
uk: Каталізатор
vi: Pháp khí
zh_cn: 法器
zh_tw: 法器

source: None
de: Keine
es_es: Ninguno
fr: Rien
id: Tidak ada
it_it: Nessuno
ja: なし
uk: Відсутнє
vi: Không có
zh_cn: 无
zh_tw: 無

# atk
source: {value} ATK
de: {value} ANG
es_es: {value} ATQ
fr: {value} ATQ
it_it: {value} ATT
ja: 攻撃力{value}
uk: {value} АТК
vi: Tấn công {value}
zh_cn: {value}攻击

# atkPercentage
source: {value} ATK %
de: {value} ANG %
es_es: {value} ATQ %
fr: {value} ATQ %
it_it: ATT {value}%
ja: 攻撃力 {value}%
uk: {value} АТК %
vi: Tấn công +{value}%
zh_cn: {value}%攻击
zh_tw: {value} 攻擊力 %

# defPercentage
source: {value} DEF %
de: {value} VTD %
fr: {value} DÉF %
it_it: DIF {value}%
ja: 防御力 {value}%
uk: {value} ЗАХ %
vi: Phòng thủ +{value}%
zh_cn: {value}%防御
zh_tw: {value} 防禦力 %

# def
source: {value} DEF
de: {value} VTD
fr: {value} DÉF
it_it: {value} DIF
ja: 防御力{value}
uk: {value} ЗАХ
vi: Phòng thủ +{value}
zh_cn: {value} 防御
zh_tw: {value} 防禦力

# critAtk
source: {value} CRIT ATK
de: {value} KSCH
es_es: {value} ATQ CRIT
fr: {value} DGT CRIT
it_it: {value} ATT CRIT
ja: 会心{value}
uk: {value} Крит. шкода
vi: ST Bạo Kích {value}
zh_cn: {value} 暴击
zh_tw: {value} 暴擊傷害

# critRate
source: {value} CRIT Rate
de: {value} KT
es_es: {value} Prob. CRIT
fr: {value} Taux CRIT
it_it: {value} Tasso di CRIT
ja: 会心率{value}
uk: {value} Шанс. крит.
vi: Tỉ lệ bạo kích {value}
zh_cn: {value} 暴击率
zh_tw: {value} 暴擊率

# critRatePercentage
source: {value} CRIT Rate %
de: {value} KT %
es_es: {value} Prob. CRIT %
fr: {value} Taux CRIT %
it_it: Tasso di CRIT {value}%
ja: 会心率 {value}%
uk: {value} Шанс. крит %
vi: Tỉ lệ bạo kích +{value}%
zh_cn: {value}%暴击率
zh_tw: {value} 暴擊率 %

# critDmgPercentage
source: {value} CRIT DMG %
de: {value} KSCH %
es_es: {value} Daño CRIT %
fr: {value} DGT CRIT %
it_it: DAN da CRIT {value}%
ja: 会心ダメージ {value}%
uk: {value} Крит. шкода %
vi: ST Bạo kích +{value}%
zh_cn: {value}%暴击伤害
zh_tw: {value} 暴擊傷害 %

# elementaryMastery
source: {value} Elementary Mastery
de: {value} Elementarkunde
es_es: {value} Maestría Elemental
fr: {value} Maîtrise élémentaire
it_it: {value} Maestria elementale
ja: 元素熟知 {value}
uk: {value} Майстерність стихії
vi: Tinh thông nguyên tố {value}
zh_cn: {value}元素精通
zh_tw: {value} 元素精通

# hpPercentage
source: {value} HP %
de: {value} LP %
es_es: {value} Vida %
fr: {value} PV %
it_it: PS {value}%
ja: HP {value}%
vi: HP {value}%
zh_cn: {value}%生命值
zh_tw: {value} 生命值 %

# physDmgPercentage
source: {value} PHYS DMG %
de: {value} Physischer Schaden %
es_es: {value} Daño FIS. %
fr: {value} DGT physiques %
it_it: DAN fisici {value}%
ja: 物理ダメージ {value}%
uk: {value} Фіз. шкода %
vi: Tăng ST Vật Lý {value}
zh_cn: {value}%物理伤害
zh_tw: {value} 物理傷害 %

# physDmgBonus
source: {value} PHYS DMG Bonus
de: {value} Physischer Schaden-Bonus
es_es: {value} Bonus Daño FIS.
fr: {value} Bonus de DGT physiques
it_it: Bonus DAN fisici {value}%
ja: 物理ダメージバフ{value}
uk: {value} Бонус Фіз. шкоди
vi: Tăng ST Vật lý {value}
zh_cn: {value}物理伤害加成
zh_tw: {value} 物理傷害加成

# energyRechargePercentage
source: {value} Energy Recharge %
de: {value} Aufladerate %
es_es: {value} Recarga de Energía %
fr: {value} Recharge d'énergie %
it_it: Ricarica di energia {value}%
ja: 元素チャージ効率 {value}%
uk: {value} Віднов. енергії %
vi: Hiệu quả nạp nguyên tố +{value}%
zh_cn: {value}%充能
zh_tw: {value} 元素充能效率 %

# hp
source: {value} HP
de: {value} LP
es_es: {value} Vida
fr: {value} PV
it_it: {value} PS
ja: HP{value}
vi: HP {value}
zh_cn: {value}生命值
zh_tw: {value} 生命值

# xDmgBonusPercentage
source: {value} {x} DMG Bonus %
es_es: {value} Bonus de Daño {x} %
fr: {value} {x} Bonus de DGT %
it_it: {x} Bonus DAN {value}%
ja: {x}元素ダメージバフ {value}%
uk: {value} Бонус {x} шкоди %
vi: Tăng ST {value} {x}
zh_cn: {value} {x}%伤害加成
zh_tw: {value} {x} 傷害加成 %

# healingBonusPercentage
source: {value} Healing Bonus %
de: {value} Heilungsbonus %
es_es: {value} Bonus de Curación %
fr: {value} Bonus de soin %
it_it: Bonus di guarigione {value}%
ja: 治癒効果バフ {value}%
uk: {value} Бонус Лікування %
vi: Tăng trị liệu +{value}%
zh_cn: {value}%回血加成
zh_tw: {value} 治療加成 %

source: Gacha
es_es: Gachapón
ja: 祈祷
uk: Гача
vi: Cầu Nguyện
zh_cn: 祈愿
zh_tw: 抽卡

source: Crafting
de: Herstellen
es_es: Fabricado
fr: Forge
it_it: Creazione
ja: 鋳造
uk: Виковування
vi: Rèn
zh_cn: 合成
zh_tw: 合成

source: Starglitter Exchange
de: Mit Sternenglanz kaufen
es_es: Brillo estelar
fr: Échange Astéries
it_it: Scambio di Polvere stellare
ja: スターライト交換
uk: Магазин Паймон
vi: Đổi shop Tinh Huy
zh_cn: 星辉兑换
zh_tw: 晨暉兌換

source: Chest
de: Truhe
es_es: Cofre
fr: Coffre
ja: 宝箱
uk: Скриня
vi: Rương
zh_cn: 宝箱
zh_tw: 寶箱

source: BP Bounty
de: Erlebnispass-Tresor
es_es: Pase de batalla
fr: Coffre PB
it_it: Ricompensa del Pass Battaglia
ja: 天空紀行
uk: Нагорода БП
vi: Thưởng từ Nhật Ký Hành Trình
zh_cn: 纪行宝匣
zh_tw: 紀行寶匣

source: Monday
de: Montag
es_es: Lunes
fr: Lundi
id: Senin
it_it: Lunedì
ja: 月曜
uk: Понеділок
vi: Thứ 2
zh_cn: 周一
zh_tw: 週一

source: Tuesday
de: Dienstag
es_es: Martes
fr: Mardi
id: Selasa
it_it: Martedì
ja: 火曜
uk: Вівторок
vi: Thứ 3
zh_cn: 周二
zh_tw: 週二

source: Wednesday
de: Mittwoch
es_es: Miércoles
fr: Mercredi
id: Rabu
it_it: Mercoledì
ja: 水曜
uk: Середа
vi: Thứ 4
zh_cn: 周三
zh_tw: 週三

source: Thursday
de: Donnerstag
es_es: Jueves
fr: Jeudi
id: Kamis
it_it: Giovedì
ja: 木曜
uk: Четвер
vi: Thứ 5
zh_cn: 周四
zh_tw: 週四

source: Friday
de: Freitag
es_es: Viernes
fr: Vendredi
id: Jum'at
it_it: Venerdì
ja: 金曜
uk: П'ятниця
vi: Thứ 6
zh_cn: 周五
zh_tw: 週五

source: Saturday
de: Samstag
es_es: Sábado
fr: Samedi
id: Sabtu
it_it: Sabato
ja: 土曜
uk: Субота
vi: Thứ 7
zh_cn: 周六
zh_tw: 週六

source: Sunday
de: Sonntag
es_es: Domingo
fr: Dimanche
id: Minggu
it_it: Domenica
ja: 日曜
uk: Неділя
vi: Chủ Nhật
zh_cn: 周日
zh_tw: 週日

source: All
de: Alle
es_es: Todos
fr: Tout
id: Semua
it_it: Tutti
ja: すべて
uk: Все
vi: Tất cả
zh_cn: 所有
zh_tw: 全部

source: Description
de: Beschreibung
es_es: Descripción
id: Deskripsi
it_it: Descrizione
ja: 説明
uk: Опис
vi: Mô tả
zh_cn: 描述
zh_tw: 描述

source: Rarity
de: Seltenheit
es_es: Rareza
fr: Rareté
it_it: Qualità
ja: レア度
uk: Рідкість
vi: Cấp Sao
zh_cn: 珍稀度
zh_tw: 品質

source: Element
es_es: Elemento
fr: Élément
id: Elemen
it_it: Elemento
ja: 元素
uk: Елемент
vi: Vision
zh_cn: 元素
zh_tw: 元素

source: Region
es_es: Región
fr: Région
id: Wilayah
it_it: Nazione
ja: 場所
uk: Регіон
vi: Khu vực
zh_cn: 地区
zh_tw: 地區

source: Weapon
de: Waffe
es_es: Arma
fr: Arme
id: Senjata
it_it: Materiale d’ascensione armi
ja: 武器
uk: Зброя
vi: Vũ khí
zh_cn: 武器
zh_tw: 武器

source: Role
de: Rolle
es_es: Rol
fr: Rôle
it_it: Ruolo
ja: 役割
uk: Роль
vi: Vai trò
zh_cn: 角色
zh_tw: 抽

source: Gender
de: Geschlecht
es_es: Género
fr: Sexe
id: Jenis Kelamin
it_it: Genere
ja: 性別
uk: Стать
vi: Giới tính
zh_cn: 性别
zh_tw: 性別

source: Male
de: männlich
es_es: Hombre
fr: Homme
id: Laki-laki
it_it: Maschio
ja: 男性
uk: Чоловіча
vi: Nam
zh_cn: 男
zh_tw: 男性

source: Female
de: weiblich
es_es: Mujer
fr: Femme
id: Perempuan
it_it: Femmina
ja: 女性
uk: Жіноча
vi: Nữ
zh_cn: 女
zh_tw: 女性

source: Elements
de: Elemente
es_es: Elementos
fr: Éléments
id: Elemen
it_it: Elementi
ja: 元素
uk: Елементи
vi: Nguyên tố
zh_cn: 元素
zh_tw: 元素

source: Elemental Debuffs
de: Elementare Debuffs
es_es: Debuffs Elementales
fr: Affaiblissements élémentaires
id: Debuff Elemental
it_it: Debuff Elementali / Anomalie geomantiche
ja: 元素デバフ
uk: Елементальний Дебафф
vi: Ảnh hưởng của nguyên tố
zh_cn: 元素减益
zh_tw: 元素減益

# elementalDebuffsExplained
source: Each of these have a different negative effect when applied to you or your enemies
de: Jeder einzelne hat einen anderen negativen Effekt wenn er gegen Gegner verwendet wird
es_es: Cada uno de estos tienen diferentes efectos negativos cuando son aplicados a ti o a tus enemigos
fr: Les éléments suivants ont des effets négatifs quand ils s'appliquent sur vous ou vos ennemies
id: Masing-masing memiliki efek negatif yang berbeda ketika diterapkan padamu atau musuhmu
it_it: Ogni elemento ha effetti negativi che possono colpire chiunque.
ja: 自キャラクターや敵に適用されたときに異なる悪影響を及ぼします
uk: Кожен з цих елементів накладає свій негативний ефект на вас або ваших ворогів
vi: Gây ảnh hưởng lên địch hoặc người chơi
zh_cn: 秘境中的敌人或自身会持续受到以下元素影响。
zh_tw: 每一種元素都會為敵人或自身帶來負面影響

source: Elemental Reactions
de: Elementarreaktion
es_es: Reacciones Elementales
fr: Réactions élémentaires
id: Reaksi Elemental
it_it: Reazioni elementali
ja: 元素反応
uk: Елементальна Реакція
vi: Phản ứng nguyên tố
zh_cn: 元素反应
zh_tw: 元素反應

# elementalReactionsExplained
source: Combinations of different elements produces different reactions
de: Kombinationen von verschiedenen Elementen produziert verschiedene Reaktionen
es_es: Combinaciones de diferentes elementos producen diferentes reacciones
fr: Les combinaisons des différents éléments produisent différentes réactions
id: Kombinasi elemen yang berbeda menghasilkan reaksi yang berbeda
it_it: Combinare elementi per innescare reazioni elementali è la chiave per vincere ogni battaglia! (In alcuni casi gli effetti delle reazioni elementali possono interessare anche il tuo personaggio)
ja: 異なる元素の組み合わせは元素反応を発生させます
uk: Комбінація різних елементів викликають різні елементальні реакції
vi: Kết hợp các nguyên tố khác nhau, tạo ra phản ứng đặc biệt
zh_cn: 不同元素的组合会产生不同反应。
zh_tw: 不同元素組合會產生不同反應

source: Elemental Resonances
de: Elementarer Einklang
es_es: Resonancias Elementales
fr: Résonances élémentaires
id: Resonansi Elemental
it_it: Risonanze elementali
ja: 元素共鳴
uk: Елементальний Резонанс
vi: Cộng hưởng nguyên tố
zh_cn: 元素搭配
zh_tw: 元素共鳴

# elementalResonancesExplained
source: Having these types of character in your party will give you the corresponding effect
de: Wenn deine Truppe vollständig ist, erhältst du je nach den Elementartypen der aufgestellten Figuren einen Effekt des elementaren Einklangs.
es_es: Teniendo estos tipos de personajes en tu equipo te darán el efecto correspondiente
fr: Avoir ces types de personnages dans son équipe donnera les effets suivant
id: Memiliki karakter dengan tipe ini pada partymu akan memberikan efek sebagai berikut
it_it: Se il tuo gruppo è al completo, riceverai gli effetti della risonanza elementale corrispondente ai tipi di elemento dei personaggi presenti nel gruppo. Massimo 2 risonanze elementali per gruppo.
ja: チームに編成した元素の数と種類に応じて常時発動する効果
uk: Наявність персонажів таких типів у вашій групі дає вам відповідний ефект
vi: Dựa vào loại nguyên tố của nhân vật trong đội, nhận được những hiệu quả cộng hưởng nguyên tố tương ứng
zh_cn: 队伍里使用这些组合会带来相应的影响。
zh_tw: 根據隊伍配置的腳色元素類型，獲得對應的元素共鳴效果

# todayAscensionMaterials
source: Today's Ascension Materials
de: Heutige Aufstiegsmaterialien
es_es: Materiales de Ascensión para Hoy
fr: Matériaux d’Élévation du Jour
id: Material Ascension Hari ini
it_it: Oggi disponibili
ja: 今日の天賦強化素材
uk: Щоденний Збір
vi: Những nguyên liệu ngày hôm nay
zh_cn: 今日提升素材
zh_tw: 今日升級素材

source: See all
de: Siehe alle
es_es: Ver todos
fr: Voir tout
id: Lihat semua
it_it: Vedi tutto
ja: すべて表示
uk: Показати Все
vi: Xem tất cả
zh_cn: 查看全部
zh_tw: 查看全部

source: Characters
de: Charaktere
es_es: Personajes
fr: Personnages
id: Karakter
it_it: Personaggi
ja: キャラクター
uk: Персонажі
vi: Nhân Vật
zh_cn: 角色
zh_tw: 角色

source: Weapons
de: Waffen
es_es: Armas
fr: Armes
id: Senjata
it_it: Armi
ja: 武器
uk: Зброя
vi: Vũ Khí
zh_cn: 武器
zh_tw: 武器

source: Artifacts
de: Artefakte
es_es: Artefactos
fr: Artefacts
id: Artefak
it_it: Manufatti
ja: 聖遺物
uk: Артефакти
vi: Thánh Di Vật
zh_cn: 圣遗物
zh_tw: 聖遺物

source: Home
es_es: Inicio
fr: Menu
ja: ホーム
uk: Головна
vi: Trang chủ
zh_cn: 主页
zh_tw: 首頁

source: Map
de: Karte
es_es: Mapa
fr: Carte
it_it: Mappa
ja: マップ
uk: Карта
vi: Bản đồ
zh_cn: 地图
zh_tw: 地圖

source: Type
de: Typ
es_es: Tipo
id: Tipe
it_it: Tipo
ja: 種類
uk: Тип
vi: Loại
zh_cn: 种类
zh_tw: 類型

source: Base ATK
de: Basis ATK
es_es: ATQ Base
fr: Attaque de base
it_it: ATT di base
ja: 基本攻撃力
uk: Базова ATK
vi: Tấn công căn bản
zh_cn: 基础攻击
zh_tw: 基礎攻擊力

# secondaryState
source: Secondary Stat
de: Sub Stats
es_es: Stat Secundario
fr: Stat Secondaire
it_it: Stat. Secondaria
ja: サブ効果
uk: Дод. характеристика
vi: Chỉ số phụ
zh_cn: 生命值
zh_tw: 副詞條

source: Secondary Stat Value
de: Sub Stat Wert
es_es: Valor del Stat Secundario
fr: Valeur Stat Secondaire
id: Nilai Secondary Stat
it_it: Valore Stat. Secondaria
ja: サブ効果値
uk: Значення дод. характеристики
vi: Chỉ số phụ
zh_cn: 生命值
zh_tw: 副詞條品質

source: Location
de: Ort
es_es: Ubicación
fr: Localisation
id: Lokasi
it_it: Origine
ja: 入手法
uk: Місцезнаходження
vi: Nơi nhận
zh_cn: 位置
zh_tw: 地點

source: Loading
de: Lädt
es_es: Cargando
fr: Chargement...
id: Memuat
it_it: Caricamento
ja: 読込中...
uk: Завантаження
vi: Đang tải
zh_cn: 加载中
zh_tw: 載入中

source: For characters
de: Für Charaktere
es_es: Para personajes
fr: Pour les personnages
id: Untuk Karakter
it_it: Per ascendere i talenti
ja: 素材別キャラクター
uk: Для Персонажів
vi: Cho nhân vật
zh_cn: 用于角色
zh_tw: 角色天賦專用

source: For weapons
de: Für Waffen
es_es: Para armas
fr: Pour les armes
id: Untuk Senjata
it_it: Per ascendere le armi
ja: 素材別武器
uk: Для Зброї
vi: Cho vũ khí
zh_cn: 用于武器
zh_tw: 武器突破專用

source: Cancel
de: Abbrechen
es_es: Cancelar
fr: Annuler
it_it: Annulla
ja: キャンセル
uk: Закрити
vi: Hủy
zh_cn: 取消
zh_tw: 取消

source: Ok
de: Okay
ja: 決定
uk: ОК
vi: Xác Nhận
zh_cn: 好
zh_tw: 確認

source: Others
de: Andere
es_es: Otros
fr: Autres
id: Lainnya
it_it: Altro
ja: その他
uk: Інше
vi: Khác
zh_cn: 其它
zh_tw: 其他

source: Filters
de: Filter
es_es: Filtros
fr: Filtres
id: Filter
it_it: Filtra
ja: フィルター
uk: Фільтри
vi: Lọc
zh_cn: 筛选
zh_tw: 篩選

source: Sort by
de: Sortieren nach
es_es: Ordenar por
fr: Trier Par
id: Urutkan Berdasarkan
it_it: Ordina per
ja: 並び替え
uk: Сортувати за
vi: Sắp xếp theo
zh_cn: 排序方式
zh_tw: 排序方式

source: Flower
de: Blume des Lebens
es_es: Flor
fr: Fleur
it_it: Fiore della vita
ja: 生の花
uk: Квітка
vi: Hoa
zh_cn: 花
zh_tw: 生之花

source: Plume
de: Feder des Todes
es_es: Pluma
it_it: Piuma della morte
ja: 死の羽
uk: Перо
vi: Lông
zh_cn: 羽
zh_tw: 死之羽

source: Clock
de: Sand der Zeit
es_es: Reloj
fr: Sablier
it_it: Sabbie del tempo
ja: 時の砂
uk: Годинник
vi: Đồng Hồ
zh_cn: 沙
zh_tw: 時之沙

source: Goblet
de: Kelch der Leere
es_es: Copa
fr: Coupe
it_it: Calice eonotemo
ja: 空の杯
uk: Кубок
vi: Ly
zh_cn: 杯
zh_tw: 空之杯

source: Crown
de: Haarreif der Vernunft
es_es: Corona
fr: Diadème
it_it: Corona della ragione
ja: 理の冠
uk: Корона
vi: Vương miện
zh_cn: 冠
zh_tw: 理之冠

# elementalDmgPercentage
source: Elemental DMG %
de: Elementar Schaden %
es_es: Daño Elemental %
fr: DGT Élémentaires %
it_it: DAN elementale %
ja: 元素ダメージ%
uk: Елементальна шкода %
vi: % ST Nguyên tố
zh_cn: 元素伤害 %
zh_tw: 元素傷害 %

source: Healing Bonus
de: Heilungsbonus
es_es: Bonus de curación
fr: Bonus de soin
it_it: Bonus di guarigione
ja: 治癒バフ
uk: Бонус Лікування
vi: Tăng Trị Liệu
zh_cn: 治疗加成
zh_tw: 治療加成

source: Note
de: Notiz
es_es: Nota
id: Catatan
it_it: Nota
ja: メモ
uk: Примітка
vi: Ghi chú
zh_cn: 注意
zh_tw: 備註

source: Ascension Materials
de: Aufstiegsmaterialien
es_es: Materiales de Ascensión
fr: Matériaux d’élévation
id: Material Ascension
it_it: Materiali per l’ascensione
ja: 天賦強化素材
uk: Матеріали Вознесіння
vi: Nguyên liệu đột phá
zh_cn: 突破材料
zh_tw: 升級素材

source: Released
de: Veröffentlicht
es_es: Publicado
fr: Disponible
id: Rilis
it_it: Rilasciato
ja: 実装済
uk: Випущений
vi: Đã ra mắt
zh_cn: 已发布
zh_tw: 已釋出

source: Unreleased
de: noch nicht veröffentlicht
es_es: No Publicado
fr: Non disponible
id: Belum Rilis
it_it: Non rilasciato
ja: 未実装
uk: Невипущений
vi: Chưa ra mắt
zh_cn: 未发布
zh_tw: 尚未釋出

source: Coming soon
de: Bald verfügbar
es_es: Próximamente
fr: Prochainement
id: Segera
it_it: In arrivo
ja: 近日公開
uk: Скоро
vi: Chờ ra mắt...
zh_cn: 即将发布
zh_tw: 敬請期待

source: Recent
de: Neueste
es_es: Reciente
fr: Récent
id: Baru
it_it: Recenti
ja: 最近
uk: Недвній
vi: Gần đây
zh_cn: 最近
zh_tw: 最近

source: Level
es_es: Nivel
fr: Niveau
it_it: Livello
ja: レベル
uk: Рівень
vi: Cấp
zh_cn: 级别
zh_tw: 等級

source: Materials
de: Materialien
es_es: Materiales
fr: Matériaux
id: Material
it_it: Materiali
ja: 素材
uk: Матеріали
vi: Nguyên liệu
zh_cn: 材料
zh_tw: 素材

# constellationX
source: Constellation {value}
de: Sternbild {value}
es_es: Constelación {value}
id: Konstelasi {value}
it_it: Costellazione {value}
ja: 命ノ星座 {value}
uk: Сузір'я {value}
vi: Cung Mệnh {value}
zh_cn: 命之座层数 {value}
zh_tw: 命之座 {value}

source: Constellations
de: Sternbilder
es_es: Constelaciones
id: Konstelasi
it_it: Costellationi
ja: 命ノ星座
uk: Сузір'я
vi: Cung Mệnh
zh_cn: 命之座
zh_tw: 命之座

source: Passives
de: Talente
es_es: Pasivas
fr: Passifs
id: Pasif
it_it: Talenti passivi
ja: 固有天賦
uk: Пасивні
vi: Thiên phú
zh_cn: 被动技能
zh_tw: 被動

source: Unlocked Automatically
de: Automatisch entsperrt
es_es: Desbloqueada Automáticamente
fr: Se débloque automatiquement
id: Terbuka Otomatis
it_it: Sbloccato automaticamente
ja: 初期解放
uk: Розблоковуються Автоматично
vi: Tự động mở khóa
zh_cn: 自动解锁
zh_tw: 自動解鎖

# unlockedAtAscensionLevelX
source: Unlocked at ascension level {value}
de: Wird Entsperrt bei Stufe {value}
es_es: Desbloqueada en nivel de ascención {value}
fr: Se débloque au niveau d’élévation {value}
id: Terbuka pada Tahap Ascension {value}
it_it: Sbloccato al livello di ascensione {value}
ja: 突破段階｢{value}｣で開放
uk: Розблоковуються на {value} рівні сходження
vi: Nhân vật đột phá cấp {value}
zh_cn: 解锁于突破等级 {value}
zh_tw: 提升等級後解鎖 {value}

source: Skills
de: Fähigkeiten
es_es: Habilidades
fr: Compétences
id: Skill
it_it: Talenti
ja: スキル
uk: Здібності
vi: Kỹ Năng
zh_cn: 天赋
zh_tw: 技能

source: Talents Ascension
de: Talentstufen
es_es: Talentos de Ascención
fr: Élévation d’aptitudes
id: Penguatan Talenta
it_it: Ascensione talenti
ja: 天賦強化素材
uk: Вознесіння Талантів
vi: Nguyên liệu thiên phú
zh_cn: 技能升级
zh_tw: 天賦等級

# talentAscensionX
source: Talent Ascension {value}
de: Talentstufe {value}
es_es: Talento de Ascención {value}
fr: Élévation d’aptitude {value}
id: Penguatan Talenta {value}
it_it: Ascensione talento {value}
ja: 天賦強化素材 {value}
uk: Вознесіння {value} Таланту
vi: NL. Thiên phú {value}
zh_cn: 技能等级 {value}
zh_tw: 天賦等級 {value}

source: Search
de: Suche
es_es: Buscar
fr: Rechercher...
id: Cari
it_it: Cerca
ja: 検索
uk: Пошук
vi: Tìm kiếm
zh_cn: 搜索
zh_tw: 搜尋

source: Sort direction
de: Sortierung
es_es: Dirección de ordenamiento
fr: Ordre
id: Arah Urutan
it_it: Ordina direzione
ja: 並べ替え方向
uk: Напрямок сортування
vi: Hướng sắp xếp
zh_cn: 排序方向
zh_tw: 排序方式

source: Refinements
de: Verfeinerung
es_es: Refinamientos
fr: Raffinement
id: Refinement
it_it: Grado miglioramento
ja: 精錬
uk: Пробудження
vi: Tinh luyện
zh_cn: 天赋等级
zh_tw: 精煉

source: Sort type
de: Sortiertyp
es_es: Tipo de clasificación
fr: Type de tri
id: Tipe Urutan
it_it: Ordina la tipologia
ja: ソートタイプ
uk: Тип сортування
vi: Xếp theo loại
zh_cn: 排序类别
zh_tw: 排序類型

# asc
source: Ascending
de: Aufsteigend
es_es: Ascendente
fr: Ascendant
id: Menaik
it_it: Crescente
ja: 昇順
uk: Висхідне
vi: Tăng dần
zh_cn: 升序
zh_tw: 提升

# desc
source: Descending
de: Absteigend
es_es: Descendente
fr: Descendant
id: Menurun
it_it: Decrescente
ja: 降順
uk: Низхідне
vi: Giảm dần
zh_cn: 降序
zh_tw: 降低

source: Name
es_es: Nombre
fr: Nom
id: Nama
it_it: Nome
ja: 名前
uk: Назва
vi: Tên
zh_cn: 名字
zh_tw: 名稱

source: Weapon type
de: Waffentyp
es_es: Tipo de arma
fr: Type d'arme
id: Tipe Senjata
it_it: Tipo di arma
ja: 武器の種類
uk: Тип зброї
vi: Loại vũ khí
zh_cn: 武器类别
zh_tw: 武器類型

source: Nothing to show
de: Nichts anzuzeigen
es_es: Nada para mostrar
fr: Rien à afficher
id: Tidak ada yang dapat ditampilkan
it_it: Nessun risultato
ja: 表示するものはありません
uk: Нічого показувати
vi: Không có thông tin
zh_cn: 无结果
zh_tw: 查無資料

source: Theme
de: Thema
es_es: Tema
fr: Thème
id: Tema
it_it: Tema
ja: テーマ
uk: Тема
vi: Chủ đề
zh_cn: 主题
zh_tw: 主題

source: Settings
de: Einstellungen
es_es: Ajustes
fr: Paramètres
id: Pengaturan
it_it: Impostazioni
ja: 設定
uk: Налаштування
vi: Cài Đặt
zh_cn: 设置
zh_tw: 設定

source: Accent color
de: Akzentfarbe
es_es: Color de acento
fr: Couleur d'accentuation
id: Warna Accent
it_it: Accento cromatico
ja: アクセントカラー
uk: Кольоровий акцент
vi: Nền màu
zh_cn: 主题色
zh_tw: 主題顏色

source: Choose base app theme
de: Wähle ein Basis App Thema
es_es: Seleciona un tema base
fr: Choisir le thème
id: Pilih Tema Base App
it_it: Scegli il tema principale dell'app
ja: アプリの基本テーマを選択
uk: Оберіть базову тему додатку
vi: Chọn chế độ nền
zh_cn: 选择 App 主题
zh_tw: 請選擇一個基本主題

# chooseAccentColor
source: Choose an accent color
de: Wähle eine Akzentfarbe
es_es: Seleciona un color de acento
fr: Choisir une couleur d'accentuation
id: Pilih Warna Accent
it_it: Scegli un accento cromatico
ja: アクセントカラーを選ぶ
uk: Оберіть колір акценту
vi: Chọn màu cho nền.
zh_cn: 选择一个主题色
zh_tw: 請選擇一個主題顏色

source: Language
de: Sprache
es_es: Idioma
fr: Langue
id: Bahasa
it_it: Lingua
ja: 言語
uk: Мова
vi: Ngôn Ngữ
zh_cn: 语言
zh_tw: 語言

# chooseLanguage
source: Choose a language
de: Wähle eine Sprache
es_es: Selecciona un idioma
fr: Choisir une langue
id: Pilih Bahasa
it_it: Scegli una lingua
ja: 言語選択
uk: Оберіть мову
vi: Chọn ngôn ngữ phù hợp
zh_cn: 选择一种语言
zh_tw: 請選擇一個語言

# aboutSummary
source: A Genshin Impact kinda database app
de: Eine Datenbank für Genshin Impact
es_es: Una aplicación de tipo base de datos para Genshin Impact
fr: Une sorte de base de données pour Genshin Impact
id: Semacam Aplikasi Database untuk Genshin Impact
it_it: Un'app di database non ufficiale di Genshin Impact
ja: 原神のデータベースアプリ
uk: База даних для Genshin Impact
vi: Nơi lưu trữ những thông tin cơ bản về Genshin Impact
zh_cn: 一个原神数据库
zh_tw: 這是一個原神資料庫

# appInfo
source: App information
es_es: Información de la aplicación
fr: Informations sur l'application
id: Informasi Aplikasi
it_it: Le informazioni sull'app
ja: アプリ情報
uk: Інформація про додаток
vi: Thông tin ứng dụng
zh_cn: App 信息
zh_tw: 應用程式資訊

source: Support
es_es: Soporte
id: Dukung
it_it: Supporto
ja: サポート
uk: Підтримка
vi: Hỗ Trợ
zh_cn: 支持
zh_tw: 支援
