Repository: Wolfteam/Shiori
Catalog: lib/l10n/intl_*.arb
Languages: de, es_es, fr, id, it_it, ja, uk, vi, zh_cn, zh_tw

# supportMsg
source: I made this app in my free time and it is also open source. If you would like to help me, report an issue, have an idea, want a feature to be implemented, etc, please open an issue in my Github:
de: Diese App wurde von mir in meiner Freizeit erstellt und ist demnach frei zugänglich. Solltest du Probleme oder Vorschläge oder Ideen haben, so öffne einen Eintrag auf meinem GitHub unter Issues:
es_es: Hice esta aplicación en mi tiempo libre y también es de código abierto. Si deseas ayudarme, informar de un problema, tienes una idea, deseas que se implemente una funcionalidad, etc., crea un issue en mi Github.
fr: J'ai créé cette application sur mon temps libre et elle est également Open Source. Si vous souhaitez m'aider, signaler un problème, que vous avez une idée, ou que vous voulez qu'une fonctionnalité soit implémentée ou autre, veuillez ouvrir un "Issue" dans mon GitHub.
id: Saya membuat aplikasi ini pada waktu luang dan juga Open Source. Jika kamu ingin membantu, melaporkan masalah, memiliki ide, ingin menambahkan fitur, dll, silahkan buka issue di GitHub saya:
it_it: Ho realizzato questa app open source nel mio tempo libero. Se ti piacerebbe aiutare, segnalare un problema, suggerire un'idea o una funzione da implementare, oppure altro ... puoi aprire un "issues" nel mio GitHub.
ja: 私は暇な時間にこのアプリを作りました、このアプリはオープンソースです。 サポート、問題の報告、アイデア、機能の実装などをご希望の場合は、Githubで問題(Issues)を開いてください。
uk: Я створив цей додаток у вільний час, і він має відкритий вихідний код. Якщо ви хочете мені допомогти, повідомити про проблему, або у вас є ідея, хочете реалізувати функцію, тощо, будь ласка, відкрийте Issue в моєму Github.
vi: Tôi tạo ứng dụng này trong thời gian rảnh và nó cũng ở dạng mã nguồn mở. Nếu bạn muốn giúp đỡ tôi, báo cáo sự cố, có ý tưởng, muốn một tính năng mới,... hãy đăng thông tin lên Github của tôi.
zh_cn: 我用闲暇时间开发了这款 App，同时也把它开源了。无论你是想提供帮助、提交 issue、有个想法、需要一个功能等等，都可以在我的 Github 上提交一个 issue。
zh_tw: 我在閒暇之餘製作了這個開放原始碼應用程式。如果您想提供協助、回報問題、提出建議、希望新增功能等等，歡迎在我的Github提出問題。

source: Issues
de: Problem
es_es: Inconvenientes
fr: Problèmes
it_it: Problemi
ja: 問題
uk: Питання
vi: Vấn đề
zh_tw: 如果您想要提出建議或問題請透過以下方式告訴我：

source: Disclaimer
fr: Avertissement
ja: 免責事項
uk: Відмова від відповідальності
vi: Tuyên bố từ chối trách nhiệm
zh_cn: 免责声明
zh_tw: 免責聲明

# disclaimerMsg
source: This app is not affiliated with or endorsed by miHoYo. GenshinDb is just a database app for the Genshin Impact game
de: Diese App wurde nicht von miHoYo erstellt noch wird sie davon unterstützt. Sie stellt lediglich eine Datenbank für das Spiel Genshin Impact dar.
es_es: Esta app no está afiliada ni asociada a miHoYo. Shiori es solo una aplicación de tipo base de datos para el juego Genshin Impact
fr: Cette application n'est ni affiliée, ni approuvée par miHoYo. Shiori est juste une application servant de base de données pour le jeu Genshin Impact.
id: Aplikasi ini tidak berafiliasi dengan atau didukung oleh MiHoYo. GenshinDb hanya aplikasi database untuk game Genshin Impact
it_it: Questa app non è affiliata o approvata da miHoYo. Shiori è solo un'app di database per Genishin Impact.
ja: このアプリはmiHoYoと提携しておらず、miHoYoによって承認されていません。 Shioriは、原神のデータベースアプリです。
uk: Цей додаток не пов’язаний з miHoYo та не підтримується нею. Shiori — це просто база даних для гри Genshin Impact
vi: Ứng dụng này không liên kết hoặc được xác nhận bởi miHoYo. Shiori chỉ là một cơ sở dữ liệu của trò chơi Genshin Impact
zh_cn: 该 App 不属于 miHoYo 且并未获得其认可。Shiori 仅是一个「原神」游戏的数据软件。
zh_tw: 本應用程式不屬於米哈遊且並未獲得其認可。GenshinDb僅僅是「原神」這個遊戲的資料庫。

# restartMayBeNeeded
source: A restart may be needed for the changes to take effect
de: Möglicherweise ist ein Neustart erforderlich, damit die Änderungen wirksam werden.
es_es: Puede ser necesario reiniciar la app para que los cambios tomen efecto
fr: Un redémarrage peut être nécessaire pour que les modifications prennent effet
id: Restart mungkin diperlukan untuk menerapkan perubahan
it_it: Riavvia per rendere effettivi i cambiamenti
ja: 変更を有効にするには、再起動が必要になる場合があります
uk: Щоб зміни набули чинності, може знадобитися перезапуск
vi: Có thể cần khởi động lại để áp dụng những thay đổi
zh_cn: 请重启应用以生效改变
zh_tw: 可能需要重新啟動應用程式才能使您的變更生效

source: You can also send me an email
de: Kontakt per E-Mail:
es_es: También puedes enviarme un correo
fr: Vous pouvez également m'envoyer un mail:
id: Kamu juga dapat mengirim saya email
it_it: Puoi anche scrivere una mail
ja: 私にメールを送ることもできます
uk: Ви також можете надіслати мені електронний лист
vi: Bạn có thể gửi vấn đề đến email của tôi:
zh_cn: 你也可以发我一封邮件
zh_tw: 或是傳送一封電子郵件給我：

source: Partial
de: Teilweise
es_es: Parcial
fr: Partiel
id: Sebagian
it_it: Incompleto
ja: 部分的
uk: Частковий
vi: Một phần
zh_cn: 部分
zh_tw: 部分

source: No internet connection
de: Keine Internetverbindung
es_es: No hay conexión hay internet
fr: Aucune connexion Internet
id: Tidak ada koneksi internet
it_it: Nessuna connessione a Internet
ja: インターネットに接続できません
uk: Немає підключення до Інтернету
vi: Không có kết nối Internet
zh_cn: 无网络连接
zh_tw: 尚未連接至網際網路

source: Wish simulator
de: Gebetssimulator
es_es: Simulador de Deseos
fr: Simulateur De Vœux
ja: 祈祷シミュレーター
uk: Симулятор Бажань
vi: Mô phỏng cầu nguyện
zh_cn: 祈愿模拟器
zh_tw: 祈願模擬器

# tryYourLuck
source: Try your luck with this simulator
de: Versuch dein Glück mit diesem Simulator
es_es: Prueba suerte con este simulador de deseos
fr: Tentez votre chance avec ce simulateur
id: Coba keberuntunganmu pada simulator ini
it_it: Quanto sei fortunato? Mettiti alla prova con questo simulatore!
ja: このシミュレーターで運試しができます
uk: Випробуйте вдачу з цим симулятором
vi: Nơi bạn thử nghiệm nhân phẩm của mình
zh_cn: 用这个模拟器检测一下你的运气
zh_tw: 試試你的手氣如何

source: Bonus
ja: ボーナス
uk: Бонус
vi: Thông tin
zh_cn: 加成
zh_tw: 套裝效果

source: Pieces
de: Stücke
es_es: Piezas
fr: Pièces
id: Bagian
it_it: Pezzi del set
ja: ピース
vi: Bộ
zh_cn: 套装
zh_tw: 件套裝

source: Builds
de: Bauweise
id: Build
it_it: Build
ja: ビルド
uk: Збірки
vi: Hợp với
zh_cn: 适用角色
zh_tw: 推薦角色

source: DPS
de: Schaden pro Sekunde
ja: 攻撃
uk: ДД
vi: ST chủ lực
zh_cn: 输出
zh_tw: 輸出

source: Rate this app
de: Bewerte diese App
es_es: Califica esta aplicación
fr: Noter cette application
id: Nilai aplikasi ini
it_it: Valuta questa app
ja: このアプリを評価する
uk: Оцініть цей додаток
vi: Đánh giá ứng dụng
zh_cn: 给这个 App 评分
zh_tw: 為這個應用程式評分

# rateMsg
source: If you like this app, please take a little bit of your time to review it ! It really helps me and it shouldn't take you more than one minute.
de: Wenn du diese App magst, nimm dir bitte etwas Zeit für die Rezension! es würde mir sehr helfen und sollte nicht mehr als eine Minute dauern.
es_es: Si te gusta esta aplicación, por favor tomate un segundo para calificarla ! Al hacerlo, me ayudas y además no te tomará más de un minuto.
fr: Si vous aimez cette application, prenez un peu de votre temps pour la noter ! Cela m'aide vraiment et ne devrait pas vous prendre plus d'une minute.
id: Jika kamu menyukai aplikasi ini, luangkan sedikit waktu Anda untuk meninjaunya! Itu sangat membantu saya dan tidak memakan waktu lebih dari satu menit.
it_it: Ti piace questa app? Scrivi una valutazione e aiutaci a migliorare!
ja: このアプリが気に入った場合は、少し時間を取って評価してください！ 本当に役に立ちます。1分以上かかることはありません。
uk: Якщо вам подобається цей додаток, будь ласка, приділіть трохи часу, щоб оцінити його! Це дійсно допоможе мені, і це не займе у вас більше однієї хвилини.
vi: Nếu bạn thích nó xin hãy đánh giá tốt! Nó thực sự giúp ích cho tôi và không tốn của bạn quá 1 phút đâu.
zh_cn: 如果你喜欢这个 App，请花一点时间评价一下！ 这对我很有帮助，而且不会花多少时间。
zh_tw: 如果您喜歡這個應用程式，不妨花點時間為它評分！ 這不會花費超過一分鐘，且對我來說是非常大的鼓勵！

source: Rate
de: Bewertungen
es_es: Calificar
fr: Noter
id: Nilai
it_it: Valuta
ja: 評価する
uk: Оцінити
vi: Đánh giá
zh_cn: 评分
zh_tw: 評分

source: No thanks
de: Nein Danke
es_es: No gracias
fr: Non merci
id: Tidak terima kasih
it_it: No grazie
ja: 結構です
uk: Ні дякую
vi: Không, cảm ơn
zh_cn: 不用
zh_tw: 不用了，謝謝

source: Maybe later
de: Vielleicht Später
es_es: Quizás después
fr: Peut-être plus tard
id: Mungkin nanti
it_it: Forse più tardi
ja: 後で
uk: Можливо пізніше
vi: Có lẽ khi khác
zh_cn: 以后
zh_tw: 下次再說

source: Other apps
de: Andere Apps
es_es: Otras aplicaciones
fr: Autres applications
id: Aplikasi Lainnya
it_it: Altre app
ja: 他のアプリ
uk: Інші додатки
vi: Ứng dụng khác
zh_cn: 其它 App
zh_tw: 其他應用程式

source: General settings
de: Haupteinstellungen
es_es: Ajustes generales
fr: Réglages généraux
id: Pengaturan Umum
it_it: Impostazioni generali
ja: 一般設定
uk: Основні налаштування
vi: Cài đặt chung
zh_cn: 通用设置
zh_tw: 一般設定

source: Show character details
de: Zeige Charakter Details
es_es: Mostrar el detalle de los personajes
fr: Afficher les détails du personnage
id: Tampilkan Detail Karakter
it_it: Mostra i dettagli dei personaggi
ja: キャラクターの詳細を表示する
uk: Показувати деталі про персонажа
vi: Hiển thị chi tiết nhân vật
zh_cn: 显示角色详细信息
zh_tw: 顯示角色詳細資訊

source: Show weapon details
de: Zeige Waffen Details
es_es: Mostrar el detalle de las armas
fr: Afficher les détails de l'arme
id: Tampilkan Detail Senjata
it_it: Mostra i dettagli delle armi
ja: 武器の詳細を表示する
uk: Показувати деталі про зброю
vi: Hiển thị chi tiết vũ khí
zh_cn: 显示武器详细信息
zh_tw: 顯示武器詳細資訊

source: Quest
de: Mission
es_es: Misión
fr: Quête
ja: 任務
uk: Завдання
vi: Nhiệm vụ
zh_cn: 请求
zh_tw: 任務

source: Sub. Stat
fr: Stat Secondaire
ja: サブステータス
uk: Дод. Показники
vi: Stats Phụ
zh_cn: 属性
zh_tw: 主詞條

source: Normal Attack
de: Normaler Angriff
es_es: Ataque Normal
fr: Attaque Normale
it_it: Attacco normale
ja: 通常攻撃
uk: Звичайна Атака
vi: Tấn Công Thường
zh_cn: 普通攻击
zh_tw: 普通攻擊

source: Elemental Skill
de: Elementare Fähigkeit
es_es: Habilidad Elemental
fr: Compétence Élémentaire
it_it: Abilità elementale
ja: 元素スキル
uk: Елементальний Навик
vi: Kỹ Năng Nguyên Tố
zh_cn: 元素战技
zh_tw: 元素戰技

source: Elemental Burst
de: Elementarer Ausbruch
es_es: Habilidad Definitiva
fr: Déchaînement Élémentaire
it_it: Burst elementale
ja: 元素爆発
uk: Вибух Стихій
vi: Kỹ Năng Nộ
zh_cn: 元素爆发
zh_tw: 元素爆發

source: Charged Attack
de: Harter Angriff
es_es: Ataque Cargado
fr: Attaque Chargée
it_it: Attacco caricato
ja: 重撃
uk: Заряджена Атака
vi: Trọng kích
zh_cn: 重击
zh_tw: 重擊

source: Plunging Attack
de: Eintauchender Angriff
es_es: Ataque Descendiente
fr: Attaque Plongeante
it_it: Attacco in picchiata
ja: 落下攻撃
uk: Атака в падінні
vi: Tấn Công khi đáp
zh_cn: 下落攻击
zh_tw: 下落攻擊

source: Hold
de: Halten
es_es: Mantener
fr: Maintenir
id: Tahan
it_it: Pressione prolungata
ja: 長押し
uk: Довге
vi: Giữ
zh_cn: 长按
zh_tw: 長按

source: Press
de: Drücken
es_es: Presionar
fr: Appuyer
id: Tekan
it_it: Pressione
ja: 1回押し
uk: Натискання
vi: Nhấn
zh_cn: 点按
zh_tw: 點按

source: Short
de: Kurz
es_es: Corto
fr: Court
id: Sebentar
it_it: Corto
ja: 短押し
uk: Коротке
vi: Ngắn
zh_cn: 短按

source: Elemental Absorption
de: Elementare Absorption
es_es: Cambio Elemental
fr: Absorption Élémentaire
it_it: Assorbimento elementale
ja: 元素変化
uk: Елементальне Поглинання
vi: Chuyển hóa nguyên tố
zh_cn: 元素吸收
zh_tw: 元素轉化

# xPieces
source: {value} Piece(s)
de: {value} Stück(e)
es_es: {value} Pieza(s)
fr: {value} Pièce(s)
id: {value} Bagian
it_it: Set da {value} pezzi
ja: {value} ピース
uk: {value} Частини
vi: {value} Món(s)
zh_cn: {value} 件套
zh_tw: {value} 件套裝

source: Another World
de: Andere Welt
es_es: Otro Mundo
fr: Un autre monde
id: Dunia Lain
it_it: Altri mondi
ja: 別世界
uk: Інший Світ
vi: Thế giới khác
zh_cn: 另一个世界
zh_tw: 另一個世界

source: Calculators
de: Rechner
es_es: Calculadoras
fr: Calculateurs
id: Kalkulator
it_it: Calcolatrice
ja: 計算機
uk: Калькулятор
vi: Tính toán
zh_cn: 计算器
zh_tw: 素材統計工具

# ascensionMaterialsCalculatorMsg
source: Check how many materials you will need for a character / weapon
de: Berechne wie viele Materialien du für einen Aufstieg eines Charakters oder einer Waffe benötigst
es_es: Comprueba cuantos materiales necesitarás para un personaje / arma
fr: Calculez la quantité de matériaux dont vous aurez besoin pour un personnage / une arme
id: Cek berapa banyak bahan yang dibutuhkan untuk karakter / senjata
it_it: Calcola il necessario per potenziare un personaggio / arma
ja: キャラクター/武器に必要な材料の数を確認できます
uk: Розрахунок, кількості матеріалів для персонажа / зброї
vi: Kiểm tra xem bạn cần bao nhiêu nguyên liệu cho 1 nhân vật hoặc vũ khí
zh_cn: 检查养一个角色/武器需要多少材料
zh_tw: 查看升級角色或武器所需素材數量

source: Add character
de: Charakter Hinzufügen
es_es: Agregar personaje
fr: Ajouter un personnage
id: Tambahkan Karakter
it_it: Aggiungi un personaggio
ja: キャラクター追加
uk: Додати персонажа
vi: Thêm nhân vật
zh_cn: 添加角色
zh_tw: 選擇角色

source: Add weapon
de: Waffe Hinzufügen
es_es: Agregar arma
fr: Ajouter une arme
id: Tambahkan Senjata
it_it: Aggiungi un'arma
ja: 武器追加
uk: Додати зброю
vi: Thêm vũ khí
zh_cn: 添加武器
zh_tw: 選擇武器

# startByAddingMsg
source: Start by adding some characters / weapons
de: Beginne indem du Charaktere oder Waffen hinzufügst
es_es: Empieza por agregar algunos personajes / armas
fr: Commencez par ajouter quelques personnages / armes
id: Mulai dengan menambahkan beberapa Karakter / senjata
it_it: Inizia aggiungendo personaggi / armi
ja: キャラクター/武器を追加することから始めます
uk: Почніть з додавання персонажів / зброї
vi: Bắt đầu bằng cách thêm 1 nhân vật hoặc vũ khí với icon bên dưới
zh_cn: 添加一些角色/武器以开始
zh_tw: 加入角色或武器後開始

source: Current level
de: Derzeitiges Level
es_es: Nivel actual
fr: Niveau actuel
id: Level saat ini
it_it: Livello attuale
ja: 現在のレベル
uk: Початковий рівень
vi: Cấp hiện tại
zh_cn: 当前等级
zh_tw: 目前等級

source: Desired level
de: Gewünschtes Level
es_es: Nivel deseado
fr: Niveau désiré
id: Level yang diinginkan
it_it: Livello desiderato
ja: 目標レベル
uk: Бажаний рівень
vi: Cấp mong muốn
zh_cn: 目标等级
zh_tw: 期望等級

# selectCharacter
source: Select a character
de: Wähle einen Charakter
es_es: Selecciona un personaje
fr: Sélectionnez un personnage
id: Pilih karakter
it_it: Seleziona un personaggio
ja: キャラクター選択
uk: Оберіть персонажа
vi: Chọn nhân vật
zh_cn: 选择一个角色
zh_tw: 請選擇一個角色

# selectWeapon
source: Select a weapon
de: Wähle eine Waffe
es_es: Selecciona un arma
fr: Sélectionnez une arme
id: Pilih senjata
it_it: Seleziona un'arma
ja: 武器選択
uk: Оберіть зброю
vi: Chọn vũ khí
zh_cn: 选择一个武器
zh_tw: 請選擇一個武器

source: Character
de: Charakter
es_es: Personaje
fr: Personnage
id: Karakter
it_it: Personaggio
ja: キャラクター
uk: Персонаж
vi: Nhân Vật
zh_cn: 角色
zh_tw: 角色

source: Summary
de: Zusammenfassung
es_es: Resumen
fr: Résumé
id: Ringkasan
it_it: Sintesi
ja: 概要
uk: Коротка інформація
vi: Tóm tắt
zh_cn: 总结
zh_tw: 總覽

source: Common
de: Gewöhnlich
es_es: Común
fr: Commun
it_it: Risorse comuni
ja: 一般
uk: Загальний
vi: Nguyên liệu thường
zh_cn: 普通材料
zh_tw: 普通素材

source: Local Specialities
de: Lokale Spezialitäten
es_es: Especialidades Locales
fr: Spécialités locales
id: Produk Khas
it_it: Specialità locali
ja: 特産品
uk: Місцеві Дивовижі
vi: Đặc Sản Khu Vực
zh_cn: 特产
zh_tw: 區域特產

source: Boss
es_es: Jefe
ja: ボス
uk: Боси
zh_tw: 首領掉落

source: Day
de: Tag
es_es: Día
fr: Jour
id: Hari
it_it: Giorno
ja: 日
uk: День
vi: Ngày
zh_cn: 日期
zh_tw: 日

source: Currency
de: Währung
es_es: Moneda
fr: Argent
id: Mata Uang
it_it: Valuta
ja: 通貨
uk: Валюта
vi: Tiền tệ
zh_cn: 金钱
zh_tw: 摩拉

source: Birthday
de: Geburtstag
es_es: Cumpleaños
fr: Anniversaire
id: Ulang Tahun
it_it: Compleanno
ja: 誕生日
uk: День Народження
vi: Sinh nhật
zh_cn: 生日
zh_tw: 生日

# todayBirthdays
source: Today's Birthdays
de: Heutige Geburtstage
es_es: Los Cumpleaños de Hoy
fr: Anniversaires d'aujourd'hui
id: Berulang Tahun Hari ini
it_it: I compleanni di oggi
ja: 今日誕生日のキャラクター
uk: Сьогоднішні Дні Народження
vi: Sinh nhật vào hôm nay
zh_cn: 今日生日
zh_tw: 本日壽星

source: Happy Birthday!
de: Herzlichen Glückwunsch zum Geburtstag!
es_es: ¡Feliz Cumpleaños!
fr: Joyeux anniversaire !
id: Selamat Ulang Tahun!
it_it: Buon Compleanno!
ja: 誕生日おめでとう！
uk: З Днем Народження!
vi: Chúc mừng sinh nhật!
zh_cn: 生日快乐！
zh_tw: 生日快樂！

source: Tier List Builder
de: Ranglisten Erzeuger
es_es: Creador de Tier List
fr: Créateur De Tier List
ja: ティアリストビルダー
uk: Створити Tier List
vi: Hệ thống cấp bậc tự chỉnh
zh_cn: 创建角色图鉴
zh_tw: 建立角色圖鑑

# buildYourOwnTierList
source: Build your own character tier list
de: Erzeuge deine eigene Charakter Rangliste
es_es: Crea tu propia tier list de personajes
fr: Créez votre propre Tier List
id: Buat Tier List Karater kamu sendiri
it_it: Costruisci la tua Tier List personale
ja: 独自のキャラクターティアリストを作成する
uk: Створіть свій особистий Tier List
vi: Xây dụng danh sách cấp bậc theo ý bạn
zh_cn: 创建自己的角色图鉴
zh_tw: 建立屬於你的角色圖鑑

# imgSavedSuccessfully
source: Image was successfully saved to the gallery
de: Bild wurde erfolgreich in der Galerie gespeichert
es_es: La imagen fue guardada con éxito en la galería
fr: L'image a été enregistrée dans la galerie avec succès
id: Gambar berhasil disimpan ke galeri
it_it: Immagine salvata con successo nella galleria
ja: 画像がギャラリーに正常に保存されました
uk: Зображення було успішно збережено в галерею
vi: Hình ảnh đã được lưu
zh_cn: 已成功保存到相册
zh_tw: 圖片已儲存至相簿

# acceptToSaveImg
source: To save the image you need to accept the requested permission
de: Um das Bild speichern zu können musst du die Berechtigung erlauben
es_es: Para guardar la imagen debes aceptar el permiso solicitado
fr: Pour sauvegarder l'image, vous devez accepter l'autorisation demandée
id: Untuk menyimpan gambar, kamu harus menerima beberapa izin yang dibutuhkan
it_it: Per salvare l'immagine devi concedere i permessi richiesti
ja: 画像を保存するには、要求された許可を受け入れる必要があります
uk: Щоб зберегти зображення, вам потрібно прийняти запитувані дозволи
vi: Để lưu hình ảnh, bạn cần chấp nhận các quyền:
zh_cn: 需要同意以下权限以保存图像
zh_tw: 請授予應用程式權限以儲存圖片

source: Save
de: Speichern
es_es: Guardar
fr: Sauvegarder
id: Simpan
it_it: Salva
ja: 保存
uk: Зберегти
vi: Lưu
zh_cn: 保存
zh_tw: 儲存

source: Clear all
de: Lösche alle
es_es: Limpiar todo
fr: Effacer tout
id: Bersihkan Semua
it_it: Cancella tutto
ja: すべてクリア
uk: Очистити все
vi: Xóa sạch nhân vật
zh_cn: 全部清除
zh_tw: 全部清除

source: Restore
de: Wiederherstellen
es_es: Restaurar
fr: Restaurer
id: Pulihkan
it_it: Ripristina
ja: 初期化
uk: Відновити
vi: Khôi phục
zh_cn: 恢复
zh_tw: 恢復

# unknownError
source: Unknown error occurred
de: Ein unbekannter Fehler ist aufgetreten
es_es: Un error desconocido ha ocurrido
fr: Une erreur inconnue est survenue
id: Terjadi kesalahan
it_it: Errore sconosciuto
ja: 不明なエラーが発生しました
uk: Сталася невідома помилка
vi: Xảy ra lỗi không xác định
zh_cn: 发生未知错误
zh_tw: 發生不明錯誤

source: Add row above
de: Zeile Oben hinzufügen
es_es: Agregar una fila por encima
fr: Ajouter une ligne au dessus
id: Tambahkan baris diatas
it_it: Aggiungi fila sopra
ja: 上に行を追加
uk: Додайте рядок вище
vi: Thêm hàng ở trên
zh_cn: 上方增加一排
zh_tw: 在上方新增一列

source: Add row below
de: Zeile Unten hinzufügen
es_es: Agregar una fila por debajo
fr: Ajouter une ligne en dessous
id: Tambahkan baris dibawah
it_it: Aggiungi fila sotto
ja: 下に行を追加
uk: Додайте рядок нижче
vi: Thêm hàng ở dưới
zh_cn: 下方增加一排
zh_tw: 在下方新增一列

source: Delete row
de: Zeile löschen
es_es: Borrar fila
fr: Supprimer la ligne
id: Hapus baris
it_it: Elimina fila
ja: 行を削除する
uk: Видалити рядок
vi: Xóa hàng
zh_cn: 删除此排
zh_tw: 刪除此列

source: Clear row
de: Zeile leeren
es_es: Limpiar fila
fr: Effacer le contenu de la ligne
id: Bersihkan baris
it_it: Cancella fila
ja: 行をクリア
uk: Очистити рядок
vi: Xóa nhân vật
zh_cn: 清除此排
zh_tw: 清除此列

source: Change color
de: Farbe ändern
es_es: Cambiar color
fr: Changer la couleur
id: Ubah warna
it_it: Cambia colore
ja: 色を変える
uk: Змінити колір
vi: Chỉnh màu
zh_cn: 更改颜色
zh_tw: 變更顏色

source: Row settings
de: Zeilen Einstellung
es_es: Ajustes de la fila
fr: Paramètres ligne
id: Pengaturan baris
it_it: Impostazioni fila
ja: 行設定
uk: Параметри рядка
vi: Cài đặt hàng
zh_cn: 设置
zh_tw: 設定

source: Rename
de: Name ändern
es_es: Renombrar
fr: Renommer
id: Ubah nama
it_it: Rinomina
ja: 名前を変更
uk: Перейменувати
vi: Chỉnh tên
zh_cn: 重命名
zh_tw: 重新命名

source: Confirm
de: Bestätigen
es_es: Confirmar
fr: Confirmer
id: Konfirmasi
it_it: Conferma
ja: 確認
uk: Підтвердити
vi: Xác nhận
zh_cn: 确认
zh_tw: 確認

# pickColor
source: Pick a color
de: Wähle eine Farbe
es_es: Selecciona un color
fr: Choisir une couleur
id: Pilih warna
it_it: Scegli un colore
ja: 色を選ぶ
uk: Обрати колір
vi: Chọn màu
zh_cn: 选择一个颜色
zh_tw: 請選擇一個顏色

source: Stats
es_es: Estadísticas
it_it: Statistiche
ja: メイン効果
uk: Характеристики
vi: Chỉ số
zh_cn: 状态
zh_tw: 屬性

# baseX
source: Base {value}
de: Basis {value}
es_es: {value} Base
ja: 基礎{value}
uk: Базова {value}
vi: {value} căn bản
zh_cn: 基础 {value}
zh_tw: 基礎 {value}

source: North America
de: Nordamerika
es_es: Norte América
fr: Amérique du Nord
it_it: Nord America
ja: America (アメリカ)
uk: Північна Америка
vi: Bắc Mỹ
zh_cn: 北美
zh_tw: 北美洲

source: Europe
de: Europa
es_es: Europa
it_it: Europa
ja: Europe (ヨーロッパ)
uk: Європа
vi: Châu u
zh_cn: 欧洲
zh_tw: 歐洲

source: Asia
de: Asien
fr: Asie
ja: Asia (アジア)
uk: Азія
vi: Đông Nam Á
zh_cn: 亚洲
zh_tw: 亞洲

# chooseServer
source: Choose a server
de: Wähle einen Server
es_es: Selecciona un servidor
fr: Choisir un serveur
id: Pilih server
it_it: Scegli un server
ja: サーバーを選択してください
uk: Оберіть сервер
vi: Chọn máy chủ
zh_cn: 选择一个服务器
zh_tw: 請選擇伺服器

# serverWhereYouPlay
source: The server where you play
de: Der Server auf dem du spielst
es_es: El servidor donde juegas
fr: Serveur où vous jouez
id: Server tempat kamu bermain
it_it: Server di gioco
ja: あなたがプレイするサーバー
uk: Сервер на якому ви граєте
vi: Máy chủ bạn đang chơi
zh_cn: 你玩游戏的服务器
zh_tw: 您遊玩的伺服器

source: Substats
es_es: Subestadisticas
fr: Stats Secondaires
id: Substat
ja: サブステータス
uk: Доп. Стати
vi: Chỉ số phụ
zh_cn: 属性
zh_tw: 副屬性

source: Anemo
fr: Anémo
ja: 風
uk: Анемо
vi: Phong
zh_cn: 风
zh_tw: 風

source: Cryo
de: Kryo
ja: 氷
uk: Кріо
vi: Băng
zh_cn: 冰
zh_tw: 冰

source: Dendro
ja: 草
uk: Дендро
vi: Thảo
zh_cn: 草
zh_tw: 草

source: Electro
de: Elektro
fr: Électro
ja: 雷
uk: Електро
vi: Lôi
zh_cn: 雷
zh_tw: 雷

source: Geo
fr: Géo
ja: 岩
uk: Гео
vi: Nham
zh_cn: 岩
zh_tw: 岩

source: Pyro
ja: 炎
uk: Піро
vi: Hỏa
zh_cn: 火
zh_tw: 火

source: Hydro
ja: 水
uk: Гідро
vi: Thủy
zh_cn: 水
zh_tw: 水

source: Crafting Materials
de: Materialien zur Herstellung
es_es: Materiales de Elaboración
fr: Matériaux de fabrication
id: Material Crafting
it_it: Materiali per la creazione
ja: 鋳造材料
uk: Матеріали для виготовлення
vi: Chế tạo nguyên liệu
zh_cn: 合成材料
zh_tw: 製作素材

source: Inazuma
ja: 稲妻
uk: Інадзума
zh_cn: 稻妻
zh_tw: 稻妻

source: Mondstadt
ja: モンド
uk: Мондштадт
zh_cn: 蒙德
zh_tw: 蒙德

source: Liyue
ja: 璃月
uk: Лі Юе
zh_cn: 璃月
zh_tw: 璃月

source: Snezhnaya
ja: スネージナヤ
uk: Сніжна
zh_cn: 至冬
zh_tw: 至冬國

source: Fontaine
ja: フォンテーヌ
uk: Фонтейн
zh_cn: 枫丹
zh_tw: 楓丹

source: Natlan
ja: ナタ
uk: Натлан
zh_cn: 纳塔
zh_tw: 納塔

source: Sumeru
ja: スメール
uk: Сумеру
zh_cn: 须弥
zh_tw: 須彌

source: Credits
es_es: Créditos
fr: Crédits
it_it: Crediti
ja: クレジット
uk: Вдячність
zh_cn: 致谢
zh_tw: 銘謝

source: Translators
de: Übersetzer
es_es: Traductores
fr: Traducteurs
id: Translator
it_it: Traduttori
ja: 翻訳者
uk: Перекладачам
vi: Người dịch
zh_cn: 翻译者
zh_tw: 翻譯者

# creditsTranslatorsMsg
source: Translating the app to other languages won't have been possible without the following contributors
de: Die App zu Übersetzen wäre nicht möglich gewesen ohne diese folgenden Helfer
es_es: La aplicación no habría sido traducida a otros lenguajes sin la ayuda de los siguientes contribuidores
fr: Traduire l'application dans d'autres langues n'aurait pas été possible sans les contributeurs suivants :
id: Menerjemahkan aplikasi ini ke bahasa lain tidak akan mungkin dilakukan tanpa kontributor berikut
it_it: La traduzione nelle altre lingue è stata possibile grazie all'aiuto dei seguenti utenti
ja: アプリを他の言語に翻訳することは、以下の貢献者なしでは不可能でした。
uk: Переклад додатка іншими мовами був би неможливий без таких учасників
vi: Dịch sang những ngôn ngữ khác đã thành công nhờ đóng góp của những người sau:
zh_cn: 没有以下贡献者就没有这款 App 的翻译成果。
zh_tw: 沒有以下貢獻者就沒有本應用程式的翻譯成果。

# currentX
source: Current: {value}
de: Gerade: {value}
es_es: Actual: {value}
fr: Actuel: {value}
id: Saat ini: {value}
it_it: Attuale: {value}
ja: 現在: {value}
uk: Поточний: {value}
vi: Cấp hiện tại: {value}
zh_cn: 当前：{value}
zh_tw: 目前: {value}
